import "./style.css";

import vk from "./../../img/icons/vk.svg";
import instagram from "./../../img/icons/instagram.svg";
import twitter from "./../../img/icons/twitter.svg";
import linkedIn from "./../../img/icons/linkedIn.svg";
import gitHub from "./../../img/icons/gitHub.svg";

const Footer = () => {
  return (
    <footer className="footer">
      <div className="container">
        <div className="footer__wrapper">
          <ul className="social">
            <li className="social__item">
              <a href="https://vk.com/">
                <img src={vk} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.instagram.com">
                <img src={instagram} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="#!">
                <img src={twitter} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://github.com/maxmudovdev">
                <img src={gitHub} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.linkedin.com/in/ulugbek-makhmudov-74baaa340/">
                <img src={linkedIn} alt="Link" />
              </a>
            </li>
          </ul>
          <div className="copyright">
            <p>
              
              <br/>
              <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>
1.	Выберите носители информации:	Все ответы верны<br/>
2.	Как физически записана информация на носителе?	В виде последовательности 0 и 1<br/>
3.	Как информация передается по интерфейсу с носителя?	Определенными словами или блоками<br/>
4.	Как информация хранится  на носителе?	Структурированно<br/>
5.	Операционной системе компьютера носитель представляется как -	Набор кластеров<br/>
6.	Логическая структура информации связана	С файловой системой<br/>
7.	Что такое физический дефект информации?	Повреждения, затронувшие область данных<br/>
8.	Что такое логический дефект информации?	Повреждения, затронувшие сведения о структуре информации<br/>
9.	В файле полезная уникальная информация - это	Сами данные <br/>
10.	Служебная информация в файле – это …	Структура данных<br/>
11.	Что такое Raw data?	Все ответы верны<br/>
12.	Когда возникают потери данных на физическом уровне?	Все перечисленное<br/>
13.	Когда происходит нарушения логической структуры?	Все перечисленное<br/>
14.	Что необходимо сделать при нарушении логической структуры данных?	Извлечь сырые данные и воссоздать их структуру<br/>
15.	Выберите правильное направление стратегии защиты информации:	Все перечисленное<br/>
16.	Выберите программное обеспечение для выполнения защитных функций:	Все перечисленное<br/>
17.	Программы, которые определяют факт изменения содержимого файла или папки - это	Программы контроля целостности данных  <br/>
18.	Какое действие выполняют антивирусные программы?	Все перечисленное<br/>
19.	Программы, которые не допускают к работе с системой или с конкретным набором данных того, кто не имеет на это прав:	Программы контроля и разграничения доступа<br/>
20.	Выберите средства для обеспечения надежной защиты конфиденциальных или важных данных от несанкционированного доступа:	Все перечисленное<br/>
21.	Продолжите определение:  При симметричном алгоритме шифрования …	Один и тот же секретный ключ используется и для шифрования, и для дешифрования<br/>
22.	Продолжите определение:  При несимметричном алгоритме шифрования …	Один ключ используется для шифрования, а второй – для дешифрования<br/>
23.	Что из перечисленного может являться защищаемым файлом?	Все перечисленное<br/>
24.	Выберите БД, которая не имеет файл- серверную архитектуру -	MySQL<br/>
25.	Выберите БД, которая имеет клиент- серверную архитектуру -	MySQL<br/>
26.	Найдите средства защиты БД:	Все перечисленное<br/>
27.	Какие могут предоставляться права доступа к таблицам БД?	Все перечисленное<br/>
28.	Понятие «Группа» в БД это  -	Именованная совокупность пользователей<br/>
29.	Понятие «Роль» в БД это -	Именованная совокупность привилегий, которую защищают паролями<br/>
30.	Выберите правильный аспект информационной безопасности для СУБД:	Все перечисленные аспекты<br/>
31.	Выберите неверный аспект информационной безопасности для СУБД:	Объем хранимых данных<br/>
32.	 Что подразумевают под целостностью информационной системы? 	Все перечисленное<br/>
33.	Что применяют для обеспечения целостности информационной системы?	Все перечисленное<br/>
34.	В информационных системах целостность данных, которые не отправляются за пределы системы, обеспечивается за счет …	Отказоустойчивости и восстановления<br/>
35.	В информационных системах целостность данных, которые отправляются за пределы системы, обеспечивается за счет …	Все перечисленное<br/>
36.	Что использует технология Norton AntiVirus?	Все перечисленное<br/>
37.	Укажите неправильную технологию безопасности Norton защиты:	Защита от кратковременных сбоев напряжения<br/>
38.	Что может указать на заражение вредоносным программным обеспечением?	Все перечисленное<br/>
39.	Найдите неправильную функцию систем управления файлами:	Организует систему прерываний <br/>
40.	Как называется совокупность дорожек одного радиуса на всех поверхностях всех пластин диска?	Цилиндр<br/>
41.	Что из перечисленного имеет фиксированный для конкретной системы размер, выражающийся степенью двойки?	Сектор<br/>
42.	Наименьшая адресуемая единица обмена данными это -	Сектор<br/>
43.	На сколько областей в файловой системе FAT делится дисковое пространство любого логического диска:	2<br/>
44.	Назовите неверный компонент системной области:	Данные<br/>
45.	Для чего необходима файловая система?	Для организации структуры хранения<br/>
46.	Как определяется размер файла в ОС?	В байтах<br/>
47.	Какой основной недостаток файловой системы FAT?	Медленная работа с файлами<br/>
48.	Выберите недостаток файловой системы FAT32:	Медленная работа с каталогами, содержащими большое количество файлов<br/>
49.	В какой из файловых систем имя файла может содержать любые символы, включая полный набор национальных алфавитов?	NTFS<br/>
50.	Какая файловая система обеспечивает быстрый доступ к коротким файлам?	NTFS<br/>
51.	Какая файловая система имеет возможность доступа к фрагментам файла?	NTFS<br/>
52.	В какой из файловых систем введен механизм транзакций?	NTFS<br/>
53.	В какой файловой системе ОЗУ должно быть не менее 64 Мбайт?	NTFS<br/>
54.	В какой из файловых систем более низкий износ дисков, вследствие меньшего количества передвижений головок чтения/записи?	FAT32<br/>
55.	В какой из файловых систем информация о содержимом тома с файловой системой хранится в таблице MFT?	NTFS<br/>
56.	В какой из файловых систем сняты ограничения на max количество дисковых секторов и кластеров?	NTFS<br/>
57.	В какой из файловых систем 88 % тома представляют собой обычное пространство для хранения файлов?	NTFS<br/>
58.	В какой из файловых систем имена всех метафайлов начинаются с символа $?	NTFS<br/>
59.	В какой из файловых систем имена файлов чувствительны к регистру?	EXT3<br/>
60.	Найдите неверное утверждение:   Восстановление файлов посредством анализа информации о файлах и папках …	Использует поиск файлов по сигнатурам<br/>
61.	Продолжите выражение: Восстановление файлов при помощи сканирования файлов известных типов …	Использует поиск файлов по сигнатурам<br/>
62.	Что такое файловая сигнатура?	Общий шаблон данных определенного типа файлов<br/>
63.	Где в файле находится файловая сигнатура?	В начале или в конце файла<br/>
64.	Найдите неверный шаг алгоритма программ, предназначенных для восстановления данных -	Дефрагментация файлов на диске с целью объединения разрозненных фрагментов одного файла<br/>
65.	Какие из перечисленных файлов с частичными повреждениями?	Все перечисленные<br/>
66.	Что необходимо учитывать при выборе программы восстановления?	Все перечисленное<br/>
67.	Как осуществляется вход  в режим BIOS?	До загрузки ОС<br/>
68.	Найдите неверную программу для восстановления данных -	Premiere Pro<br/>
69.	Найдите программу для восстановления файлов в случае форматирования диска:	DMDE<br/>
70.	Выберите одну из лучших программ для восстановления данных -	R-studio<br/>
71.	Найдите утилиту, которая может восстановить фотографии и другие типы файлов:	PhotoRec<br/>
72.	Бэкап системы - это	Все перечисленное<br/>
73.	Какая из утилит командной строки позволяет создать образ ОС?	dism<br/>
74.	Какая из утилит используется для проверки памяти?	mdsched<br/>
75.	Какая из утилит используется для преобразования типов дисков, создания разделов и томов?	diskpart<br/>
76.	Какая из утилит позволяет посмотреть список драйверов и их предназначение?	driverquery<br/>
77.	С какими файловыми системами работает программа Paragon Drive Backup?	Со всеми перечисленными<br/>
78.	Что выполняет процедура POST?	Запуск компьютера и тестирование его компонентов<br/>
79.	Что можно сделать в BIOS Setup?	Настройку параметров системы<br/>
80.	После включения кнопки питания первым запускается -	Блок питания<br/>
81.	Что является минимальной порцией данных, имеющей уникальный адрес на жестком диске?	Блок<br/>
82.	Чем определяется система резервного копирования?	Всем перечисленным<br/>
83.	Найдите неправильную часть регулярного процесса резервного копирования -	Периодический запуск антивирусных программ<br/>
84.	Найдите неправильную задачу резервного копирования -	Проверка на наличие вредоносного программного обеспечения<br/>
85.	Найдите неправильную задачу резервного копирования -	Выдача логина и пароля хранимым данных<br/>
86.	Как называется устройство, которое связывает периферийное оборудование с CPU и выполняет интерпретацию команд процессора для отдельных устройств?	Контроллер<br/>
87.	Для сопряжения центральных узлов компьютера с его внешними устройствами служат -	Интерфейсы<br/>
88.	Контроллер взаимодействует …	С драйвером<br/>
89.	Драйвер взаимодействует …	Со всем перечисленным<br/>
90.	За что отвечает файловая система?	За все перечисленное<br/>
91.	Для чего можно использовать командную строку?	Для всех перечисленных операций<br/>
92.	Какое название еще имеет cmd.exe?	Все перечисленные<br/>
93.	Какая команда используется для восстановления удаленных, потерянных, скрытых и зараженных вирусом файлов?	attrib<br/>
94.	Выберите команду, которая применяется для восстановления RAW или поврежденной файловой системы -	rescan<br/>
95.	Какая из команд используется для исправления логических ошибок на диске?	chkdsk<br/>
96.	Что является нарушением организации данных для флеш-памяти?	Форматирование<br/>
97.	Что является нарушением организации данных для жесткого диска?	Повреждение секторов зоны MFT<br/>
98.	Какой способ восстановления необходимо применить в случае форматирования логического диска или раздела?	Восстановление структуры файловой системы<br/>
99.	Какое название имеют специальные программы для уничтожения данных?	Шредеры<br/>
100.	Как называются характерные последовательности символов, которые содержат заголовки файлов многих типов?	Сигнатуры <br/>
101.	Тип файла, который начинается с сигнатуры 5249 -	avi<br/>

102.	Тип файла, который начинается с сигнатуры 424D -	bmp<br/>
103.	Тип файла, который начинается с сигнатуры D0CF -	doc<br/>
104.	Тип файла, который начинается с сигнатуры 504B -	docx<br/>
105.	Тип файла, который начинается с сигнатуры FFD8 -	jpeg<br/>
106.	Какой самый надежный, простой и дешевый способ восстановления информации?	Восстановление из резервных копий<br/>
107.	Как называются файлы, справочная информация которых осталась на жестком диске?	Удаленные<br/>
108.	Как называются файлы, о которых нет справочной информации на жестком диске?	Потерянные<br/>
109.	Укажите неправильное правило при потере данных и их восстановлении -	Зашифровать данные<br/>
110.	В какой из файловых систем лучше восстановится сильно фрагментированный файл?	NTFS<br/>
111.	Есть ли возможность восстановить информацию после низкоуровневого форматирования?	Нет<br/>
112.	Укажите неверный шаг действия Мастера восстановления программы RS NTFS Recovery:	Указать тип вируса<br/>
113.	В каком режиме программы RS NTFS Recovery можно найти и восстановить недавно удаленные файлы?	Быстрого сканирования<br/>
114.	Программа RS NTFS Recovery может работать с файлами:	Со всеми перечисленными<br/>
115.	Выберите правильную функцию программы RS NTFS Recovery:	Все функции правильные<br/>
116.	Что из перечисленного не присутствует в окне программы RS NTFS Recovery?	Дефрагментировать диск<br/>
117.	Какие версии файловой системы поддерживает RS FAT Recovery?	Все перечисленные<br/>
118.	Найдите неверно указанную возможность программы RS FAT Recovery:	Восстановление данных с отформатированных или удаленных логических разделов NTFS<br/>
119.	Какие инструменты включает в себя программа RS Data Recovery?	Все перечисленные инструменты<br/>
120.	Какую файловую систему не поддерживает программа RS Data Recovery?	MFS<br/>
121.	Какой фильтр не поддерживается Мастером восстановления программы RS Data Recovery?	Имя файла<br/>
122.	Какую информацию можно восстановить программой CD Recovery Toolbox?	Все перечисленное<br/>
123.	С каких носителей можно восстановить информацию с помощью программы Recovery Toolbox for CD?	Со всех перечисленных носителей<br/>
124.	Выберите неправильно указанный носитель для восстановления с помощью программы Recovery Toolbox for CD:	Жесткий диск<br/>
125.	На сколько кнопок разделено окно программы 7-Data Recovery Suite?	5<br/>
126.	Найдите неверно указанный раздел программы 7-Data Recovery Suite -	Восстановление поврежденных файлов<br/>
127.	Выберите неверно указанный шаг программы MiniTool Power Data Recovery (восстановление данных за 3 шага) -	Выберите тип анализа<br/>
128.	С какими файловыми системами работает программа R-Studio?	Со всеми перечисленными<br/>
129.	С какими ОС работает программа R-Studio?	Со всеми перечисленными<br/>
130.	Назовите неверно указанный метод восстановления данных программой R-Studio:	Восстановление операционной системы<br/>
131.	Назовите профессиональные возможности восстановления в программе R-Studio -	Все перечисленные<br/>
132.	Назовите профессиональные возможности восстановления в программе R-Studio -	Все перечисленные<br/>
133.	С какими из перечисленных типов носителей работает программа R-Studio?	Со всеми перечисленными<br/>
134.	Выберите неверный параметр доступа к диску программы R-Studio?	Минимальный объем<br/>
135.	Что помечает красным крестиком программа R-Studio?	Удаленный раздел<br/>
136.	Что находится в каталоге Root  после восстановления с помощью программы R-Studio?	Корневая файловая система<br/>
137.	Что находится в каталоге Metafiles  после восстановления с помощью программы R-Studio?	Служебные файлы файловой системы NTFS<br/>
138.	Что находится в каталоге $$$Folder*****  после восстановления с помощью программы R-Studio?	Файлы, которые не удалось связать с корневым каталогом<br/>
139.	При работе программы R-Studio в списке возможных карт расположения информации зеленым цветом выделены -	Хорошие наборы<br/>
140.	При работе программы R-Studio в списке возможных карт расположения информации желтым цветом выделены -	Сомнительные наборы<br/>



</p>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
