import "./style.css";

import vk from "./../../img/icons/vk.svg";
import instagram from "./../../img/icons/instagram.svg";
import twitter from "./../../img/icons/twitter.svg";
import linkedIn from "./../../img/icons/linkedIn.svg";
import gitHub from "./../../img/icons/gitHub.svg";

const Footer = () => {
  return (
    <footer className="footer">
      <div className="container">
        <div className="footer__wrapper">
          <ul className="social">
            <li className="social__item">
              <a href="https://vk.com/">
                <img src={vk} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.instagram.com">
                <img src={instagram} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="#!">
                <img src={twitter} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://github.com/maxmudovdev">
                <img src={gitHub} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.linkedin.com/in/ulugbek-makhmudov-74baaa340/">
                <img src={linkedIn} alt="Link" />
              </a>
            </li>
          </ul>
          <div className="copyright">
            <p>
              
              <br/>
              <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>
              1.	Выберите носители информации:	Все ответы верны
2.	Как физически записана информация на носителе?	В виде последовательности 0 и 1
3.	Как информация передается по интерфейсу с носителя?	Определенными словами или блоками
4.	Как информация хранится  на носителе?	Структурированно
5.	Операционной системе компьютера носитель представляется как -	Набор кластеров
6.	Логическая структура информации связана	С файловой системой
7.	Что такое физический дефект информации?	Повреждения, затронувшие область данных
8.	Что такое логический дефект информации?	Повреждения, затронувшие сведения о структуре информации
9.	В файле полезная уникальная информация - это	Сами данные 
10.	Служебная информация в файле – это …	Структура данных
11.	Что такое Raw data?	Все ответы верны
12.	Когда возникают потери данных на физическом уровне?	Все перечисленное
13.	Когда происходит нарушения логической структуры?	Все перечисленное
14.	Что необходимо сделать при нарушении логической структуры данных?	Извлечь сырые данные и воссоздать их структуру
15.	Выберите правильное направление стратегии защиты информации:	Все перечисленное
16.	Выберите программное обеспечение для выполнения защитных функций:	Все перечисленное
17.	Программы, которые определяют факт изменения содержимого файла или папки - это	Программы контроля целостности данных  
18.	Какое действие выполняют антивирусные программы?	Все перечисленное
19.	Программы, которые не допускают к работе с системой или с конкретным набором данных того, кто не имеет на это прав:	Программы контроля и разграничения доступа
20.	Выберите средства для обеспечения надежной защиты конфиденциальных или важных данных от несанкционированного доступа:	Все перечисленное
21.	Продолжите определение:  При симметричном алгоритме шифрования …	Один и тот же секретный ключ используется и для шифрования, и для дешифрования
22.	Продолжите определение:  При несимметричном алгоритме шифрования …	Один ключ используется для шифрования, а второй – для дешифрования
23.	Что из перечисленного может являться защищаемым файлом?	Все перечисленное
24.	Выберите БД, которая не имеет файл- серверную архитектуру -	MySQL
25.	Выберите БД, которая имеет клиент- серверную архитектуру -	MySQL
26.	Найдите средства защиты БД:	Все перечисленное
27.	Какие могут предоставляться права доступа к таблицам БД?	Все перечисленное
28.	Понятие «Группа» в БД это  -	Именованная совокупность пользователей
29.	Понятие «Роль» в БД это -	Именованная совокупность привилегий, которую защищают паролями
30.	Выберите правильный аспект информационной безопасности для СУБД:	Все перечисленные аспекты
31.	Выберите неверный аспект информационной безопасности для СУБД:	Объем хранимых данных
32.	 Что подразумевают под целостностью информационной системы? 	Все перечисленное
33.	Что применяют для обеспечения целостности информационной системы?	Все перечисленное
34.	В информационных системах целостность данных, которые не отправляются за пределы системы, обеспечивается за счет …	Отказоустойчивости и восстановления
35.	В информационных системах целостность данных, которые отправляются за пределы системы, обеспечивается за счет …	Все перечисленное
36.	Что использует технология Norton AntiVirus?	Все перечисленное
37.	Укажите неправильную технологию безопасности Norton защиты:	Защита от кратковременных сбоев напряжения
38.	Что может указать на заражение вредоносным программным обеспечением?	Все перечисленное
39.	Найдите неправильную функцию систем управления файлами:	Организует систему прерываний 
40.	Как называется совокупность дорожек одного радиуса на всех поверхностях всех пластин диска?	Цилиндр
41.	Что из перечисленного имеет фиксированный для конкретной системы размер, выражающийся степенью двойки?	Сектор
42.	Наименьшая адресуемая единица обмена данными это -	Сектор
43.	На сколько областей в файловой системе FAT делится дисковое пространство любого логического диска:	2
44.	Назовите неверный компонент системной области:	Данные
45.	Для чего необходима файловая система?	Для организации структуры хранения
46.	Как определяется размер файла в ОС?	В байтах
47.	Какой основной недостаток файловой системы FAT?	Медленная работа с файлами
48.	Выберите недостаток файловой системы FAT32:	Медленная работа с каталогами, содержащими большое количество файлов
49.	В какой из файловых систем имя файла может содержать любые символы, включая полный набор национальных алфавитов?	NTFS
50.	Какая файловая система обеспечивает быстрый доступ к коротким файлам?	NTFS
51.	Какая файловая система имеет возможность доступа к фрагментам файла?	NTFS
52.	В какой из файловых систем введен механизм транзакций?	NTFS
53.	В какой файловой системе ОЗУ должно быть не менее 64 Мбайт?	NTFS
54.	В какой из файловых систем более низкий износ дисков, вследствие меньшего количества передвижений головок чтения/записи?	FAT32
55.	В какой из файловых систем информация о содержимом тома с файловой системой хранится в таблице MFT?	NTFS
56.	В какой из файловых систем сняты ограничения на max количество дисковых секторов и кластеров?	NTFS
57.	В какой из файловых систем 88 % тома представляют собой обычное пространство для хранения файлов?	NTFS
58.	В какой из файловых систем имена всех метафайлов начинаются с символа $?	NTFS
59.	В какой из файловых систем имена файлов чувствительны к регистру?	EXT3
60.	Найдите неверное утверждение:   Восстановление файлов посредством анализа информации о файлах и папках …	Использует поиск файлов по сигнатурам
61.	Продолжите выражение: Восстановление файлов при помощи сканирования файлов известных типов …	Использует поиск файлов по сигнатурам
62.	Что такое файловая сигнатура?	Общий шаблон данных определенного типа файлов
63.	Где в файле находится файловая сигнатура?	В начале или в конце файла
64.	Найдите неверный шаг алгоритма программ, предназначенных для восстановления данных -	Дефрагментация файлов на диске с целью объединения разрозненных фрагментов одного файла
65.	Какие из перечисленных файлов с частичными повреждениями?	Все перечисленные
66.	Что необходимо учитывать при выборе программы восстановления?	Все перечисленное
67.	Как осуществляется вход  в режим BIOS?	До загрузки ОС
68.	Найдите неверную программу для восстановления данных -	Premiere Pro
69.	Найдите программу для восстановления файлов в случае форматирования диска:	DMDE
70.	Выберите одну из лучших программ для восстановления данных -	R-studio
71.	Найдите утилиту, которая может восстановить фотографии и другие типы файлов:	PhotoRec
72.	Бэкап системы - это	Все перечисленное
73.	Какая из утилит командной строки позволяет создать образ ОС?	dism
74.	Какая из утилит используется для проверки памяти?	mdsched
75.	Какая из утилит используется для преобразования типов дисков, создания разделов и томов?	diskpart
76.	Какая из утилит позволяет посмотреть список драйверов и их предназначение?	driverquery
77.	С какими файловыми системами работает программа Paragon Drive Backup?	Со всеми перечисленными
78.	Что выполняет процедура POST?	Запуск компьютера и тестирование его компонентов
79.	Что можно сделать в BIOS Setup?	Настройку параметров системы
80.	После включения кнопки питания первым запускается -	Блок питания
81.	Что является минимальной порцией данных, имеющей уникальный адрес на жестком диске?	Блок
82.	Чем определяется система резервного копирования?	Всем перечисленным
83.	Найдите неправильную часть регулярного процесса резервного копирования -	Периодический запуск антивирусных программ
84.	Найдите неправильную задачу резервного копирования -	Проверка на наличие вредоносного программного обеспечения
85.	Найдите неправильную задачу резервного копирования -	Выдача логина и пароля хранимым данных
86.	Как называется устройство, которое связывает периферийное оборудование с CPU и выполняет интерпретацию команд процессора для отдельных устройств?	Контроллер
87.	Для сопряжения центральных узлов компьютера с его внешними устройствами служат -	Интерфейсы
88.	Контроллер взаимодействует …	С драйвером
89.	Драйвер взаимодействует …	Со всем перечисленным
90.	За что отвечает файловая система?	За все перечисленное
91.	Для чего можно использовать командную строку?	Для всех перечисленных операций
92.	Какое название еще имеет cmd.exe?	Все перечисленные
93.	Какая команда используется для восстановления удаленных, потерянных, скрытых и зараженных вирусом файлов?	attrib
94.	Выберите команду, которая применяется для восстановления RAW или поврежденной файловой системы -	rescan
95.	Какая из команд используется для исправления логических ошибок на диске?	chkdsk
96.	Что является нарушением организации данных для флеш-памяти?	Форматирование
97.	Что является нарушением организации данных для жесткого диска?	Повреждение секторов зоны MFT
98.	Какой способ восстановления необходимо применить в случае форматирования логического диска или раздела?	Восстановление структуры файловой системы
99.	Какое название имеют специальные программы для уничтожения данных?	Шредеры
100.	Как называются характерные последовательности символов, которые содержат заголовки файлов многих типов?	Сигнатуры 
101.	Тип файла, который начинается с сигнатуры 5249 -	avi

102.	Тип файла, который начинается с сигнатуры 424D -	bmp
103.	Тип файла, который начинается с сигнатуры D0CF -	doc
104.	Тип файла, который начинается с сигнатуры 504B -	docx
105.	Тип файла, который начинается с сигнатуры FFD8 -	jpeg
106.	Какой самый надежный, простой и дешевый способ восстановления информации?	Восстановление из резервных копий
107.	Как называются файлы, справочная информация которых осталась на жестком диске?	Удаленные
108.	Как называются файлы, о которых нет справочной информации на жестком диске?	Потерянные
109.	Укажите неправильное правило при потере данных и их восстановлении -	Зашифровать данные
110.	В какой из файловых систем лучше восстановится сильно фрагментированный файл?	NTFS
111.	Есть ли возможность восстановить информацию после низкоуровневого форматирования?	Нет
112.	Укажите неверный шаг действия Мастера восстановления программы RS NTFS Recovery:	Указать тип вируса
113.	В каком режиме программы RS NTFS Recovery можно найти и восстановить недавно удаленные файлы?	Быстрого сканирования
114.	Программа RS NTFS Recovery может работать с файлами:	Со всеми перечисленными
115.	Выберите правильную функцию программы RS NTFS Recovery:	Все функции правильные
116.	Что из перечисленного не присутствует в окне программы RS NTFS Recovery?	Дефрагментировать диск
117.	Какие версии файловой системы поддерживает RS FAT Recovery?	Все перечисленные
118.	Найдите неверно указанную возможность программы RS FAT Recovery:	Восстановление данных с отформатированных или удаленных логических разделов NTFS
119.	Какие инструменты включает в себя программа RS Data Recovery?	Все перечисленные инструменты
120.	Какую файловую систему не поддерживает программа RS Data Recovery?	MFS
121.	Какой фильтр не поддерживается Мастером восстановления программы RS Data Recovery?	Имя файла
122.	Какую информацию можно восстановить программой CD Recovery Toolbox?	Все перечисленное
123.	С каких носителей можно восстановить информацию с помощью программы Recovery Toolbox for CD?	Со всех перечисленных носителей
124.	Выберите неправильно указанный носитель для восстановления с помощью программы Recovery Toolbox for CD:	Жесткий диск
125.	На сколько кнопок разделено окно программы 7-Data Recovery Suite?	5
126.	Найдите неверно указанный раздел программы 7-Data Recovery Suite -	Восстановление поврежденных файлов
127.	Выберите неверно указанный шаг программы MiniTool Power Data Recovery (восстановление данных за 3 шага) -	Выберите тип анализа
128.	С какими файловыми системами работает программа R-Studio?	Со всеми перечисленными
129.	С какими ОС работает программа R-Studio?	Со всеми перечисленными
130.	Назовите неверно указанный метод восстановления данных программой R-Studio:	Восстановление операционной системы
131.	Назовите профессиональные возможности восстановления в программе R-Studio -	Все перечисленные
132.	Назовите профессиональные возможности восстановления в программе R-Studio -	Все перечисленные
133.	С какими из перечисленных типов носителей работает программа R-Studio?	Со всеми перечисленными
134.	Выберите неверный параметр доступа к диску программы R-Studio?	Минимальный объем
135.	Что помечает красным крестиком программа R-Studio?	Удаленный раздел
136.	Что находится в каталоге Root  после восстановления с помощью программы R-Studio?	Корневая файловая система
137.	Что находится в каталоге Metafiles  после восстановления с помощью программы R-Studio?	Служебные файлы файловой системы NTFS
138.	Что находится в каталоге $$$Folder*****  после восстановления с помощью программы R-Studio?	Файлы, которые не удалось связать с корневым каталогом
139.	При работе программы R-Studio в списке возможных карт расположения информации зеленым цветом выделены -	Хорошие наборы
140.	При работе программы R-Studio в списке возможных карт расположения информации желтым цветом выделены -	Сомнительные наборы



</p>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
