import "./style.css";

import vk from "./../../img/icons/vk.svg";
import instagram from "./../../img/icons/instagram.svg";
import twitter from "./../../img/icons/twitter.svg";
import linkedIn from "./../../img/icons/linkedIn.svg";
import gitHub from "./../../img/icons/gitHub.svg";

const Footer = () => {
  return (
    <footer className="footer">
      <div className="container">
        <div className="footer__wrapper">
          <ul className="social">
            <li className="social__item">
              <a href="https://vk.com/">
                <img src={vk} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.instagram.com">
                <img src={instagram} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="#!">
                <img src={twitter} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://github.com/maxmudovdev">
                <img src={gitHub} alt="Link" />
              </a>
            </li>
            <li className="social__item">
              <a href="https://www.linkedin.com/in/ulugbek-makhmudov-74baaa340/">
                <img src={linkedIn} alt="Link" />
              </a>
            </li>
          </ul>
          <div className="copyright">
            <p>
              
              <br/>
              <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>  <br/>
              1. Уровни модели OSI, которые являются сетезависимыми: Физический, 
канальный и сетевой. <br/>
2. На какие виды подразделяется кабель на основе витых пар: UTP, FTP, STP, 
S/FTP. <br/>
3. Виды оптоволоконного кабеля: Одномодовый, многомодовый. <br/>
4. Виды коаксиального кабеля: Толстый Ethernet (10Base5), тонкий Ethernet 
(10Base2). <br/>
5. Способ соединения компьютеров сетевыми кабелями: Кабельная сеть. <br/>
6. Уровни модели OSI (сверху вниз): Приложения, представления, сеансовый, 
транспортный, сетевой, канальный, физический. <br/>
7. Протокол, отвечающий за адресацию в сети и доставку пакетов без 
установления соединения: IP (Internet Protocol). <br/>
8. Организация, разработавшая модель OSI: ISO (International Organization for 
Standardization). <br/>
9. Спецификации, определяющие стандарты для физических компонентов сети: 
IEEE 802.3, IEEE 802.11, ISO 11801. <br/>
10. Основные виды топологий: Звезда, кольцо, шина, ячеистая, древовидная. <br/>
11. На чем строились системы пакетной обработки в прошлом веке: На 
мэйнфреймах. <br/>
12. Неверный ответ про многотерминальные системы: Они исключают разделение 
ресурсов. <br/>
13. Сети, которые появились первыми: Многотерминальные сети. <br/>
14. Многотерминальные системы разделения времени стали шагом к: Локальным 
вычислительным сетям (LAN). <br/>
15. Сети, в которых были предложены концепции современных вычислительных 
сетей: ARPANET. <br/>
16. Реальный конкурент мэйнфреймов: Мини-ЭВМ. <br/>
17. Когда появилась ARPANET: В 1969 году. <br/>
18. Чем были заменены мэйнфреймы: Серверными архитектурами. <br/>
19. Понятие компьютерной сети: Совокупность связанных между собой 
компьютеров для обмена данными. <br/>
20. Компоненты компьютерной сети: Узлы, кабели, сетевые устройства. <br/>
21. Понятие сервера: Компьютер или программа, предоставляющая ресурсы 
клиентам. <br/>
22. Понятие клиента: Устройство или программа, запрашивающая ресурсы у 
сервера. <br/>
23. Что определяет протокол: Правила обмена данными в сети. <br/>
24. Классификация компьютерных сетей: По протяженности, топологии, типу 
соединения, назначению. <br/>
25. Деление сетей по протяженности: LAN, MAN, WAN. <br/>
26. Стандарт Ethernet: IEEE 802.3. <br/>
27. Стандарт Wi-Fi: IEEE 802.11. <br/>
28. Совместное использование компьютерами в сети: Программы, файлы, 
периферийные устройства. <br/>
29. Протокол – это: Набор правил обмена данными в сети. <br/>
30. Что принимает и отправляет трафик: Маршрутизатор. <br/>
31. Кто создал WWW: Тим Бернерс-Ли. <br/>
32. Что связывает устройства: Сетевые кабели, маршрутизаторы, свитчи. <br/>
33. Соединение узлов и устройств: Сетевые интерфейсы и протоколы. <br/>
34. Топология с узлами более высокого уровня: Иерархическая топология. <br/>
35. Узлы в активных деревьях: Коммутаторы или маршрутизаторы. <br/>
36. Узлы в пассивных деревьях: Концентраторы. <br/>
37. Топология с центральным узлом: Звезда. <br/>
38. Топология с передачей данных в одном направлении: Кольцо. <br/>
39. Топология с общим кабелем: Шина. <br/>
40. Топология с соединением двух соседей: Кольцо. <br/>
41. Топология с многомерной решеткой: Ячеистая. <br/>
42. Топология с магистралью: Шина. <br/>
43. Топология ЛВС с центральным узлом: Звезда. <br/>
44. Топология ЛВС с кругооборотом: Кольцо. <br/>
45. Топология с прямоугольной сеткой: Ячеистая. <br/>
46. Компьютер для доступа пользователей: Сервер. <br/>
47. Комплекс для защиты информации: Информационная безопасность. <br/>
48. Комитет IEEE 802.3: Ethernet. <br/>
49. Комитет IEEE 802.4: Token Bus. <br/>
50. Комитет IEEE 802.6: MAN. <br/>
51. Комитет IEEE 802.16: WiMAX. <br/>
52. Канал связи: Среда передачи сигналов (кабельная, радиоканал и др.). <br/>
53. Первый уровень OSI: Физический. <br/>
54. Год утверждения OSI: 1984. <br/>
55. Количество уровней OSI: 7. <br/>
56. Уровень OSI с передачей сигналов: Физический. <br/>
57. Уровень OSI с исправлением ошибок: Канальный. <br/>
58. Уровень OSI, соединяющий сети: Сетевой. <br/>
59. Уровень OSI с подтверждением доставки: Транспортный. <br/>
60. Уровень OSI с состоянием сеанса: Сеансовый. <br/>
61. Уровень OSI с преобразованием информации: Представления. <br/>
62. Уровень OSI для приложений: Приложений. <br/>
63. Уровень OSI для битов: Физический. <br/>
64. Уровень OSI для кадров: Канальный. <br/>
65. Уровень OSI для пакетов: Сетевой. <br/>
66. Уровень OSI для блоков: Транспортный. <br/>
67. Уровень OSI для данных: Приложений. <br/>
68. Устройство модем: Преобразует аналоговый сигнал в цифровой и наоборот. <br/>
69. Количество уровней TCP/IP: 4. <br/>
70. Что такое сервер: Компьютер или программа для предоставления услуг. <br/>
71. Классификация сетей по соединению: Проводные, беспроводные. <br/>
72. Компьютер в интернете: Хост. <br/>
73. Маршрут: Путь для передачи данных. <br/>
74. Компьютер или программа, обслуживающая другие устройства: Сервер. <br/>
75. Узловой компьютер в сети: Хост. <br/>
76. Сетевой адаптер: Устройство для подключения к сети. <br/>
77. Кабель для света: Оптоволоконный. <br/>
78. Протокол IP – уровень OSI: Сетевой. <br/>
79. Протокол ICMP – уровень OSI: Сетевой. <br/>
80. Протокол RIP – уровень OSI: Сетевой. <br/>
81. Протокол OSPF – уровень OSI: Сетевой. <br/>
82. Протокол ARP – уровень OSI: Канальный. <br/>
83. Протокол TCP – уровень OSI: Транспортный. <br/>
84. Протокол UDP – уровень OSI: Транспортный. <br/>
85. К какому уровню в модели TCP/IP относится протокол TCP? 
Транспортный. <br/>
86. К какому уровню в модели TCP/IP относится протокол UDP? 
Транспортный. <br/>
87. Самый нижний уровень модели TCP/IP: 
Сетевой интерфейс (канальный + физический уровни модели OSI). <br/>
88. Самый верхний уровень модели TCP/IP: 
Прикладной. <br/>
89. Какой уровень модели TCP/IP соответствует физическому и канальному 
уровням модели OSI? 
Сетевой интерфейс. <br/>
90. Какой уровень модели TCP/IP занимается передачей дейтаграмм с 
использованием различных сетей? 
Сетевой. <br/>
91. Какой протокол в стеке протоколов TCP/IP используется в качестве основного 
протокола межсетевого уровня? 
IP (Internet Protocol). <br/>
92. На каком уровне в стеке протоколов TCP/IP работает протокол RIP? 
Сетевой. <br/>
93. На каком уровне в стеке протоколов TCP/IP работает протокол OSPF? 
Сетевой. <br/>
94. На каком уровне в стеке протоколов TCP/IP работает протокол IP? 
Сетевой. <br/>
95. На каком уровне в стеке протоколов TCP/IP работает протокол ICMP? 
Сетевой. <br/>
96. На каком уровне в стеке протоколов TCP/IP работает протокол ARP? 
Сетевой интерфейс. <br/>
97. На каком уровне в стеке протоколов TCP/IP работает протокол SNMP? 
Прикладной. <br/>
98. На каком уровне в стеке протоколов TCP/IP работает протокол FTP? 
Прикладной. <br/>
99. На каком уровне в стеке протоколов TCP/IP работает протокол Telnet? 
Прикладной. <br/>
100. На каком уровне в стеке протоколов TCP/IP работает протокол SMTP? 
Прикладной. <br/>
101. На каком уровне в стеке протоколов TCP/IP работает протокол TFTP? 
Прикладной. <br/>
102. На каком уровне в стеке протоколов TCP/IP работает Ethernet? 
Сетевой интерфейс. <br/>
103. На каком уровне в стеке протоколов TCP/IP работает Token Ring? 
Сетевой интерфейс. <br/>
104. На каком уровне в стеке протоколов TCP/IP работает FDDI? 
Сетевой интерфейс. <br/>
105. Какой уровень модели TCP/IP обеспечивает доставку данных между двумя 
прикладными проц<br/>ессами? 
Транспортный. 
106. На каком уровне в стеке протоколов TCP/IP работает протокол TCP? 
Транспортный. <br/>
107. На каком уровне в стеке протоколов TCP/IP работает протокол UDP? 
Транспортный. <br/>
108. Какой протокол используется для передачи файлов? 
FTP, TFTP. <br/>
109. Какой основной протокол при пользовании услуг WWW? 
HTTP/HTTPS. <br/>
110. Компьютер, подключенный к сети Internet, должен обязательно иметь: 
Уникальный IP-адрес. <br/>
111. Какой протокол контроля передачи используется тогда, когда требуется 
надежная доставка сообщений? 
TCP. <br/>
112. Какой адрес имеет компьютер, подключенный к сети Интернет? 
IP-адрес. <br/>
113. ... – это набор правил, в соответствии с которым компьютеры обмениваются 
информацией: 
Протокол. <br/>
114. Службу, какого ресурса использует компьютер-клиент? 
Сервер. <br/>
115. Что такое локальная сеть? 
Сеть, соединяющая компьютеры на ограниченной территории (офис, дом и т.д.). <br/>
116. LAN — это: 
Локальная сеть. <br/>
117. Этот кабель в основном используется для соединения компьютеров в 
локальной сети: 
Витая пара. <br/>
118. Максимальная скорость передачи информации в компьютерной локальной 
сети (на основе кабеля витая пара) может достигать: 
До 10 Гбит/с (зависит от категории кабеля). <br/>
119. Это понятие определяет обмен в сети, поток информации: 
Передача данных. <br/>
120. Как называется комплекс аппаратных и программных средств, 
позволяющих компьютерам обмениваться данными? 
Компьютерная сеть. <br/>
121. Что такое протокол? 
Набор правил для передачи данных в сети. <br/>
122. Что такое провайдер? 
Организация, предоставляющая доступ к сети Интернет. <br/>
123. Как называется коммуникационный протокол, описывающий формат 
пакета данных? 
IP (Internet Protocol). <br/>
124. Когда был разработан проект компьютерной сети ARPANET? 
1969 год. <br/>
125. Когда был принят открытый стандарт локальной сети Ethernet фирмами 
Xerox, Intel и DEC? 
1980 год. <br/>
126. Маршрутизация — это... 
Процесс выбора пути для передачи данных в сети. <br/>
127. К какому уровню в модели TCP/IP относится протокол TCP? – Транспортный 
уровень <br/>
128. К какому уровню в модели TCP/IP относится протокол UDP? – Транспортный 
уровень <br/>
129. Самый нижний уровень модели TCP/IP: – Сетевой интерфейс <br/>
130. Самый верхний уровень модели TCP/IP: – Прикладной уровень <br/>
131. Какой уровень модели TCP/IP соответствует физическому и канальному 
уровням модели OSI? – Сетевой интерфейс <br/>
132. Какой уровень модели TCP/IP занимается передачей дейтаграмм с 
использованием различных сетей? – Сетевой уровень <br/>
133. Какой протокол в стеке протоколов TCP/IP используется в качестве основного 
протокола межсетевого уровня? – IP <br/>
134. На каком уровне в стеке протоколов TCP/IP работает протокол RIP? – Сетевой 
уровень <br/>
135. На каком уровне в стеке протоколов TCP/IP работает протокол OSPF? – 
Сетевой уровень <br/>
136. На каком уровне в стеке протоколов TCP/IP работает протокол IP? – Сетевой 
уровень <br/>
137. На каком уровне в стеке протоколов TCP/IP работает протокол ICMP? – 
Сетевой уровень <br/>
138. На каком уровне в стеке протоколов TCP/IP работает протокол ARP? – Сетевой 
интерфейс <br/>
139. На каком уровне в стеке протоколов TCP/IP работает протокол SNMP? – 
Прикладной уровень <br/>
140. На каком уровне в стеке протоколов TCP/IP работает протокол FTP? – 
Прикладной уровень <br/>
141. На каком уровне в стеке протоколов TCP/IP работает протокол Telnet? – 
Прикладной уровень <br/>
142. На каком уровне в стеке протоколов TCP/IP работает протокол SMTP? – 
Прикладной уровень <br/>
143. На каком уровне в стеке протоколов TCP/IP работает протокол TFTP? – 
Прикладной уровень <br/>
144. На каком уровне в стеке протоколов TCP/IP работает Ethernet? – Сетевой 
интерфейс <br/>
145. На каком уровне в стеке протоколов TCP/IP работает Token Ring? – Сетевой 
интерфейс <br/>
146. На каком уровне в стеке протоколов TCP/IP работает FDDI? – Сетевой 
интерфейс <br/><br/>
147. Какой уровень модели TCP/IP обеспечивает доставку данных между двумя 
прикладными процессами? – Транспортный уровень <br/>
148. На каком уровне в стеке протоколов TCP/IP работает протокол TCP? – 
Транспортный уровень <br/>
149. На каком уровне в стеке протоколов TCP/IP работает протокол UDP? – 
Транспортный уровень <br/>
150. Какой протокол используется для передачи файлов? – FTP <br/>
151. Какой основной протокол при пользовании услуг WWW? – HTTP <br/>
152. Компьютер, подключенный к сети Internet, должен обязательно иметь: – IP
адрес <br/>
153. Какой протокол контроля передачи используется тогда, когда требуется 
надежная доставка сообщений? – TCP <br/>
154. Какой адрес имеет компьютер, подключенный к сети Интернет? – IP-адрес <br/>
155. Дополните определение: … – это набор правил, в соответствии с которым 
компьютеры обмениваются информацией. – Протокол <br/>
156. Службу, какого ресурса использует компьютер-клиент? – Сетевой ресурс 
(зависит от службы) <br/>
157. Что такое локальная сеть? – Сеть, объединяющая устройства в пределах 
ограниченной территории <br/>
158. Дайте верное определение: LAN — это – Локальная вычислительная сеть <br/>
159. Этот кабель в основном используется для соединения компьютеров в 
локальной сети: – Витая пара

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
"1-savol?
Укажите вариант, где перечислены сетевые операционные системы?"
"1-savol javobi
Novell Netware, UNIX, Windows NT"
"2-savol?
Какие уровни модели OSI являются сетезависимыми?"
"2-savol javobi
транспортный и сеансовый"
"3-savol?
Какие из характеристик являются характеристиками, как линии связи, так и способа передачи данных?"
"3-savol javobi
пропускная способность и достоверность"
"4-savol?
На какие виды подразделяется кабель на основе витых пар?"
"4-savol javobi
зкранированная и неэкранированная"
"5-savol?
На какие виды подразделяется оптоволоконный кабель?"
"5-savol javobi
одномодовый и многомодовый"
"6-savol?
На какие виды подразделяется коаксиальный кабель?"
"6-savol javobi
тонкий и толстый"
"7-savol?
Способ соединения компьютеров сетевыми кабелями называется - "
"7-savol javobi
топологией сети"
"8-savol?
Укажите правильный вариант ответа, где правильно (сверху вниз) перечислены уровни модели OSI:"
"8-savol javobi
прикладной, представительский, сеансовый, транспортный, сетевой, канальный,физический"
"9-savol?
Какой протокол отвечает за адресацию в сети и доставку пакетов между компьютерами сети, без установления соединения и гарантий доставки пакета?"
"9-savol javobi
IP"
"10-savol?
Эта программа (устройство) позволяет выявить в сети вредоносное и несанкционированное программное обеспечение -"
"10-savol javobi
сниффер"
"11-savol?
Из скольких, и каких уровней адреса состоит каждый компьютер в сетях TCP/IP?"
"11-savol javobi
3 уровней: физический (MAC-адрес), сетевой (IP-адрес) и символьный (DNS-имя)"
"12-savol?
Сколько байтов имеет формат физического МАС – адреса для всех существующих технологий локальных сетей?"
"12-savol javobi
6"
"13-savol?
Сколько байтов имеет формат IP – адреса (сетевого адреса)?"
"13-savol javobi
4"
"14-savol?
Что означают старшие 3 байта МАС – адреса?"
"14-savol javobi
идентификатор фирмы производителя"
"15-savol?
Что означают младшие 3 байта МАС – адреса?"
"15-savol javobi
уникальный номер устройства"
"16-savol?
Из каких двух частей состоит IP-адрес?"
"16-savol javobi
номера сети и номера узла"
"17-savol?
К частям какого уровня адреса сети TCP/IP относятся: имя машины, имя организации, имя домена?"
"17-savol javobi
символьный (DNS-имя)"
"18-savol?
На какие две модели можно разделить модель OSI:"
"18-savol javobi
горизонтальную модель на базе протоколов и вертикальную модель на основе услуг"
"19-savol?
Какой организацией была разработана базовая модель связи открытых систем OSI?"
"19-savol javobi
ISO (International Standardization Organization)"
"20-savol?
Это спецификации, которые определяют стандарты для физических компонентов сети -"
"20-savol javobi
комитеты IEEE 802.xx"
"21-savol?
Это единица информации, передаваемая между станциями сети -"
"21-savol javobi
пакет (packet)"
"22-savol?
Какой кабель, в котором изолированная пара проводников скручена с небольшим числом витков на единицу длины?"
"22-savol javobi
неэкранированная витая пара (UTP, unshielded twisted pair)"
"23-savol?
Какой кабель имеет толщину 12 мм и бывает двух разновидностей: гибкий и жесткий. Он имеет большую степень помехозащищенности, большую механическую прочность, а также позволяет подключать новый компьютер к кабелю, не останавливая работу сети -"
"23-savol javobi
толстый коаксиальный кабель (RG-8 и RG-11)"
"24-savol?
В этом кабеле используются более широкие внутренние сердечники, которые легче изготовить технологически. В кабелях во внутреннем проводнике одновременно существует несколько световых лучей, отражающихся от внешнего проводника под разными углами. В качестве источников излучения в кабелях применяются светодиоды -"
"24-savol javobi
многомодовый оптоволоконный кабель (Multi Mode Fiber, MMF)"
"25-savol?
Укажите вариант, где перечислен полный перечень основных видов топологий:"
"25-savol javobi
общая шина (Bus); кольцо (Ring); звезда (Star); древовидная (Tree); ячеистая (Mesh)"
"26-savol?
На чем строились системы пакетной обработки в прошлом веке"
"26-savol javobi
мэйнфрейм"
"27-savol?
Выберите неверный ответ:  в многотерминальных системах разделения времени -"
"27-savol javobi
все функции стали распределенными"
"28-savol?
Какие из перечисленных сетей хронологически появились первыми?"
"28-savol javobi
глобальные вычислительные сети
"
"29-savol?
Многотерминальные системы, работающие в режиме разделения времени стали первым шагом на пути создания …"
"29-savol javobi
локальных вычислительных сетей"
"30-savol?
В каких сетях из перечисленных были впервые предложены и отработаны основные идеи и концепции современных вычислительных сетей?"
"30-savol javobi
глобальные сети"
"31-savol?
Что из перечисленного стало реальным конкурентом мэйнфреймов?"
"31-savol javobi
мини-ЭВМ"
"32-savol?
В каком году появилась первая сеть ARPANET?"
"32-savol javobi
1969"
"33-savol?
Что из перечисленного заменило в сетях мини-ЭВМ и мэйнфреймы?"
"33-savol javobi
персональные компьютеры"
"34-savol?
Что такое компьютерная сеть?"
"34-savol javobi
система компьютеров связанная каналами передачи информации"
"35-savol?
Что из перечисленного является компонентом компьютерной сети?"
"35-savol javobi
все ответы верны"
"36-savol?
Выделенный сервер – это"
"36-savol javobi
компьютер, служащий только для обслуживания клиентских машин"
"37-savol?
Сервер – это"
"37-savol javobi
компьютер или программа, предоставляющая некоторые услуги"
"38-savol?
Клиент - это"
"38-savol javobi
компьютер или программа, запрашивающая услуги"
"39-savol?
Найдите правильное определение: протокол определяет"
"39-savol javobi
все ответы верны"
"40-savol?
Как классифицируются компьютерные сети?"
"40-savol javobi
все ответы верны"
"41-savol?
По протяженности компьютерные сети делят на"
"41-savol javobi
все ответы верны"
"42-savol?
Технология Ethernet определяется стандартом ІЕЕЕ:"
"42-savol javobi
802.3"
"43-savol?
Технология Wi-Fi определяется стандартом ІЕЕЕ:"
"43-savol javobi
 802.11"
"44-savol?
Компьютеры, входящие в сеть,  могут совместно использовать:"
"44-savol javobi
все ответы верны"
"45-savol?
Протокол – это"
"45-savol javobi
стандарт передачи данных через компьютерную сеть"
"46-savol?
Что из перечисленного принимает и отправляет трафик пользователя:"
"46-savol javobi
узел"
"47-savol?
Что из перчисленного осуществляет связь между другими устройствами:"
"47-savol javobi
сетевые устройства"
"48-savol?
Что из перечисленного обеспечивает соединение узлов и сетевых устройств?"
"48-savol javobi
сетевая среда"
"49-savol?
Топология сети, в которой каждый узел более высокого уровня связан с узлами более низкого уровня:"
"49-savol javobi
дерево"
"50-savol?
В активных деревьях в качестве узлов используются -"
"50-savol javobi
компьютеры"
"51-savol?
В пассивных деревьях в качестве узлов используются -"
"51-savol javobi
 коммутаторы"
"52-savol?
Топология компьютерной сети, в которой все компьютеры сети присоединены к центальному узлу, образуя физический сегмент сети:"
"52-savol javobi
звезда"
"53-savol?
Топология, в которой данные могут передаваться лишь в одном направлении, от одного компьютера к другому – соседнему, называется:"
"53-savol javobi
кольцо"
"54-savol?
Топология, при которой к общему кабелю подключены все компьютеры -"
"54-savol javobi
 общая шина"
"55-savol?
Топология, в которой каждый компьютер соединен линиями связи только с двумя другими: от одного он получает информацию, а другому только передает -"
"55-savol javobi
кольцо"
"56-savol?
Топология, в которой узлы образуют многомерную решетку, называется"
"56-savol javobi
тор"
"57-savol?
Это тип сетевой топологии, в которой рабочие станции расположены вдоль одного участка кабеля, называемого магистралью (сегментом) -"
"57-savol javobi
общая шина (Bus)"
"58-savol?
Это топология ЛВС, в которой все рабочие станции присоединены к центральному узлу, который устанавливает, поддерживает и разрывает связи между рабочими станциями:"
"58-savol javobi
звезда (Star)"
"59-savol?
Это топология ЛВС, в которой каждая станция соединена с двумя другими станциями, образуя кругооборот:"
"59-savol javobi
кольцо (Ring)"
"60-savol?
Это топология, в которой граф линий связи образует прямоугольную сетку (обычно двух- или трех-мерную):"
"60-savol javobi
ячеистая (Mesh)"
"61-savol?
Компьютер, к которому осуществляют доступ пользователи, для того чтобы использовать программы, данные или периферийные устройства называется - "
"61-savol javobi
сервером"
"62-savol?
Какой вид сервера управляет электронными сообщениями?"
"62-savol javobi
Mailserver (почтовый сервер)"
"63-savol?
Совместное использование принтера, графопостроителя или способность цифровой серверной печати относятся к базовой функциональности какого сервера?"
"63-savol javobi
Printserver (сервер печати)"
"64-savol?
Комплекс мероприятий, проводимых с целью предотвращения утечки, хищения, утраты, несанкционированного уничтожения, искажения, модификации (подделки), несанкционированного копирования, блокирования информации называется -"
"64-savol javobi
защитой информации"
"65-savol?
 … - это объект сети, генерирующий данные или потребляющий данные сети."
"65-savol javobi
абонент сети"
"66-savol?
… - канал связи осуществляемый электрическими, радио или другими сигналами."
"66-savol javobi
физическая среда передачи"
"67-savol?
В модели OSI первым уровнем является:"
"67-savol javobi
физический"
"68-savol?
В каком году был утвержден стандарт модели OSI?"
"68-savol javobi
1984"
"69-savol?
Сколько уровней имее модель OSI?"
"69-savol javobi
7"
"70-savol?
Какой уровень в модели OSI описывает принципы передачи сигналов, скорость передачи, спецификации каналов связи?"
"70-savol javobi
физический"
"71-savol?
Какой уровень в модели OSI проверяет доступность среды передачи, обнаруживает и исправляет ошибки, возникающие в процессе передачи?"
"71-savol javobi
канальный"
"72-savol?
Какой уровень в модели OSI обеспечивает соединение сетей?"
"72-savol javobi
сетевой"
"73-savol?
Какой уровень в модели OSI решает задачу передачи сообщений в составной сети с помощью подтверждения доставки и повторной отправки пакетов?"
"73-savol javobi
транспортный"
"74-savol?
Какой уровень в модели OSI позволяет запоминать информацию о текущем состоянии сеанса связи?"
"74-savol javobi
сеансовый"
"75-savol?
Какой уровень в модели OSI обеспечивает преобразование передаваемой информации из одной кодировки в другую?"
"75-savol javobi
уровень представления"
"76-savol?
Какой уровень в модели OSI реализует интерфейс между остальными уровнями модели и пользовательскими приложениями?"
"76-savol javobi
прикладной уровень"
"77-savol?
На каком уровне модели  OSI передаются биты?"
"77-savol javobi
физический"
"78-savol?
На каком уровне модели  OSI передаются кадры?"
"78-savol javobi
канальный"
"79-savol?
На каком уровне модели  OSI передаются пакеты?"
"79-savol javobi
сетевой"
"80-savol?
На каком уровне модели  OSI передаются блоки?"
"80-savol javobi
транспортный"
"81-savol?
На каком уровне модели  OSI передаются только данные?"
"81-savol javobi
сеансовый"
"82-savol?
На каком уровне модели  OSI передаются только данные?"
"82-savol javobi
представления"
"83-savol?
На каком уровне модели  OSI передаются только данные?"
"83-savol javobi
прикладной"
"84-savol?
Модем - это устройство"
"84-savol javobi
для передачи информации по телефонным каналам связи"
"85-savol?
Сколько уровней имеет стек протоколов TCP/IP?"
"85-savol javobi
4"
"86-savol?
Электронная почта позволяет передавать:"
"86-savol javobi
сообщения и приложенные к нему файлы"
"87-savol?
Сервер - это"
"87-savol javobi
мощный компьютер, к которому подключаются остальные компьютеры"
"88-savol?
По способу соединения элементов сети классифицируются на:"
"88-savol javobi
шина, кольцо, звезда"
"89-savol?
По способу управления сети классифицируются на:"
"89-savol javobi
централизованные и децентрализованные"
"90-savol?
Как называется компьютер, независимо подключенный к сети Интернет?"
"90-savol javobi
host компьютер "
"91-savol?
Маршрут – это …"
"91-savol javobi
процесс определения маршрута данных в сетях связи"
"92-savol?
… - компьютер или программа, которая обслуживает другие компьютеры или программы."
"92-savol javobi
сервер"
"93-savol?
Как называется узловой компьютер в сети?"
"93-savol javobi
хост "
"94-savol?
Сетевой адаптер - это:"
"94-savol javobi
специальное аппаратное средство для эффективного взаимодействия персональных компьютеров сети"
"95-savol?
Для соединения компьютеров в сетях используются кабели различных типов. По какому кабелю передаётся информация, закодированная в пучке света?"
"95-savol javobi
 оптиковолоконный"
"96-savol?
Какому уровню модели OSI принадлежит протокол IP? "
"96-savol javobi
сетевой"
"97-savol?
Какому уровню модели OSI принадлежит протокол ICMP? "
"97-savol javobi
сетевой"
"98-savol?
Какому уровню модели OSI принадлежит протокол RIP? "
"98-savol javobi
сетевой"
"99-savol?
Какому уровню модели OSI принадлежит протокол OSPF? "
"99-savol javobi
сетевой"
"100-savol?
Какому уровню модели OSI принадлежит протокол ARP? "
"100-savol javobi
сетевой"
"101-savol?
Какому уровню  в модели OSI принадлежит протокол TCP? "
"101-savol javobi
4"
"102-savol?
Какому уровню  в модели OSI принадлежит протокол UDP?   "
"102-savol javobi
4"
"103-savol?
К какому уровню в модели TCP/IP принадлежит протокол TCP?"
"103-savol javobi
3"
"104-savol?
К какому уровню в модели TCP/IP принадлежит протокол UDP?"
"104-savol javobi
3"
"105-savol?
Какой уровень в модели TCP/IP является самым нижним?"
"105-savol javobi
уровень доступа к среде передачи"
"106-savol?
Какой уровень в модели TCP/IP является самым верхним?"
"106-savol javobi
прикладной"
"107-savol?
Какой уровень в модели TCP/IP соответствует физическому и канальному уровням модели OSI?"
"107-savol javobi
уровень доступа к среде передачи"
"108-savol?
Какой уровень в модели TCP/IP занимается передачей дейтаграмм с использованием различных сетей?"
"108-savol javobi
межсетевой уровень"
"109-savol?
В качестве основного протокола межсетевого уровня в стеке протоколов TCP/IP используется протокол:"
"109-savol javobi
IP"
"110-savol?
На каком уровне стека протоколов TCP/IP работает протокол RIP?"
"110-savol javobi
межсетевой уровень"
"111-savol?
На каком уровне стека протоколов TCP/IP работает протокол OSPF?"
"111-savol javobi
межсетевой уровень"
"112-savol?
На каком уровне стека протоколов TCP/IP работает протокол IP?"
"112-savol javobi
межсетевой уровень"
"113-savol?
На каком уровне стека протоколов TCP/IP работает протокол ICMP?"
"113-savol javobi
межсетевой уровень"
"114-savol?
На каком уровне стека протоколов TCP/IP работает протокол ARP?"
"114-savol javobi
межсетевой уровень"
"115-savol?
На каком уровне стека протоколов TCP/IP работает протокол SNMP?"
"115-savol javobi
прикладной"
"116-savol?
На каком уровне стека протоколов TCP/IP работает протокол FTP?"
"116-savol javobi
прикладной"
"117-savol?
На каком уровне стека протоколов TCP/IP работает протокол Telnet?"
"117-savol javobi
прикладной"
"118-savol?
На каком уровне стека протоколов TCP/IP работает протокол SMTP?"
"118-savol javobi
прикладной"
"119-savol?
На каком уровне стека протоколов TCP/IP работает протокол TFTP?"
"119-savol javobi
прикладной"
"120-savol?
На каком уровне стека протоколов TCP/IP работает Ethernet?"
"120-savol javobi
уровень доступа к среде передачи"
"121-savol?
На каком уровне стека протоколов TCP/IP работает Token Ring?"
"121-savol javobi
уровень доступа к среде передачи"
"122-savol?
На каком уровне стека протоколов TCP/IP работает FDDI?"
"122-savol javobi
уровень доступа к среде передачи"
"123-savol?
Какой уровень в модели TCP/IP обеспечивает доставку данных между двумя прикладными процессами?"
"123-savol javobi
транспортный"
"124-savol?
На каком уровне стека протоколов TCP/IP работает протокол TCP?"
"124-savol javobi
транспортный"
"125-savol?
На каком уровне стека протоколов TCP/IP работает протокол UDP?"
"125-savol javobi
транспортный"
"126-savol?
Протоколом для передачи файлов является:"
"126-savol javobi
FTP"
"127-savol?
Основным протоколом при пользовании услуг WWW является:"
"127-savol javobi
HTTP"
"128-savol?
Компьютер, подключенный к сети Internet, обязательно имеет -"
"128-savol javobi
IP-адрес"
"129-savol?
Какой протокол контроля передачи используется тогда, когда требуется надежная доставка сообщений?"
"129-savol javobi
 TCP"
"130-savol?
Какой адрес имеет компьютер, постоянно подключенный к Интернету?"
"130-savol javobi
IP"
"131-savol?
… - устаревший сетевой протокол канального уровня эталонной сетевой модели OSI для доступа к сетям стека TCP/IP через низкоскоростные линии связи путём простой инкапсуляции IP-пакетов."
"131-savol javobi
SLIP"
"132-savol?
Какой протокол используется в настоящее время вместо протокола SLIP?"
"132-savol javobi
PPP"
"133-savol?
… – это набор правил, в соответствии с которым компьютеры обмениваются информацией."
"133-savol javobi
протокол"
"134-savol?
Службу, какого ресурса использует компьютер-клиент?"
"134-savol javobi
сервера"
"135-savol?
Локальная сеть – это …"
"135-savol javobi
небольшая компьютерная сеть в пределах одного помещения или предприятия"
"136-savol?
LAN — это:"
"136-savol javobi
сети компьютеров, размещенные на небольшой территории и использующие для связи высококачественные линии связи"
"137-savol?
Какой кабель в основном используется для соединения компьютеров в локальной сети?"
"137-savol javobi
витая пара"
"138-savol?
Максимальная скорость передачи информации в компьютерной локальной сети (на основе кабеля витая пара) может достигать:"
"138-savol javobi
100 Мбит/с"
"139-savol?
Понятие, которое определяет обмен в сети, поток информации -"
"139-savol javobi
траффик"
"140-savol?
Комплекс аппаратных и программных средств, позволяющих компьютерам обмениваться данными - это:"
"140-savol javobi
компьютерная сеть"
"141-savol?
Протокол – это:"
"141-savol javobi
специальное техническое соглашения для работы в сети"
"142-savol?
Провайдер – это:"
"142-savol javobi
владелец узла сети, с которым заключается договор на подключение к его узлу"
"143-savol?
Коммуникационный протокол, описывающий формат пакета данных называется:"
"143-savol javobi
IP"
"144-savol?
Сетевое устройство, предназначенное для преобразования сферы одного вида протокола в другую сферу -"
"144-savol javobi
шлюз"
"145-savol?
Proxy – это …"
"145-savol javobi
система для подключения  компьютера к Интернету "
"146-savol?
Выберите правильный вариант, где перечислены стандартные стеки коммуникационных  протоколов:"
"146-savol javobi
TCP/IP, IPX/SPX, NetBIOS/SMB, DECnet, SNA, OSI"
"147-savol?
Где и когда был разработан проект компьютерной сети ARPANET?"
"147-savol javobi
1968 год, США "
"148-savol?
Какие протоколы считаются распространенными в стеке OSI? "
"148-savol javobi
прикладные протоколы"
"149-savol?
В каком году был принят открытый стандарт локальной сети Ethernet фирмами Xerox, Intel и Dec?"
"149-savol javobi
1980 году"
"150-savol?
Маршрутизация это…"
"150-savol javobi
это процесс передачи данных с одного ПК на другой ПК, когда эти ПК находятся в разных сетях;"
"151-savol?
В компьютерной сети Интернет транспортный протокол ТСР обеспечивает:"
"151-savol javobi
способ передачи информации по заданному адресу"
"152-savol?
Сетевой шлюз это:"
"152-savol javobi
 аппаратный маршрутизатор или программное обеспечение для сопряжения компьютерных сетей, использующих разные протоколы"
"153-savol?
Коммутация – это:"
"153-savol javobi
 процесс соединения абонентов коммуникационной сети через транзитные узлы"
"154-savol?
Информация в компьютерных сетях передается по каналам связи в виде отдельных:"
"154-savol javobi
пакетов"
"155-savol?
Коммутация пакетов это:"
"155-savol javobi
техника коммутации абонентов, которая была специально разработана для эффективной передачи компьютерного трафика"
"156-savol?
Какое из устройств служит для соединения между собой нескольких различных узлов компьютерной сети и обмена данными между ними, при этом имеет один  сетевой интерфейс:"
"156-savol javobi
коммутатор"
"157-savol?
Концентратор – это"
"157-savol javobi
устройство для организации работы локальной сети"
"158-savol?
Обмен информацией между компьютерными сетями, в которых действуют разные сетевые протоколы, осуществляется с использованием:"
"158-savol javobi
шлюзов"
"159-savol?
Свитч - это"
"159-savol javobi
коммутатор"
"160-savol?
Маршрутизатор – это"
"160-savol javobi
роутер"
"161-savol?
 Скорость передачи данных в сети, которую могут обеспечить коммутаторы в зависимости от модели:"
"161-savol javobi
100 Мбит/сек"
"162-savol?
Скорость передачи данных в сети, которую может обеспечить Fast Ethernet:"
"162-savol javobi
100 Мбит/сек"
"163-savol?
Скорость передачи данных в сети, которую может обеспечить Gigabit Ethernet:"
"163-savol javobi
1000 Мбит/сек"
"164-savol?
Для подключения к маршрутизаторам, коммутаторам, сетевым картам на концах витой пары используются:"
"164-savol javobi
все перечисленные коннекторы"
"165-savol?
 … - это совокупность объектов, образуемых устройствами передачи и обработки данных"
"165-savol javobi
сеть"
"166-savol?
…-  целесообразное преобразование формы подтвержденных данных их передача, хранение и обработка. "
"166-savol javobi
кодирование "
"167-savol?
Какой уровень модели OSI предназначен для сопряжения с физическими средствами соединения?"
"167-savol javobi
физический"
"168-savol?
Какой уровень модели OSI обеспечивает создание, передачу и прием кадров данных?"
"168-savol javobi
канальный"
"169-savol?
Функции сетевого уровня модели OSI - "
"169-savol javobi
устанавливает связь в вычислительной сети между двумя системами и обеспечивает прокладку виртуальных каналов между ними"
"170-savol?
Какой уровень модели OSI определяет адресацию физических устройств (систем, их частей) в сети?"
"170-savol javobi
транспортный"
"171-savol?
Какой уровень модели OSI обеспечивает управление диалогом для того, чтобы фиксировать, какая из сторон является активной в настоящий момент, а также предоставляет средства синхронизации?"
"171-savol javobi
сеансовый"
"172-savol?
Какой уровень модели OSI обеспечивает прикладным процессам средства доступа к области взаимодействия?"
"172-savol javobi
представительский"
"173-savol?
Какие функции выполняет прикладной уровень? "
"173-savol javobi
обеспечивает удобный интерфейс для пользователя"
"174-savol?
…- протокол организации управления сети."
"174-savol javobi
SNMP"
"175-savol?
Система уплотнения оптического кабеля имеет название -"
"175-savol javobi
DWDM"
"176-savol?
Сети, которые охватывают значительную географическую область, страну, континент:"
"176-savol javobi
WAN"
"177-savol?
Что представляют из себя линии связи:"
"177-savol javobi
все перечисленные"
"178-savol?
Какие сети имеют как принадлежность, так и управление ко многим различным организациям:"
"178-savol javobi
WAN"
"179-savol?
Муниципальные сети объединяют компьютеры в пределах -"
"179-savol javobi
города"
"180-savol?
Какие из приведенных технологий относятся к технологиям глобальной сети?"
"180-savol javobi
ATM, TCP/IP"
"181-savol?
Спецификации, каких комитетов института IEEE появились в 1980 году?"
"181-savol javobi
802"
"182-savol?
Какой фирмой и в каком году построена экспериментальная сеть Ethernet Network? "
"182-savol javobi
Xerox, 1975 год"
"183-savol?
Какой подуровень обеспечивает обслуживание сетевого уровня и связан с передачей и приемом пользовательских сообщений?"
"183-savol javobi
LLC"
"184-savol?
Укажите диаметр коаксиального кабеля 10Base-5:"
"184-savol javobi
0,5 дюйм"
"185-savol?
Система кабельного телевидения относится к сетям:"
"185-savol javobi
MAN"
"186-savol?
Стандарт IEEE 802.16 – WiMax относится к сетям "
"186-savol javobi
MAN"
"187-savol?
Потенциально достижимая скорость волоконно-оптических линий связи составляет:"
"187-savol javobi
10 Гбит/сек"
"188-savol?
Локальные сети объединяют компьютеры  пределах:"
"188-savol javobi
организации"
"189-savol?
В каких из перечисленных видов сетей маршрутизаторы соединяют различные виды сетевых технологий?"
"189-savol javobi
WAN"
"190-savol?
Как называется оператор подсети, соединяющий с другими сетями и Интернетом?"
"190-savol javobi
провайдер"
"191-savol?
Укажите максимальную пропускную способность коаксиального кабеля 10Base-5:"
"191-savol javobi
500 м"
"192-savol?
Укажите диаметр коаксиального кабеля 10Base-2: "
"192-savol javobi
0,25 дюйм"
"193-savol?
Укажите максимальную пропускную способность коаксиального кабеля 10Base-2:"
"193-savol javobi
185 м"
"194-savol?
Укажите максимальную пропускную способность оптоволоконного кабеля 10Base-FB:"
"194-savol javobi
2000 м"
"195-savol?
Каким институтом, и в каком году была предложена технология FDDI?"
"195-savol javobi
институт ANSI, 1986 г."
"196-savol?
Какое поколение мобильных сетей осуществляло только аналоговую передачу звука?"
"196-savol javobi
1"
"197-savol?
Какое поколение мобильных сетей было цифровым и передавало только голос?"
"197-savol javobi
2"
"198-savol?
Какое поколение мобильных сетей было цифровым и передавало речь и данные?"
"198-savol javobi
3"
"199-savol?
Какое разделение каналов применяется в 3G?"
"199-savol javobi
кодовое"
"200-savol?
Какое устройство выполняет функции физического и канального уровня?"
"200-savol javobi
сетевой адаптер"
"201-savol?
Укажите максимальное расстояние технологии Bluetooth:"
"201-savol javobi
 100 м"
"202-savol?
Укажите максимальную скорость технологии Bluetooth:"
"202-savol javobi
721 Мбит/с"
"203-savol?
… - это система протоколов беспроводной связи."
"203-savol javobi
WAP"
"204-savol?
Максимальное число подключаемых компьютеров технологии Wi-Fi:"
"204-savol javobi
50"
"205-savol?
Как называются компьютеры подключенные к локальной сети? "
"205-savol javobi
станциями"
"206-savol?
Одним из важнейших трендов развития отрасли мобильной связи является такое понятие, как «Интернет вещей». Что это?"
"206-savol javobi
взаимодействие типа «устройство – устройство» (без участия человека)"
"207-savol?
Как расшифровывается WiFi?"
"207-savol javobi
Wireless Fidelity"
"208-savol?
К какому поколению мобильной связи относится GSM?"
"208-savol javobi
2G"
"209-savol?
Скорость передачи данных в локальной сети на основе коаксиального кабеля не превышает:"
"209-savol javobi
10 Мбит/сек"
"210-savol?
Как расшифровывается LTE?"
"210-savol javobi
 Long Term Evolution"
"211-savol?
Какой канал передачи информации, как правило, используют для соединения двух серверов?"
"211-savol javobi
оптоволокно"
"212-savol?
Какой тип данных передается на физическом уровне?"
"212-savol javobi
биты"
"213-savol?
Что означает «G» в аббревиатурах: 1G, 2G, 3G, 4G?"
"213-savol javobi
Generation"
"214-savol?
Какой из способов подключения к Интернету обеспечивает наибольшие возможности для доступа к информационным ресурсам?"
"214-savol javobi
постоянное соединение по оптоволоконному каналу"
"215-savol?
 IP адрес нужен для:"
"215-savol javobi
для всех перечисленных действий"
"216-savol?
Данные, передаваемые с использованием протокола IP, помещаются в сообщение, называемое"
"216-savol javobi
пакетом"
"217-savol?
Глобальная компьютерная сеть - это:"
"217-savol javobi
 совокупность локальных сетей и компьютеров, расположенных на больших расстояниях и соединенных с помощью каналов связи в единую систему"
"218-savol?
Гиперссылки на Web-странице могут обеспечивать переход:"
"218-savol javobi
на любую Web-страницу любого Web-сервера"
"219-savol?
Что не содержит заголовка пакета IPv6:"
"219-savol javobi
данные контрольной суммы"
"220-savol?
Адрес IPv4 содержит"
"220-savol javobi
4 байта"
"221-savol?
Адрес IPv6 содержит"
"221-savol javobi
16 байт"
"222-savol?
Максимальное значение октета IP адреса в двоичной системе счисления:"
"222-savol javobi
11111111"
"223-savol?
Максимальное значение октета IP адреса в десятичной системе счисления:"
"223-savol javobi
255"
"224-savol?
Структура IP адреса представляет собой:"
"224-savol javobi
двухуровневую иерархическую модель"
"225-savol?
Причина создания IPv6:"
"225-savol javobi
нехватка адресного пространства"
"226-savol?
Индивидуальная адресация называется:"
"226-savol javobi
unicast"
"227-savol?
Групповая адресация называется:"
"227-savol javobi
multicast"
"228-savol?
Широковещательная адресация называется:"
"228-savol javobi
broadcast"
"229-savol?
Выберите адресное пространство частных IPv4 адресов класса А:"
"229-savol javobi
10.0.0.0 – 10.255.255.255"
"230-savol?
Выберите адресное пространство частных IPv4 адресов класса В:"
"230-savol javobi
172.16.0.0 – 172.31.255.255"
"231-savol?
Выберите адресное пространство частных IPv4 адресов класса С:"
"231-savol javobi
192.168.0.0 – 192.168.255.255"
"232-savol?
Домен-это..."
"232-savol javobi
часть адреса, определяющая адрес компьютера пользователя в сети"
"233-savol?
Какой из перечисленных протоколов не является дистанционно-векторным?"
"233-savol javobi
OSPF"
"234-savol?
Протокол RIP является протоколом"
"234-savol javobi
дистанционно-векторным"
"235-savol?
Протокол OSPF является протоколом"
"235-savol javobi
состояния каналов связи"
"236-savol?
На каком уровне модели OSI используются MAC-адреса?"
"236-savol javobi
канальном"
"237-savol?
На каком уровне модели OSI передаются датаграммы?"
"237-savol javobi
транспортный"
"238-savol?
Какой из перечисленных MAC-адресов является индивидуальным?"
"238-savol javobi
30-9С-23-15-Е8-8С"
"239-savol?
Какой из перечисленных MAC-адресов является групповым?"
"239-savol javobi
01-80-С2-00-00-08"
"240-savol?
Какой из перечисленных MAC-адресов является широковещательным?"
"240-savol javobi
 FF-FF-FF-FF-FF-FF"
"241-savol?
Признаком группового MAC-адреса является равенство первого бита старшего байта"
"241-savol javobi
1"
"242-savol?
Централизованно MAC-адрес назначается "
"242-savol javobi
производителем"
"243-savol?
Локально MAC-адрес назначается"
"243-savol javobi
администратором сети"
"244-savol?
Если MAC-адрес назначен централизованно, то индикатор способа назначения (второй бит старшего байта) равен"
"244-savol javobi
0"
"245-savol?
 Если MAC-адрес назначен локально, то индикатор способа назначения (второй бит старшего байта) равен"
"245-savol javobi
1"
"246-savol?
Сетевым узлом является: "
"246-savol javobi
любое устройство, которое принимает и затем передает что-то через сеть, но вместо этого может просто получать и хранить данные, передавать информацию в другом месте или создавать и отправлять данные"
"247-savol?
Пропускная способность — это"
"247-savol javobi
метрическая характеристика, показывающая соотношение предельного количества проходящих единиц в единицу времени через канал, систему, узел"
"248-savol?
Какая организация стандартов создала эталонную модель взаимодействия открытых систем?"
"248-savol javobi
ISO "
"249-savol?
Какая максимальная скорость передачи данных в сети Fast Ethernet?"
"249-savol javobi
100 Мбит/с"
"250-savol?
Какой формулой определяется максимальная  пропускная способность каналов связи?"
"250-savol javobi
Формула Шеннона"
"251-savol?
В каком году началась разработка нового поколения мобильной связи 5G?"
"251-savol javobi
2015"
"252-savol?
Что из перечисленного является технологией пассивных оптических сетей?"
"252-savol javobi
PON"
"253-savol?
Найдите преимущества технологии PON:"
"253-savol javobi
вес перечисленные преимущества"
"254-savol?
Какая из перечисленных технологий является асимметричной?"
"254-savol javobi
ADSL"
"255-savol?
Какая из перечисленных технологий является симметричной?"
"255-savol javobi
SDSL"
"256-savol?
Какая из перечисленных технологий является однонаправленной?"
"256-savol javobi
UDSL"
"257-savol?
Какой тип кабеля из перечисленных используется  в кабельных сетях:"
"257-savol javobi
все перечисленные типы"
"258-savol?
Какие требования предъявляются к транспортным сетям?"
"258-savol javobi
все перечисленные требования"
"259-savol?
На основе каких технологий строится современная транспортная сеть:"
"259-savol javobi
на основе всех перечисленных технологий"
"260-savol?
В основе какого стандарта лежит технология множественного доступа с кодовым разделением каналов:"
"260-savol javobi
на основе всех перечисленных стандартов"
"261-savol?
В чем назначение программы Cisco Packet Tracer?"
"261-savol javobi
эмуляция модели OSI "
"262-savol?
Что такое Cisco и каковы ее задачи?"
"262-savol javobi
 компания Cisco является разработчиком и производителем сетевого оборудования  "
"263-savol?
Какая из перечисленных программ не является эмулятором сетевой среды?"
"263-savol javobi
 LAN Calculator "
"264-savol?
Какие устройства служат для поиска оптимального маршрута передачи данных на основании алгоритмов маршрутизации?"
"264-savol javobi
маршрутизаторы  "
"265-savol?
Какую линию связи следует выбрать для связи между кабельным модемом и облаком?
"
"265-savol javobi
коаксиальный кабель  "
"266-savol?
Какой тип кабеля следует использовать при соединении роутеров между собой?"
"266-savol javobi
 медный кроссовер  "
"267-savol?
Какой тип шифрования предоставляет наиболее высокую защиту беспроводной сети?"
"267-savol javobi
 WPA2"
"268-savol?
Когда была запущена первая сеть UMTS:"
"268-savol javobi
2001"
"269-savol?
К какому поколению мобильной связи относится стандарт UMTS:"
"269-savol javobi
3"
"270-savol?
К какому поколению мобильной связи относится стандарт LTE:"
"270-savol javobi
4"
"271-savol?
К какому поколению мобильной связи относится стандарт WiMAX:"
"271-savol javobi
4"
"272-savol?
К какому классу стандартов относится стандарт WiMAX:"
"272-savol javobi
MAN"
"273-savol?
Какая из перечисленных технологий работает в состоянии, когда разные части сети почти, но не совсем синхронизированы:"
"273-savol javobi
PDH"
"274-savol?
В чем отличие режима реального времени от режима симуляции сети в программе Cisco Packet Tracer?"
"274-savol javobi
в режиме симуляции можно имитировать сетевые события"
"275-savol?
В чем главное назначение протокола ICMP?"
"275-savol javobi
ICMP используется для передачи сообщений об ошибках и других исключительных ситуациях, возникших при передаче данных"
"276-savol?
В чем назначение команды Ping?"
"276-savol javobi
это команда для проверки соединений в сетях на основе TCP/IP"
"277-savol?
В каком режиме пользователь в программе Cisco Packet Tracer может посмотреть структуру пакета?"
"277-savol javobi
в режиме симуляции"
"278-savol?
В каком из утверждений, верно описан принцип работы хаба?"
"278-savol javobi
хаб повторяет пакет на всех портах надеясь, что на одном из них есть получатель информации"
"279-savol?
В технологии PDH в качестве входного используется сигнал основного цифрового канала, а на выходе формируется поток данных со скоростями:"
"279-savol javobi
n * 64 кбит/с"
"280-savol?
Где широко используется синхронная оптическая сеть SONET?"
"280-savol javobi
в США"
"281-savol?
Найдите отличительную особенность технологии DWDM:"
"281-savol javobi
всё перечисленное"
"282-savol?
Какая система счисления используется в MAC-адресах:"
"282-savol javobi
шестнадцатеричная (16)"
"283-savol?
Найдите неверное утверждение:"
"283-savol javobi
режим моделирования (симуляции) позволяет просматривать и изменять записи в кэш ARP"
"284-savol?
Как называется топология, в которой все компьютеры сети присоединены к центральному узлу, образуя физический сегмент сети:"
"284-savol javobi
звезда"
"285-savol?
Что не может выступать в роли центрального узла звезды?"
"285-savol javobi
роутер"
"286-savol?
Какое устройство подает пакет на все порты?"
"286-savol javobi
концентратор"
"287-savol?
В какой топологии выход из строя одной рабочей станции не отражается на работе всей сети в целом?"
"287-savol javobi
звезда"
"288-savol?
Основной принцип технологии «клиент-сервер»:"
"288-savol javobi
все перечисленные принципы"
"289-savol?
Для работы технологии DWDM необходим:"
"289-savol javobi
все перечисленные устройства"
"290-savol?
Назовите компонент сетевого приложения:"
"290-savol javobi
все перечисленные компоненты"
"291-savol?
Сеть, в которой каждый компьютер может быть администратором и пользователем одновременно, называется:"
"291-savol javobi
одноранговой сетью"
"292-savol?
Назовите преимущество одноранговых сетей:"
"292-savol javobi
все перечисленные преимущества"
"293-savol?
Какой из перечисленных недостатков присущ для одноранговых сетей:"
"293-savol javobi
все перечисленные недостатки"
"294-savol?
Сколько компьютеров может быть в одноранговой сети?"
"294-savol javobi
 11"
"295-savol?
Управление доступом на уровне ресурсов существует:"
"295-savol javobi
в одноранговых сетях"
"296-savol?
Управление на уровне пользователей существует"
"296-savol javobi
в архитектуре клиент/сервер"
"297-savol?
Какой вид сервера используется в локальных сетях?"
"297-savol javobi
все перечисленные виды серверов"
"298-savol?
Какой вид сервера используется в глобальных сетях?"
"298-savol javobi
все перечисленные виды серверов"
"299-savol?
На каком уровне модели OSI работает хаб, который отправляет широковещательный запрос?"
"299-savol javobi
 1-й уровень OSI"
"300-savol?
Что такое PDU?"
"300-savol javobi
обобщённое название фрагмента данных на разных уровнях модели OSI:"
"301-savol?
С какой целью (для чего) была разработана модель OSI?"
"301-savol javobi
 модель OSI моделирует работу любой (локальной и глобальной) сети"
"302-savol?
Каким инструментом можно создавать надписи на схеме сети в программе Cisco Packet Tracer?"
"302-savol javobi
Place Note"
"303-savol?
На каком уровне модели OSI работает Switch?"
"303-savol javobi
2-й уровень OSI"
"304-savol?
Какой протокол используется для получения IP адреса по имени определенного хоста?"
"304-savol javobi
DNS"
"305-savol?
Для чего используется DNS протокол?"
"305-savol javobi
для всех перечисленных действий"
"306-savol?
В каком году был разработан протокол DNS?"
"306-savol javobi
1983"
"307-savol?
Какая из перечисленных функций характеризует протокол DNS?"
"307-savol javobi
все перечисленные функции"
"308-savol?
Для доступа к Web-серверу необходимо знать:"
"308-savol javobi
IP адрес"
"309-savol?
Что из перечисленного является функцией протокола DNS:"
"309-savol javobi
все перечисленные функции"
"310-savol?
Какой порт использует протокол DNS?"
"310-savol javobi
53"
"311-savol?
Сколько символов используют домены стран (верхний уровень)?"
"311-savol javobi
2"
"312-savol?
Какой домен верхнего уровня в Internet имеет Россия:"
"312-savol javobi
ru"
"313-savol?
Какой протокол совершает обмен управляющими сообщениями:"
"313-savol javobi
ICMP"
"314-savol?
Какой из перечисленных протоколах является протоколом сообщения об ошибках:"
"314-savol javobi
ICMP"
"315-savol?
Какой из перечисленных протоколов является простым протоколом сетевого управления, стандартным Интернет-протоколом для управления устройствами в IP сетях на основе архитектур TCP/UDP:"
"315-savol javobi
SNMP"
"316-savol?
Какой из перечисленных компонентов есть в сети, использующей протокол SNMP для управления:"
"316-savol javobi
все перечисленные компоненты"
"317-savol?
На каком уровне модели OSI работает Router?"
"317-savol javobi
 3-й уровень OSI"
"318-savol?
В каких единицах измеряется скорость порта FastEthernet?"
"318-savol javobi
Мбит/сек"
"319-savol?
Какая вкладкав программе Cisco Packet Tracer служит для отображения внешнего вида коммутатора модели 2960?"
"319-savol javobi
Physical"
"320-savol?
Какой принцип заложен при исследовании качества передачи трафика по сети (при исследование пропускной способности ЛВС)?"
"320-savol javobi
увеличение размера пакета и отправка запросов с коротким интервалом времени, не ожидая ответа от удаленного узла, для того, чтобы создать небольшую нагрузку на сеть"
"321-savol?
Наличие этого параметра не позволяет пакету бесконечно ходить по сети:"
"321-savol javobi
 TTL"
"322-savol?
Какую команду распознаёт IOS при наборе символов “en”?"
"322-savol javobi
enable"
"323-savol?
Для чего предназначены access порты?"
"323-savol javobi
для подключения пользователей"
"324-savol?
Рассмотрите перечисленые основные режимы конфигурации при настройке коммутатора. В каком ответе ошибка?"
"324-savol javobi
 административный"
"325-savol?
Что такое CLI в программе Cisco Packet Tracer, как и зачем используется?"
"325-savol javobi
CLI – командная строка, используется для программирования устройств Cisco"
"326-savol?
Как называется сеть, использующая в своем составе множество датчиков:"
"326-savol javobi
сенсорная сеть"
"327-savol?
Назовите основную особенность беспроводной сенсорной сети:"
"327-savol javobi
все перечисленные особенности"
"328-savol?
Какие преимущества имеет технология сенсорных сетей перед другими беспроводными и проводными системами:"
"328-savol javobi
 все перечисленные преимущества"
"329-savol?
Каждый узел сенсорной сети содержит:"
"329-savol javobi
всё перечисленное"
"330-savol?
Сенсорные сети строятся на технологии:"
"330-savol javobi
ZigBee"
"331-savol?
Какой уровень не связан с топологией?"
"331-savol javobi
транспортный"
"332-savol?
Какой из блоков данных по объему больше:"
"332-savol javobi
сегмент"
"333-savol?
К какому протоколу относятся  пакеты данных?"
"333-savol javobi
IP"
"334-savol?
Найдите неверный ответ: Для чего создаются виртуальные локальные сети (VLAN)?"
"334-savol javobi
для объединения сетей различных топологий"
"335-savol?
Что определяет команда Router1(config)#enable password parol?"
"335-savol javobi
 пароль на привилегированный режим"
"336-savol?
Какие алгоритмы используются для формирования таблиц маршрутизации?"
"336-savol javobi
все перечисленные алгоритмы"
"337-savol?
В каком типе алгоритма администратор сети сам решает, на какие маршрутизаторы передать пакеты и заносит соответствующие записи в таблицу маршрутизации вручную:"
"337-savol javobi
фиксированной (статической) маршрутизации"
"338-savol?
В каком типе алгоритма таблица маршрутизации или не используется или строится без участия протокола маршрутизации?"
"338-savol javobi
простой маршрутизации"
"339-savol?
В каком типе алгоритма обеспечивается автоматическое обновление таблиц маршрутизации после изменения конфигурации сети?"
"339-savol javobi
адаптивной (динамической) маршрутизации"
"340-savol?
Какие действия следует выполнить для того, чтобы проверить работоспособность Cisco HTML сервера?"
"340-savol javobi
открываем клиентскую машину и на вкладке Desktop запускаем приложение Web Browser. После чего набираем IP адрес нашего WEB-сервера и нажимаем на кнопку GO"
"341-savol?
Перед вами четыре октета: 255.0.0.0. Что это может быть?"
"341-savol javobi
 маска подсети"
"342-savol?
Какие параметры сервер DHCP не предоставляет клиентам?"
"342-savol javobi
 MAC адрес"
"343-savol?
Какой протокол следит за тем, чтобы в сети не было повторения IP адресов?"
"343-savol javobi
 ARP"
"344-savol?
Для чего предназначена команда show ip route?"
"344-savol javobi
для проверки таблицы маршрутизации роутера"
"345-savol?
Траффик наиболее критический к задержкам, это -"
"345-savol javobi
голосовой в реальном режиме"
"346-savol?
Выберите основной принцип сетевой безопасности"
"346-savol javobi
все перечисленные принципы"
"347-savol?
Какое устройство, подключенное к компьютеру, обеспечивает информационную безопасность пользователя и дает разрешение для его работы?"
"347-savol javobi
все перечисленные устройства"
"348-savol?
Как обеспечивается защита от несанкционированного доступа?"
"348-savol javobi
всеми перечисленными способами"
"349-savol?
Как называется изменение MAC-адреса на программном уровне:"
"349-savol javobi
MAC-spoofing"
"350-savol?
Что значит CSMA/CD?"
"350-savol javobi
множественный доступ с прослушиванием несущей и обнаружением коллизий "
"351-savol?
Что значит CSMA/CA?"
"351-savol javobi
множественный доступ с прослушиванием несущей и избежанием коллизий"
"352-savol?
Коллизия  иначе это -"
"352-savol javobi
столкновение"
"353-savol?
К какому виду физической среды передачи данных относятся радиоканалы, лазерные и инфракрасные каналы?"
"353-savol javobi
к беспроводному"
"354-savol?
Для соединения типа: «компьютер-компьютер», «коммутатор-коммутатор» используется"
"354-savol javobi
перекрестный кабель"
"355-savol?
Что означает сообщение DHCPDISCOVER?"
"355-savol javobi
нахождение доступных DHCP-серверов "
"356-savol?
Нахождение доступных DHCP-серверов соответствует сообщению:"
"356-savol javobi
DHCPDISCOVER"
"357-savol?
Чему равна длина MAC адреса:"
"357-savol javobi
48 бит"
"358-savol?
Предложение DHCP соответствует сообщению:"
"358-savol javobi
DHCPOFFER"
"359-savol?
Запрос DHCP соответствует сообщению:"
"359-savol javobi
DHCPREQUEST"
"360-savol?
Подтверждение DHCP соответствует сообщению:"
"360-savol javobi
DHCPACT"
"361-savol?
Что означает сообщение DHCPOFFER?"
"361-savol javobi
предложение DHCP"
"362-savol?
Что означает сообщение DHCPREQUEST?"
"362-savol javobi
запрос DHCP"
"363-savol?
Что означает сообщение DHCPACT?"
"363-savol javobi
подтверждение DHCP"
"364-savol?
Передача системе идентифицирующего признака пользователя называется:"
"364-savol javobi
идентификация"
"365-savol?
Сравнение идентифицирующего признака пользователя называется:"
"365-savol javobi
аутентификация"
"366-savol?
Для соединения типа «компьютер-коммутатор», «коммутатор- маршрутизатор» используется"
"366-savol javobi
прямой кабель"
"367-savol?
Какой командой открывается глобальный контекст конфигурирования в программе Cisco Packet Tracer?"
"367-savol javobi
сonfig terminal"
"368-savol?
Какая команда используется для проверки связи между устройствами?"
"368-savol javobi
ping"
"369-savol?
Команда no shutdown в программе Cisco Packet Tracer позволяет:"
"369-savol javobi
включить интерфейс"
"370-savol?
Команда write memory  в программе Cisco Packet Tracer позволяет:"
"370-savol javobi
сохранить конфигурацию"
"371-savol?
Какая команда устанавливает расширенный доступ к конфигурации?"
"371-savol javobi
enable"
"372-savol?
Графический пользовательский интерфейс -"
"372-savol javobi
GUI"
"373-savol?
Найдите типовую угрозу безопасности информации при использовании глобальных компьютерных сетей"
"373-savol javobi
все перечисленные"
"374-savol?
Подмена субъекта или объекта сети называется:"
"374-savol javobi
маскарад"
"375-savol?
Внедрение ложного объекта сети называется:"
"375-savol javobi
человек посередине"
"376-savol?
Какая причина облегчает нарушителю реализацию угроз безопасности информации в распределенных компьютерных системах:"
"376-savol javobi
все перечисленные причины"
"377-savol?
Что означает понятие конвергентных сетей?"
"377-savol javobi
объединение нескольких услуг в рамках одной услуги"
"378-savol?
Интерфейс командной строки, в котором инструкции компьютеру даются только путём ввода с клавиатуры текстовых строк (команд):"
"378-savol javobi
CLI"
"379-savol?
Средство для создания, сохранения и открытия средств администрирования которые управляют оборудованием, программными и сетевыми компонентами операционной системы Windows:"
"379-savol javobi
MMC"
"380-savol?
На каком уровне модели OSI действуют повторители и усилители?"
"380-savol javobi
на физическом уровне"
"381-savol?
На каком уровне модели действуют  мосты и  коммутаторы?"
"381-savol javobi
на канальном уровне"
"382-savol?
UTP  кабель - это "
"382-savol javobi
кабель на основе неэкранированной медной пары"
"383-savol?
STP кабель - это"
"383-savol javobi
кабель на основе экранированной медной пары"
"384-savol?
Для подключения к толстому коаксиальному кабелю применяют специальное устройство – "
"384-savol javobi
трансивер"
"385-savol?
Для подключения тонкого коаксиального кабеля используются:"
"385-savol javobi
BNC-коннекторы"
"386-savol?
К телекоммуникационным сетям относятся:"
"386-savol javobi
все перечисленные сети"
"387-savol?
 Что такое гетерогенная компьютерная сеть?"
"387-savol javobi
все перечисленные сети"
"388-savol?
Что такое гетерогенная сетевая архитектура?"
"388-savol javobi
все перечисленные архитектуры"
"389-savol?
Найдите неверный ответ: в чем плюсы статической маршрутизации?"
"389-savol javobi
хорошее масштабирование, динамическое балансирование нагрузки"
"390-savol?
Для чего служит метрика?"
"390-savol javobi
каждый протокол маршрутизации использует свою систему оценки маршрутов (метрику)"
"391-savol?
Как посмотреть, какие маршруты получены через соответствующий протокол?"
"391-savol javobi
выполнить команду show ip route"
"392-savol?
Укажите на ошибку в свойствах протокола динамической маршрутизации EIGRP:"
"392-savol javobi
протокол EIGRP можно использовать не только на оборудовании компании Cisco, но и на любом другом"
"393-savol?
В чем заключается маршрутизация пакетов в сети?"
"393-savol javobi
маршрутизация - процесс определения в сети наилучшего (оптимального) пути, по которому пакет может достигнуть адресата"
"394-savol?
Перечислите основные функции сетевой операционной системы:"
"394-savol javobi
все названные функции"
"395-savol?
Траффик наиболее критический к задержкам, это"
"395-savol javobi
голосовой в реальном режиме"
"396-savol?
Укажите неверную функцию сетевой ОС:"
"396-savol javobi
подсчет числа компьютеров в сети"
"397-savol?
Какая функция сетевой ОС заключается в обеспечении доступа к данным:"
"397-savol javobi
управление каталогами и файлами"
"398-savol?
Какая функция сетевой ОС включает обслуживание запросов на предоставление ресурсов, доступных по сети?"
"398-savol javobi
управление ресурсами"
"399-savol?
Какая функция сетевой ОС обеспечивает адресацию, буферизацию выбор направления для движения данных в разветвленной сети:"
"399-savol javobi
коммуникационные функции "
"400-savol?
Что значит отображение в сетевых операционных системах:"
"400-savol javobi
наличие двух копий данных, на разных дисках, подключенных к одному контроллеру"
"401-savol?
Что значит дублирование в сетевых операционных системах:"
"401-savol javobi
наличие двух копий данных, на разных дисках, подключенных к разным контроллерам"
"402-savol?
Менеджер в сетевой ОС – это программа:"
"402-savol javobi
вырабатывающая сетевые команды"
"403-savol?
Найдите неправильно указанную часть сетевой операционной системы отдельного компьютера:"
"403-savol javobi
средства исправления сетевых ошибок"
"404-savol?
Как называется сетевое программное обеспечение, принимающее запросы ввода/вывода для удаленных файлов?"
"404-savol javobi
редиректор"
"405-savol?
Как называется часть программного обеспечения, управляющая присвоением букв накопителя сетевым ресурсам?"
"405-savol javobi
распределитель"
"406-savol?
Сети с выделенными серверами называют:"
"406-savol javobi
двухранговыми сетями"
"407-savol?
Компьютер, работающий в сети, может выполнять функции:"
"407-savol javobi
все перечисленные функции"
"408-savol?
Хост – это:"
"408-savol javobi
все перечисленные устройства"
"409-savol?
Выберите неверное утверждение:"
"409-savol javobi
 ограничение в числе хопов не дает применять RIP в небольших сетях"
"410-savol?
При помощи какой команды в программе Cisco Packet Tracer можно проверить, что маршрутизатор видит все присоединённые к нему сети?"
"410-savol javobi
show ip route"
"411-savol?
Сетевое устройство, служащее для объединения отдельных участков единой компьютерной сети и не преобразующее информацию называется:"
"411-savol javobi
HAB"
"412-savol?
Сетевое устройство, служащее для определения маршрута, по которому наиболее целесообразно передавать пакеты информации, называется:"
"412-savol javobi
ROUTER"
"413-savol?
Сетевые устройства, служащие для объединения в единую сеть нескольких компьютерных сетей различных типов, а также для снижения нагрузки в сети называют:"
"413-savol javobi
BRIDGE"
"414-savol?
Сетевые устройства, служащие для объединения отдельных сетей с различными протоколами обмена называют:"
"414-savol javobi
GATEWAY"
"415-savol?
Средой передачи является:"
"415-savol javobi
все перечисленные линии и каналы"
"416-savol?
Какое преимущество имеют современные компьютерные сети?"
"416-savol javobi
все перечисленные преимущества"
"417-savol?
Какой протокол определяет форму передачи данных в современных компьютерных сетях и «нарезает» данные на пакеты?"
"417-savol javobi
TCP"
"418-savol?
Какой протокол определяет направление передачи данных по сетевому адресу, имеющемуся в каждом пакете?"
"418-savol javobi
IP"
"419-savol?
Какой протокол называют адресным протоколом?"
"419-savol javobi
IP"
"420-savol?
Какой протокол обеспечивает идентификацию персонального компьютера с уникальным сетевым адресом и именем?"
"420-savol javobi
DNS"
"421-savol?
В чем отличие протоколов RIP и OSPF? Найдите ошибку в ответах"
"421-savol javobi
конфигурировать протокол RIP сложнее, чем OSPF"
"422-savol?
Укажите неверное утверждение:"
"422-savol javobi
LSA сообщения о состоянии каналов отправляются протоколом OSPF один раз в 10 минут"
"423-savol?
Кто участвует в решении вопросов безопасности сети:"
"423-savol javobi
списки управления доступом (ACL)"
"424-savol?
Это кабель, в котором изолированная пара проводников скручена с небольшим числом витков на единицу длины -"
"424-savol javobi
UTP"
"425-savol?
Стандартизацией технологий локальных сетей занимается- "
"425-savol javobi
IEEE "
"426-savol?
Gigabit Ethernet – "
"426-savol javobi
гигабитный Ethernet – локальная сеть с пропускной способностью 1000 Мбит/с"
"427-savol?
Какой метод доступа к среде передачи используют Fast Ethernet и Gigabit Ethernet?"
"427-savol javobi
метод CSMA/CD"
"428-savol?
10Base-5, 10Base-2, 10Base-T……. что обозначает число 10 в вышеуказанных названиях:"
"428-savol javobi
битовую скорость передачи данных – 10 Мбит/с"
"429-savol?
Какой протокол является протоколом передачи гипертекста?"
"429-savol javobi
HTTP"
"430-savol?
Какой протокол обслуживает службу WWW (WORD WIDE WEB – Всемирная паутина)?"
"430-savol javobi
HTTP"
"431-savol?
Какой протокол является протоколом передачи файлов?"
"431-savol javobi
FTP"
"432-savol?
Какой протокол является протоколом передачи почты?"
"432-savol javobi
SMTP"
"433-savol?
Назовите неверно указанный компонент службы WWW (Всемирной паутины):"
"433-savol javobi
WEB-форум"
"434-savol?
Назовите особенность технологии WWW:"
"434-savol javobi
все перечисленные особенности"
"435-savol?
Для работы службы телеконференций USENET используется протокол:"
"435-savol javobi
NNTP"
"436-savol?
Какое из следующих устройств, принимая решение о дальнейшем перемещении пакета, выходит из информации о доступности канала и степенях его загрузки :"
"436-savol javobi
маршрутизатор"
"437-savol?
10Base-5, 10Base-2, 10Base-T……. что обозначает слово Base  в вышеуказанных названиях?"
"437-savol javobi
метод передачи на одной базовой частоте 10 МГц"
"438-savol?
Технология Ethernet получила свое название благодаря своему создателю – "
"438-savol javobi
Роберту Меткалфу"
"439-savol?
Продолжите выражение: протокол обратного преобразования RARP — Reverse Address Resolution Protocol -"
"439-savol javobi
находит логический адрес (IP-адрес) для компьютера по его физическому адресу"
"440-savol?
Протокол ARP – Address Resolution Protocol: "
"440-savol javobi
протокол нахождения адреса"
"441-savol?
Какие виды режима адресации поддерживает протокол IPv4?"
"441-savol javobi
одноадресный, широковещательный, многоадресный"
"442-savol?
Для передачи файлов по сети используется протокол…"
"442-savol javobi
 FTP"
"443-savol?
Задан адрес электронной почты в сети Интернет: fortuna@list.ru. Каково имя почтового сервера?"
"443-savol javobi
list.ru"
"444-savol?
Выберите корректный IP-адрес компьютера в сети"
"444-savol javobi
108.214.198.112"
"445-savol?
Определите номер компьютера в сети по IP 215.128.255.106"
"445-savol javobi
106"
"446-savol?
Как называется часть электронной логической схемы, которая реализует элементарную логическую функцию?"
"446-savol javobi
логический элемент компьютера"
"447-savol?
Под термином «интерфейс» понимается  -"
"447-savol javobi
внешний вид программной среды, служащий для обеспечения диалога с пользователем"
"448-savol?
Протокол TCP/IP является "
"448-savol javobi
базовым транспортным сетевым протоколом"
"449-savol?
Совокупность характеристик и параметров, определяющих функционально-логическую и  структурную организацию систем – это"
"449-savol javobi
архитектура вычислительной системы"
"450-savol?
В стеке протоколов TCP/IP  уровень II …."
"450-savol javobi
является основным и работает на базе протокола управления передачей TCP"
"451-savol?
Cетевое устройство, соединяющее между собой сегменты локальной сети:"
"451-savol javobi
мост"
"452-savol?
Продолжите выражение: протокол коммуникации — это "
"452-savol javobi
согласованный набор конкретных правил обмена информацией между разными устройствами передачи данных"
"453-savol?
Какие виды узлов сети бывают:"
"453-savol javobi
оконечный узел, промежуточный узел, смежный узел"
"454-savol?
На каком уровне эталонной модели OSI функционируют маршрутизаторы?"
"454-savol javobi
на сетевом уровне"
"455-savol?
Архитектура сети — это"
"455-savol javobi
реализованная структура сети передачи данных, определяющая её топологию, состав устройств и правила их взаимодействия в сети"
"456-savol?
Сетевая архитектура высокоскоростной передачи данных по оптоволоконным линиям:"
"456-savol javobi
FDDI"
"457-savol?
При помощи каких компонент  сетевые процессы могут идентифицировать друг друга?"
"457-savol javobi
IP-адрес, протокол (TCP/UDP), порт"
"458-savol?
UDP –  это"
"458-savol javobi
транспортный протокол, передающий сообщения-датаграммы без необходимости установки соединения в IP-сети"
"459-savol?
TCP –  это"
"459-savol javobi
транспортный протокол передачи данных в сетях TCP/IP, предварительно устанавливающий соединение с сетью"
"460-savol?
Базовая Система Ввода-Вывода (BIOS) предназначена для:"
"460-savol javobi
самодиагностики и самотестирования материнской платы и устройств подключенных к ней"
"461-savol?
Что такое быстродействие процессора?"
"461-savol javobi
число элементарных операций, выполняемых процессором в единицу времени"
"462-savol?
Основной характеристикой компьютерного блока питания является:"
"462-savol javobi
мощность"
"463-savol?
Время доступа к жёсткому диску измеряется в:"
"463-savol javobi
наносекундах"
"464-savol?
Тактовая частота указывает …"
"464-savol javobi
сколько элементарных операций (тактов) микропроцессор выполняет за одну секунду"
"465-savol?
Скорость работы компьютера зависит от …"
"465-savol javobi
тактовой частоты обработки информации в процессоре"
"466-savol?
Характеристиками оперативной памяти являются"
"466-savol javobi
объем, время доступа "
"467-savol?
Группа компьютеров, объединённых высокоскоростными каналами связи, представляющая с точки зрения пользователя единый аппаратный ресурс называется"
"467-savol javobi
кластером"
"468-savol?
Какой из перечисленных видов памяти имеет самый большой объем?"
"468-savol javobi
внешняя память"
"469-savol?
Сервер на котором хранятся файлы общего доступа называется"
"469-savol javobi
файл-сервер"
"470-savol?
Что такое прерывание?"
"470-savol javobi
это временный останов выполнения одной программы в целях оперативного выполнения другой, в данный момент более важной"
"471-savol?
Правила, по которым осуществляется обмен информации о путях передачи пакетов между маршрутизаторами - это"
"471-savol javobi
протоколы маршрутизации"
"472-savol?
Утилита ping позволяет: "
"472-savol javobi
проверить наличие соединения"
"473-savol?
Найдите верное утверждение:  команда ping"
"473-savol javobi
все ответы верны"
"474-savol?
О переходе в привилегированный режим будет свидетельствовать появление в командной строке приглашения в виде знака - "
"474-savol javobi
#"
"475-savol?
Режим глобального конфигурирования —"
"475-savol javobi
реализует мощные однострочные команды, которые решают задачи конфигурирования"
"476-savol?
Обобщенная геометрическая характеристика компьютерной сети – это:"
"476-savol javobi
топология сети"
"477-savol?
Протокол компьютерной сети - совокупность:"
"477-savol javobi
правил, регламентирующих прием-передачу, активацию данных в сети"
"478-savol?
Соединение нескольких сетей дает:"
"478-savol javobi
межсетевое объединение"
"479-savol?
Поток сетевых сообщений определяется:"
"479-savol javobi
трафиком"
"480-savol?
При вводе какого знака в командной строке любого режима имени команды  на экран выводятся комментарии к команде?"
"480-savol javobi
?"
"481-savol?
Пароль доступа позволяет контролировать доступ в привилегированный  режим. Как правильно установить в качестве пароля - cisco?"
"481-savol javobi
Router1(config)#enable password cisco"
"482-savol?
Какая из команд выведет детальную информацию о каждом интерфейсе (для роутера):  "
"482-savol javobi
Router1 show interfaces"
"483-savol?
Вид маршрутизации, при котором таблица маршрутизации заполняется и обновляется автоматически при помощи одного или нескольких протоколов маршрутизации -"
"483-savol javobi
динамическая маршрутизация"
"484-savol?
Вид маршрутизации, при котором таблица маршрутизации заполняется вручную администратором сети -"
"484-savol javobi
статическая маршрутизация"
"485-savol?
Маршрутизаторы обмениваются друг с другом информацией о маршрутах с помощью служебных пакетов по протоколу -"
"485-savol javobi
UDP"
"486-savol?
Протокол с отслеживанием состояния каналов -"
"486-savol javobi
OSPF"
"487-savol?
Cisco ASA -"
"487-savol javobi
аппаратный межсетевой экран с инспектированием сессий с сохранением состояния"
"488-savol?
Что используется по умолчанию в команде Protocol: "
"488-savol javobi
ip"
"489-savol?
Какую клавишу следует удерживать для того, чтобы скопировать ПК несколько раз?"
"489-savol javobi
Ctrl "
"490-savol?
Для чего служит параметр “n” в команде ping –n "
"490-savol javobi
параметр «–n» позволяет задать количество передаваемых эхо-запросов"
"491-savol?
Какая кнопка позволяет отображать моделирование всего ping-процесса пошагово?"
"491-savol javobi
Capture/Forward"
"492-savol?
По виду командной строки Router(config-if) определите в каком режиме находится роутер:"
"492-savol javobi
настройка интерфейсов "
"493-savol?
По виду командной строки Router определите в каком режиме находится роутер:"
"493-savol javobi
 пользовательский "
"494-savol?
По виду командной строки Router#  определите в каком режиме находится роутер:"
"494-savol javobi
привилегированный "
"495-savol?
По виду командной строки Router(config)# определите в каком режиме находится роутер:"
"495-savol javobi
глобальная конфигурация "
"496-savol?
Что имитирует вкладка CLI?"
"496-savol javobi
имитирует прямое кабельное (консольное) подключение к сетевому устройству "
"497-savol?
Для чего служит транковый порт?"
"497-savol javobi
для настройки связи коммутаторов, то есть, для создания магистрали обмена между коммутаторами в VLAN  "
"498-savol?
Найдите неверные ответ: что из себя представляет транковый порт?"
"498-savol javobi
транковый порт — это канал для соединения ПК и сервера "
"499-savol?
Какая из приведенных команд зажигает лапочку порта?"
"499-savol javobi
no sh"
"500-savol?
Для чего предназначена служба FIREWALL?"
"500-savol javobi
Firewall выполняет функцию защитного барьера между компьютером и Интернетом и позволяет контролировать весь входящий и исходящий трафик  "
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Укажите вариант, где 
перечислены сетевые 
операционные системы? 
Novell Netware, UNIX, Windows 
NT 
Какие уровни модели OSI 
являются сетезависимыми? транспортный и сеансовый 
Какие из характеристик 
являются характеристиками, 
как линии связи, так и 
способа передачи данных? 
пропускная способность и 
достоверность 
На какие виды 
подразделяется кабель на 
основе витых пар? 
зкранированная и 
неэкранированная 
На какие виды 
подразделяется 
оптоволоконный кабель? 
одномодовый и многомодовый 
На какие виды 
подразделяется коаксиальный 
кабель? 
тонкий и толстый 
Способ соединения 
компьютеров сетевыми 
кабелями называется -  
топологией сети 
Укажите правильный вариант 
ответа, где правильно (сверху 
вниз) перечислены уровни 
модели OSI: 
прикладной, представительский, 
сеансовый, транспортный, 
сетевой, канальный,физический 
Какой протокол отвечает за 
адресацию в сети и доставку 
пакетов между 
компьютерами сети, без 
установления соединения и 
гарантий доставки пакета? 
IP 
Эта программа (устройство) 
позволяет выявить в сети 
вредоносное и 
несанкционированное 
программное обеспечение - 
сниффер 
Из скольких, и каких уровней 
адреса состоит каждый 
компьютер в сетях TCP/IP? 
3 уровней: физический (MAC
адрес), сетевой (IP-адрес) и 
символьный (DNS-имя) 
Сколько байтов имеет формат 
физического МАС – адреса 
для всех существующих 
технологий локальных сетей? 
6 
Сколько байтов имеет формат 
IP – адреса (сетевого адреса)? 4 
Что означают старшие 3 
байта МАС – адреса? 
идентификатор фирмы 
производителя 
Что означают младшие 3 
байта МАС – адреса? уникальный номер устройства 
Из каких двух частей состоит 
IP-адрес? номера сети и номера узла 
К частям какого уровня 
адреса сети TCP/IP относятся: 
имя машины, имя 
организации, имя домена? 
символьный (DNS-имя) 
На какие две модели можно 
разделить модель OSI: 
горизонтальную модель на базе 
протоколов и вертикальную 
модель на основе услуг 
Какой организацией была 
разработана базовая модель 
связи открытых систем OSI? 
ISO (International Standardization 
Organization) 
Это спецификации, которые 
определяют стандарты для 
физических компонентов 
сети - 
комитеты IEEE 802.xx 
Это единица информации, 
передаваемая между 
станциями сети - 
пакет (packet) 
Какой кабель, в котором 
изолированная пара 
проводников скручена с 
небольшим числом витков на 
единицу длины? 
неэкранированная витая пара 
(UTP, unshielded twisted pair) 
Какой кабель имеет толщину 
12 мм и бывает двух 
разновидностей: гибкий и 
жесткий. Он имеет большую 
степень 
помехозащищенности, 
большую механическую 
прочность, а также позволяет 
подключать новый 
компьютер к кабелю, не 
останавливая работу сети - 
толстый коаксиальный кабель 
(RG-8 и RG-11) 
В этом кабеле используются 
более широкие внутренние 
сердечники, которые легче 
изготовить технологически. В 
кабелях во внутреннем 
проводнике одновременно 
существует несколько 
световых лучей, 
отражающихся от внешнего 
проводника под разными 
углами. В качестве 
источников излучения в 
кабелях применяются 
светодиоды - 
многомодовый оптоволоконный 
кабель (Multi Mode Fiber, MMF) 
Укажите вариант, где 
перечислен полный перечень 
основных видов топологий: 
общая шина (Bus); кольцо 
(Ring); звезда (Star); древовидная 
(Tree); ячеистая (Mesh) 
На чем строились системы 
пакетной обработки в 
прошлом веке 
мэйнфрейм 
Выберите неверный ответ:  в 
многотерминальных системах 
разделения времени - 
все функции стали 
распределенными 
Какие из перечисленных 
сетей хронологически 
появились первыми? 
глобальные вычислительные 
сети 
Многотерминальные 
системы, работающие в 
режиме разделения времени 
стали первым шагом на пути 
создания … 
локальных вычислительных 
сетей 
В каких сетях из 
перечисленных были впервые 
предложены и отработаны 
основные идеи и концепции 
современных 
вычислительных сетей? 
глобальные сети 
Что из перечисленного стало 
реальным конкурентом 
мэйнфреймов? 
мини-ЭВМ 
В каком году появилась 
первая сеть ARPANET? 1969 
Что из перечисленного 
заменило в сетях мини-ЭВМ 
и мэйнфреймы? 
персональные компьютеры 
Что такое компьютерная 
сеть? 
система компьютеров связанная 
каналами передачи информации 
Что из перечисленного 
является компонентом 
компьютерной сети? 
все ответы верны 
Выделенный сервер – это 
компьютер, служащий только 
для обслуживания клиентских 
машин 
Сервер – это 
компьютер или программа, 
предоставляющая некоторые 
услуги 
Клиент - это компьютер или программа, 
запрашивающая услуги 
Найдите правильное 
определение: протокол 
определяет 
все ответы верны 
Как классифицируются 
компьютерные сети? все ответы верны 
По протяженности 
компьютерные сети делят на все ответы верны 
Технология Ethernet 
определяется стандартом 
ІЕЕЕ: 
802.3 
Технология Wi-Fi 
определяется стандартом 
ІЕЕЕ: 
 802.11 
Компьютеры, входящие в 
сеть,  могут совместно 
использовать: 
все ответы верны 
Протокол – это стандарт передачи данных через 
компьютерную сеть 
Что из перечисленного 
принимает и отправляет 
трафик пользователя: 
узел 
Что из перчисленного 
осуществляет связь между 
другими устройствами: 
сетевые устройства 
Что из перечисленного 
обеспечивает соединение 
узлов и сетевых устройств? 
сетевая среда 
Топология сети, в которой 
каждый узел более высокого 
уровня связан с узлами более 
низкого уровня: 
дерево 
В активных деревьях в 
качестве узлов используются - 
компьютеры 
В пассивных деревьях в 
качестве узлов используются - 
 коммутаторы 
Топология компьютерной 
сети, в которой все 
компьютеры сети 
присоединены к центальному 
узлу, образуя физический 
сегмент сети: 
звезда 
Топология, в которой данные 
могут передаваться лишь в 
одном направлении, от 
одного компьютера к 
другому – соседнему, 
называется: 
кольцо 
Топология, при которой к 
общему кабелю подключены 
все компьютеры - 
 общая шина 
Топология, в которой каждый 
компьютер соединен линиями 
связи только с двумя 
другими: от одного он 
получает информацию, а 
другому только передает - 
кольцо 
Топология, в которой узлы 
образуют многомерную 
решетку, называется 
тор 
Это тип сетевой топологии, в 
которой рабочие станции 
расположены вдоль одного 
участка кабеля, называемого 
магистралью (сегментом) - 
общая шина (Bus) 
Это топология ЛВС, в 
которой все рабочие станции 
присоединены к 
центральному узлу, который 
устанавливает, поддерживает 
и разрывает связи между 
рабочими станциями: 
звезда (Star) 
Это топология ЛВС, в 
которой каждая станция 
соединена с двумя другими 
станциями, образуя 
кругооборот: 
кольцо (Ring) 
Это топология, в которой 
граф линий связи образует 
прямоугольную сетку 
(обычно двух- или трех
мерную): 
ячеистая (Mesh) 
Компьютер, к которому 
осуществляют доступ 
пользователи, для того чтобы 
использовать программы, 
данные или периферийные 
устройства называется -  
сервером 
Какой вид сервера управляет 
электронными сообщениями? Mailserver (почтовый сервер) 
Совместное использование 
принтера, графопостроителя 
или способность цифровой 
серверной печати относятся к 
базовой функциональности 
какого сервера? 
Printserver (сервер печати) 
Комплекс мероприятий, 
проводимых с целью 
предотвращения утечки, 
хищения, утраты, 
несанкционированного 
уничтожения, искажения, 
модификации (подделки), 
несанкционированного 
копирования, блокирования 
информации называется - 
защитой информации 
 … - это объект сети, 
генерирующий данные или 
потребляющий данные сети. 
абонент сети 
… - канал связи 
осуществляемый 
электрическими, радио или 
другими сигналами. 
физическая среда передачи 
В модели OSI первым 
уровнем является: физический 
В каком году был утвержден 
стандарт модели OSI? 1984 
Сколько уровней имее 
модель OSI? 7 
Какой уровень в модели OSI 
описывает принципы 
передачи сигналов, скорость 
передачи, спецификации 
каналов связи? 
физический 
Какой уровень в модели OSI 
проверяет доступность среды 
передачи, обнаруживает и 
исправляет ошибки, 
возникающие в процессе 
передачи? 
канальный 
Какой уровень в модели OSI 
обеспечивает соединение 
сетей? 
сетевой 
Какой уровень в модели OSI 
решает задачу передачи 
сообщений в составной сети с 
помощью подтверждения 
доставки и повторной 
отправки пакетов? 
транспортный 
Какой уровень в модели OSI 
позволяет запоминать 
информацию о текущем 
состоянии сеанса связи? 
сеансовый 
Какой уровень в модели OSI 
обеспечивает преобразование 
передаваемой информации из 
одной кодировки в другую? 
уровень представления 
Какой уровень в модели OSI 
реализует интерфейс между 
остальными уровнями модели 
и пользовательскими 
приложениями? 
прикладной уровень 
На каком уровне модели  OSI 
передаются биты? физический 
На каком уровне модели  OSI 
передаются кадры? канальный 
На каком уровне модели  OSI 
передаются пакеты? сетевой 
На каком уровне модели  OSI 
передаются блоки? транспортный 
На каком уровне модели  OSI 
передаются только данные? сеансовый 
На каком уровне модели  OSI 
передаются только данные? представления 
На каком уровне модели  OSI 
передаются только данные? прикладной 
Модем - это устройство для передачи информации по 
телефонным каналам связи 
Сколько уровней имеет стек 
протоколов TCP/IP? 4 
Электронная почта позволяет 
передавать: 
сообщения и приложенные к 
нему файлы 
Сервер - это 
мощный компьютер, к которому 
подключаются остальные 
компьютеры 
По способу соединения 
элементов сети 
классифицируются на: 
шина, кольцо, звезда 
По способу управления сети 
классифицируются на: 
централизованные и 
децентрализованные 
Как называется компьютер, 
независимо подключенный к 
сети Интернет? 
host компьютер  
Маршрут – это … процесс определения маршрута 
данных в сетях связи 
… - компьютер или 
программа, которая 
обслуживает другие 
компьютеры или программы. 
сервер 
Как называется узловой 
компьютер в сети? хост  
Сетевой адаптер - это: 
специальное аппаратное 
средство для эффективного 
взаимодействия персональных 
компьютеров сети 
Для соединения компьютеров 
в сетях используются кабели 
различных типов. По какому 
кабелю передаётся 
информация, закодированная 
в пучке света? 
 оптиковолоконный 
Какому уровню модели OSI 
принадлежит протокол IP?  сетевой 
Какому уровню модели OSI 
принадлежит протокол 
ICMP?  
сетевой 
Какому уровню модели OSI 
принадлежит протокол RIP?  сетевой 
Какому уровню модели OSI 
принадлежит протокол 
OSPF?  
сетевой 
Какому уровню модели OSI 
принадлежит протокол ARP?  сетевой 
Какому уровню  в модели 
OSI принадлежит протокол 
TCP?  
4 
Какому уровню  в модели 
OSI принадлежит протокол 
UDP?    
4 
К какому уровню в модели 
TCP/IP принадлежит 
протокол TCP? 
3 
К какому уровню в модели 
TCP/IP принадлежит 
протокол UDP? 
3 
Какой уровень в модели 
TCP/IP является самым 
нижним? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP является самым 
верхним? 
прикладной 
Какой уровень в модели 
TCP/IP соответствует 
физическому и канальному 
уровням модели OSI? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP занимается передачей 
дейтаграмм с использованием 
различных сетей? 
межсетевой уровень 
В качестве основного 
протокола межсетевого 
уровня в стеке протоколов 
TCP/IP используется 
протокол: 
IP 
На каком уровне стека 
протоколов TCP/IP работает 
протокол RIP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол OSPF? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол IP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол ICMP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол ARP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол SNMP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол FTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол Telnet? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол SMTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол TFTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
Ethernet? 
уровень доступа к среде 
передачи 
На каком уровне стека 
протоколов TCP/IP работает 
Token Ring? 
уровень доступа к среде 
передачи 
На каком уровне стека 
протоколов TCP/IP работает 
FDDI? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP обеспечивает 
доставку данных между 
двумя прикладными 
процессами? 
транспортный 
На каком уровне стека 
протоколов TCP/IP работает 
протокол TCP? 
транспортный 
На каком уровне стека 
протоколов TCP/IP работает 
протокол UDP? 
транспортный 
Протоколом для передачи 
файлов является: FTP 
Основным протоколом при 
пользовании услуг WWW 
является: 
HTTP 
Компьютер, подключенный к 
сети Internet, обязательно 
имеет - 
IP-адрес 
Какой протокол контроля 
передачи используется тогда, 
когда требуется надежная 
доставка сообщений? 
 TCP 
Какой адрес имеет 
компьютер, постоянно 
подключенный к Интернету? 
IP 
… - устаревший сетевой 
протокол канального уровня 
эталонной сетевой модели 
OSI для доступа к сетям стека 
TCP/IP через 
низкоскоростные линии связи 
путём простой инкапсуляции 
IP-пакетов. 
SLIP 
Какой протокол используется 
в настоящее время вместо 
протокола SLIP? 
PPP 
… – это набор правил, в 
соответствии с которым 
компьютеры обмениваются 
протокол 
информацией. 
Службу, какого ресурса 
использует компьютер
клиент? 
сервера 
Локальная сеть – это … 
небольшая компьютерная сеть в 
пределах одного помещения или 
предприятия 
LAN — это: 
сети компьютеров, размещенные 
на небольшой территории и 
использующие для связи 
высококачественные линии 
связи 
Какой кабель в основном 
используется для соединения 
компьютеров в локальной 
сети? 
витая пара 
Максимальная скорость 
передачи информации в 
компьютерной локальной 
сети (на основе кабеля витая 
пара) может достигать: 
100 Мбит/с 
Понятие, которое определяет 
обмен в сети, поток 
информации - 
траффик 
Комплекс аппаратных и 
программных средств, 
позволяющих компьютерам 
обмениваться данными - это: 
компьютерная сеть 
Протокол – это: специальное техническое 
соглашения для работы в сети 
Провайдер – это: 
владелец узла сети, с которым 
заключается договор на 
подключение к его узлу 
Коммуникационный 
протокол, описывающий 
формат пакета данных 
называется: 
IP 
Сетевое устройство, 
предназначенное для 
преобразования сферы 
одного вида протокола в 
другую сферу - 
шлюз 
Proxy – это … система для подключения  
компьютера к Интернету  
Выберите правильный 
вариант, где перечислены 
стандартные стеки 
коммуникационных  
протоколов: 
TCP/IP, IPX/SPX, NetBIOS/SMB, 
DECnet, SNA, OSI 
Где и когда был разработан 
проект компьютерной сети 
ARPANET? 
1968 год, США  
Какие протоколы считаются 
распространенными в стеке 
OSI?  
прикладные протоколы 
В каком году был принят 
открытый стандарт 
локальной сети Ethernet 
фирмами Xerox, Intel и Dec? 
1980 году 
Маршрутизация это… 
это процесс передачи данных с 
одного ПК на другой ПК, когда 
эти ПК находятся в разных 
сетях; 
В компьютерной сети 
Интернет транспортный 
протокол ТСР обеспечивает: 
способ передачи информации по 
заданному адресу 
Сетевой шлюз это: 
 аппаратный маршрутизатор или 
программное обеспечение для 
сопряжения компьютерных 
сетей, использующих разные 
протоколы 
Коммутация – это: 
 процесс соединения абонентов 
коммуникационной сети через 
транзитные узлы 
Информация в 
компьютерных сетях 
передается по каналам связи 
в виде отдельных: 
пакетов 
Коммутация пакетов это: 
техника коммутации абонентов, 
которая была специально 
разработана для эффективной 
передачи компьютерного 
трафика 
Какое из устройств служит 
для соединения между собой 
нескольких различных узлов 
компьютерной сети и обмена 
данными между ними, при 
этом имеет один  сетевой 
интерфейс: 
коммутатор 
Концентратор – это устройство для организации 
работы локальной сети 
Обмен информацией между 
компьютерными сетями, в 
которых действуют разные 
сетевые протоколы, 
осуществляется с 
использованием: 
шлюзов 
Свитч - это коммутатор 
Маршрутизатор – это роутер 
 Скорость передачи данных в 
сети, которую могут 
обеспечить коммутаторы в 
зависимости от модели: 
100 Мбит/сек 
Скорость передачи данных в 
сети, которую может 
обеспечить Fast Ethernet: 
100 Мбит/сек 
Скорость передачи данных в 
сети, которую может 
обеспечить Gigabit Ethernet: 
1000 Мбит/сек 
Для подключения к 
маршрутизаторам, 
коммутаторам, сетевым 
картам на концах витой пары 
используются: 
все перечисленные коннекторы 
 … - это совокупность 
объектов, образуемых 
устройствами передачи и 
обработки данных 
сеть 
…-  целесообразное 
преобразование формы 
подтвержденных данных их 
передача, хранение и 
обработка.  
кодирование  
Какой уровень модели OSI 
предназначен для сопряжения 
с физическими средствами 
соединения? 
физический 
Какой уровень модели OSI 
обеспечивает создание, 
передачу и прием кадров 
данных? 
канальный 
Функции сетевого уровня 
модели OSI -  
устанавливает связь в 
вычислительной сети между 
двумя системами и обеспечивает 
прокладку виртуальных каналов 
между ними 
Какой уровень модели OSI 
определяет адресацию 
физических устройств 
(систем, их частей) в сети? 
транспортный 
Какой уровень модели OSI 
обеспечивает управление 
диалогом для того, чтобы 
фиксировать, какая из сторон 
является активной в 
настоящий момент, а также 
предоставляет средства 
сеансовый 
синхронизации? 
Какой уровень модели OSI 
обеспечивает прикладным 
процессам средства доступа к 
области взаимодействия? 
представительский 
Какие функции выполняет 
прикладной уровень?  
обеспечивает удобный 
интерфейс для пользователя 
…- протокол организации 
управления сети. SNMP 
Система уплотнения 
оптического кабеля имеет 
название - 
DWDM 
Сети, которые охватывают 
значительную 
географическую область, 
страну, континент: 
WAN 
Что представляют из себя 
линии связи: все перечисленные 
Какие сети имеют как 
принадлежность, так и 
управление ко многим 
различным организациям: 
WAN 
Муниципальные сети 
объединяют компьютеры в 
пределах - 
города 
Какие из приведенных 
технологий относятся к 
технологиям глобальной 
сети? 
ATM, TCP/IP 
Спецификации, каких 
комитетов института IEEE 
появились в 1980 году? 
802 
Какой фирмой и в каком году 
построена экспериментальная 
сеть Ethernet Network?  
Xerox, 1975 год 
Какой подуровень 
обеспечивает обслуживание 
сетевого уровня и связан с 
передачей и приемом 
пользовательских 
сообщений? 
LLC 
Укажите диаметр 
коаксиального кабеля 10Base
5: 
0,5 дюйм 
Система кабельного 
телевидения относится к 
сетям: 
MAN 
Стандарт IEEE 802.16 – 
WiMax относится к сетям  MAN 
Потенциально достижимая 
скорость волоконно
оптических линий связи 
составляет: 
10 Гбит/сек 
Локальные сети объединяют 
компьютеры  пределах: организации 
В каких из перечисленных 
видов сетей маршрутизаторы 
соединяют различные виды 
сетевых технологий? 
WAN 
Как называется оператор 
подсети, соединяющий с 
другими сетями и 
Интернетом? 
провайдер 
Укажите максимальную 
пропускную способность 
коаксиального кабеля 10Base
5: 
500 м 
Укажите диаметр 
коаксиального кабеля 10Base
2:  
0,25 дюйм 
Укажите максимальную 
пропускную способность 
коаксиального кабеля 10Base
2: 
185 м 
Укажите максимальную 
пропускную способность 
оптоволоконного кабеля 
10Base-FB: 
2000 м 
Каким институтом, и в каком 
году была предложена 
технология FDDI? 
институт ANSI, 1986 г. 
Какое поколение мобильных 
сетей осуществляло только 
аналоговую передачу звука? 
1 
Какое поколение мобильных 
сетей было цифровым и 
передавало только голос? 
2 
Какое поколение мобильных 
сетей было цифровым и 
передавало речь и данные? 
3 
Какое разделение каналов 
применяется в 3G? кодовое 
Какое устройство выполняет 
функции физического и 
канального уровня? 
сетевой адаптер 
Укажите максимальное 
расстояние технологии 
Bluetooth: 
 100 м 
Укажите максимальную 
скорость технологии 
Bluetooth: 
721 Мбит/с 
… - это система протоколов 
беспроводной связи. WAP 
Максимальное число 
подключаемых компьютеров 
технологии Wi-Fi: 
50 
Как называются компьютеры 
подключенные к локальной 
сети?  
станциями 
Одним из важнейших 
трендов развития отрасли 
мобильной связи является 
такое понятие, как «Интернет 
вещей». Что это? 
взаимодействие типа 
«устройство – устройство» (без 
участия человека) 
Как расшифровывается WiFi? Wireless Fidelity 
К какому поколению 
мобильной связи относится 
GSM? 
2G 
Скорость передачи данных в 
локальной сети на основе 
коаксиального кабеля не 
превышает: 
10 Мбит/сек 
Как расшифровывается LTE?  Long Term Evolution 
Какой канал передачи 
информации, как правило, 
используют для соединения 
двух серверов? 
оптоволокно 
Какой тип данных передается 
на физическом уровне? биты 
Что означает «G» в 
аббревиатурах: 1G, 2G, 3G, 
4G? 
Generation 
Какой из способов 
подключения к Интернету 
обеспечивает наибольшие 
возможности для доступа к 
информационным ресурсам? 
постоянное соединение по 
оптоволоконному каналу 
 IP адрес нужен для: для всех перечисленных 
действий 
Данные, передаваемые с 
использованием протокола 
IP, помещаются в сообщение, 
называемое 
пакетом 
Глобальная компьютерная 
сеть - это: 
 совокупность локальных сетей и 
компьютеров, расположенных на 
больших расстояниях и 
соединенных с помощью 
каналов связи в единую систему 
Гиперссылки на Web
странице могут обеспечивать 
переход: 
на любую Web-страницу любого 
Web-сервера 
Что не содержит заголовка 
пакета IPv6: данные контрольной суммы 
Адрес IPv4 содержит 4 байта 
Адрес IPv6 содержит 16 байт 
Максимальное значение 
октета IP адреса в двоичной 
системе счисления: 
11111111 
Максимальное значение 
октета IP адреса в десятичной 
системе счисления: 
255 
Структура IP адреса 
представляет собой: 
двухуровневую иерархическую 
модель 
Причина создания IPv6: нехватка адресного пространства 
Индивидуальная адресация 
называется: unicast 
Групповая адресация 
называется: multicast 
Широковещательная 
адресация называется: broadcast 
Выберите адресное 
пространство частных IPv4 
адресов класса А: 
10.0.0.0 – 10.255.255.255 
Выберите адресное 
пространство частных IPv4 
адресов класса В: 
172.16.0.0 – 172.31.255.255 
Выберите адресное 
пространство частных IPv4 
адресов класса С: 
192.168.0.0 – 192.168.255.255 
Домен-это... 
часть адреса, определяющая 
адрес компьютера пользователя 
в сети 
Какой из перечисленных 
протоколов не является 
дистанционно-векторным? 
OSPF 
Протокол RIP является 
протоколом дистанционно-векторным 
Протокол OSPF является 
протоколом состояния каналов связи 
На каком уровне модели OSI 
используются MAC-адреса? канальном 
На каком уровне модели OSI 
передаются датаграммы? транспортный 
Какой из перечисленных 
MAC-адресов является 
индивидуальным? 
30-9С-23-15-Е8-8С 
Какой из перечисленных 
MAC-адресов является 
групповым? 
01-80-С2-00-00-08 
Какой из перечисленных 
MAC-адресов является 
широковещательным? 
 FF-FF-FF-FF-FF-FF 
Признаком группового MAC
адреса является равенство 
первого бита старшего байта 
1 
Централизованно MAC-адрес 
назначается  производителем 
Локально MAC-адрес 
назначается администратором сети 
Если MAC-адрес назначен 
централизованно, то 
индикатор способа 
назначения (второй бит 
старшего байта) равен 
0 
 Если MAC-адрес назначен 
локально, то индикатор 
способа назначения (второй 
бит старшего байта) равен 
1 
Сетевым узлом является:  
любое устройство, которое 
принимает и затем передает что
то через сеть, но вместо этого 
может просто получать и 
хранить данные, передавать 
информацию в другом месте или 
создавать и отправлять данные 
Пропускная способность — 
это 
метрическая характеристика, 
показывающая соотношение 
предельного количества 
проходящих единиц в единицу 
времени через канал, систему, 
узел 
Какая организация 
стандартов создала 
эталонную модель 
взаимодействия открытых 
систем? 
ISO  
Какая максимальная скорость 
передачи данных в сети Fast 
Ethernet? 
100 Мбит/с 
Какой формулой 
определяется максимальная  
пропускная способность 
каналов связи? 
Формула Шеннона 
В каком году началась 
разработка нового поколения 
мобильной связи 5G? 
2015 
Что из перечисленного 
является технологией 
пассивных оптических сетей? 
PON 
Найдите преимущества 
технологии PON: 
вес перечисленные 
преимущества 
Какая из перечисленных 
технологий является 
асимметричной? 
ADSL 
Какая из перечисленных 
технологий является 
симметричной? 
SDSL 
Какая из перечисленных 
технологий является 
однонаправленной? 
UDSL 
Какой тип кабеля из 
перечисленных используется  
в кабельных сетях: 
все перечисленные типы 
Какие требования 
предъявляются к 
транспортным сетям? 
все перечисленные требования 
На основе каких технологий 
строится современная 
транспортная сеть: 
на основе всех перечисленных 
технологий 
В основе какого стандарта 
лежит технология 
множественного доступа с 
кодовым разделением 
каналов: 
на основе всех перечисленных 
стандартов 
В чем назначение программы 
Cisco Packet Tracer? эмуляция модели OSI  
Что такое Cisco и каковы ее 
задачи? 
 компания Cisco является 
разработчиком и 
производителем сетевого 
оборудования   
Какая из перечисленных 
программ не является 
эмулятором сетевой среды? 
 LAN Calculator  
Какие устройства служат для 
поиска оптимального 
маршрута передачи данных 
на основании алгоритмов 
маршрутизации? 
маршрутизаторы   
Какую линию связи следует 
выбрать для связи между 
кабельным модемом и 
облаком? 
коаксиальный кабель   
Какой тип кабеля следует 
использовать при соединении 
роутеров между собой? 
 медный кроссовер   
Какой тип шифрования 
предоставляет наиболее 
высокую защиту 
беспроводной сети? 
 WPA2 
Когда была запущена первая 
сеть UMTS: 2001 
К какому поколению 
мобильной связи относится 
стандарт UMTS: 
3 
К какому поколению 
мобильной связи относится 
стандарт LTE: 
4 
К какому поколению 
мобильной связи относится 
стандарт WiMAX: 
4 
К какому классу стандартов 
относится стандарт WiMAX: MAN 
Какая из перечисленных 
технологий работает в 
состоянии, когда разные 
части сети почти, но не 
совсем синхронизированы: 
PDH 
В чем отличие режима 
реального времени от режима 
симуляции сети в программе 
Cisco Packet Tracer? 
в режиме симуляции можно 
имитировать сетевые события 
В чем главное назначение 
протокола ICMP? 
ICMP используется для передачи 
сообщений об ошибках и других 
исключительных ситуациях, 
возникших при передаче данных 
В чем назначение команды 
Ping? 
это команда для проверки 
соединений в сетях на основе 
TCP/IP 
В каком режиме пользователь 
в программе Cisco Packet 
Tracer может посмотреть 
структуру пакета? 
в режиме симуляции 
В каком из утверждений, 
верно описан принцип 
работы хаба? 
хаб повторяет пакет на всех 
портах надеясь, что на одном из 
них есть получатель 
информации 
В технологии PDH в качестве 
входного используется 
сигнал основного цифрового 
канала, а на выходе 
формируется поток данных 
со скоростями: 
n * 64 кбит/с 
Где широко используется 
синхронная оптическая сеть 
SONET? 
в США 
Найдите отличительную 
особенность технологии 
DWDM: 
всё перечисленное 
Какая система счисления 
используется в MAC-адресах: шестнадцатеричная (16) 
Найдите неверное 
утверждение: 
режим моделирования 
(симуляции) позволяет 
просматривать и изменять 
записи в кэш ARP 
Как называется топология, в 
которой все компьютеры сети 
присоединены к 
центральному узлу, образуя 
физический сегмент сети: 
звезда 
Что не может выступать в 
роли центрального узла 
звезды? 
роутер 
Какое устройство подает 
пакет на все порты? концентратор 
В какой топологии выход из 
строя одной рабочей станции 
не отражается на работе всей 
сети в целом? 
звезда 
Основной принцип 
технологии «клиент-сервер»: все перечисленные принципы 
Для работы технологии 
DWDM необходим: все перечисленные устройства 
Назовите компонент сетевого 
приложения: все перечисленные компоненты 
Сеть, в которой каждый 
компьютер может быть 
администратором и 
пользователем одновременно, 
называется: 
одноранговой сетью 
Назовите преимущество 
одноранговых сетей: 
все перечисленные 
преимущества 
Какой из перечисленных 
недостатков присущ для 
одноранговых сетей: 
все перечисленные недостатки 
Сколько компьютеров может 
быть в одноранговой сети?  11 
Управление доступом на 
уровне ресурсов существует: в одноранговых сетях 
Управление на уровне 
пользователей существует в архитектуре клиент/сервер 
Какой вид сервера 
используется в локальных 
сетях? 
все перечисленные виды 
серверов 
Какой вид сервера 
используется в глобальных 
сетях? 
все перечисленные виды 
серверов 
На каком уровне модели OSI 
работает хаб, который 
отправляет 
широковещательный запрос? 
 1-й уровень OSI 
Что такое PDU? 
обобщённое название фрагмента 
данных на разных уровнях 
модели OSI: 
С какой целью (для чего) 
была разработана модель 
OSI? 
 модель OSI моделирует работу 
любой (локальной и глобальной) 
сети 
Каким инструментом можно 
создавать надписи на схеме 
сети в программе Cisco Packet 
Tracer? 
Place Note 
На каком уровне модели OSI 
работает Switch? 2-й уровень OSI 
Какой протокол используется 
для получения IP адреса по 
имени определенного хоста? 
DNS 
Для чего используется DNS 
протокол? 
для всех перечисленных 
действий 
В каком году был разработан 
протокол DNS? 1983 
Какая из перечисленных 
функций характеризует 
протокол DNS? 
все перечисленные функции 
Для доступа к Web-серверу 
необходимо знать: IP адрес 
Что из перечисленного 
является функцией протокола 
DNS: 
все перечисленные функции 
Какой порт использует 
протокол DNS? 53 
Сколько символов 
используют домены стран 
(верхний уровень)? 
2 
Какой домен верхнего уровня 
в Internet имеет Россия: ru 
Какой протокол совершает 
обмен управляющими 
сообщениями: 
ICMP 
Какой из перечисленных 
протоколах является 
протоколом сообщения об 
ошибках: 
ICMP 
Какой из перечисленных 
протоколов является простым 
протоколом сетевого 
управления, стандартным 
Интернет-протоколом для 
управления устройствами в IP 
сетях на основе архитектур 
TCP/UDP: 
SNMP 
Какой из перечисленных 
компонентов есть в сети, 
использующей протокол 
SNMP для управления: 
все перечисленные компоненты 
На каком уровне модели OSI 
работает Router?  3-й уровень OSI 
В каких единицах измеряется 
скорость порта FastEthernet? Мбит/сек 
Какая вкладкав программе 
Cisco Packet Tracer служит 
для отображения внешнего 
вида коммутатора модели 
2960? 
Physical 
Какой принцип заложен при 
исследовании качества 
передачи трафика по сети 
(при исследование 
пропускной способности 
ЛВС)? 
увеличение размера пакета и 
отправка запросов с коротким 
интервалом времени, не ожидая 
ответа от удаленного узла, для 
того, чтобы создать небольшую 
нагрузку на сеть 
Наличие этого параметра не 
позволяет пакету бесконечно 
ходить по сети: 
 TTL 
Какую команду распознаёт 
IOS при наборе символов 
“en”? 
enable 
Для чего предназначены 
access порты? для подключения пользователей 
Рассмотрите перечисленые 
основные режимы 
конфигурации при настройке 
коммутатора. В каком ответе 
ошибка? 
 административный 
Что такое CLI в программе 
Cisco Packet Tracer, как и 
зачем используется? 
CLI – командная строка, 
используется для 
программирования устройств 
Cisco 
Как называется сеть, 
использующая в своем 
составе множество датчиков: 
сенсорная сеть 
Назовите основную 
особенность беспроводной 
сенсорной сети: 
все перечисленные особенности 
Какие преимущества имеет 
технология сенсорных сетей 
перед другими 
беспроводными и 
проводными системами: 
 все перечисленные 
преимущества 
Каждый узел сенсорной сети 
содержит: всё перечисленное 
Сенсорные сети строятся на 
технологии: ZigBee 
Какой уровень не связан с 
топологией? транспортный 
Какой из блоков данных по 
объему больше: сегмент 
К какому протоколу 
относятся  пакеты данных? IP 
Найдите неверный ответ: Для 
чего создаются виртуальные 
локальные сети (VLAN)? 
для объединения сетей 
различных топологий 
Что определяет команда 
Router1(config)#enable 
password parol? 
 пароль на привилегированный 
режим 
Какие алгоритмы 
используются для 
формирования таблиц 
маршрутизации? 
все перечисленные алгоритмы 
В каком типе алгоритма 
администратор сети сам 
решает, на какие 
маршрутизаторы передать 
пакеты и заносит 
соответствующие записи в 
таблицу маршрутизации 
вручную: 
фиксированной (статической) 
маршрутизации 
В каком типе алгоритма 
таблица маршрутизации или 
не используется или строится 
без участия протокола 
маршрутизации? 
простой маршрутизации 
В каком типе алгоритма 
обеспечивается 
автоматическое обновление 
таблиц маршрутизации после 
изменения конфигурации 
сети? 
адаптивной (динамической) 
маршрутизации 
Какие действия следует 
выполнить для того, чтобы 
проверить работоспособность 
Cisco HTML сервера? 
открываем клиентскую машину 
и на вкладке Desktop запускаем 
приложение Web Browser. После 
чего набираем IP адрес нашего 
WEB-сервера и нажимаем на 
кнопку GO 
Перед вами четыре октета: 
255.0.0.0. Что это может 
быть? 
 маска подсети 
Какие параметры сервер 
DHCP не предоставляет 
клиентам? 
 MAC адрес 
Какой протокол следит за 
тем, чтобы в сети не было 
повторения IP адресов? 
 ARP 
Для чего предназначена 
команда show ip route? 
для проверки таблицы 
маршрутизации роутера 
Траффик наиболее 
критический к задержкам, это - 
голосовой в реальном режиме 
Выберите основной принцип 
сетевой безопасности все перечисленные принципы 
Какое устройство, 
подключенное к компьютеру, 
обеспечивает 
информационную 
безопасность пользователя и 
дает разрешение для его 
работы? 
все перечисленные устройства 
Как обеспечивается защита 
от несанкционированного 
доступа? 
всеми перечисленными 
способами 
Как называется изменение 
MAC-адреса на программном 
уровне: 
MAC-spoofing 
Что значит CSMA/CD? 
множественный доступ с 
прослушиванием несущей и 
обнаружением коллизий  
Что значит CSMA/CA? 
множественный доступ с 
прослушиванием несущей и 
избежанием коллизий 
Коллизия  иначе это - столкновение
К какому виду физической 
среды передачи данных 
относятся радиоканалы, 
лазерные и инфракрасные 
каналы? 
к беспроводному 
Для соединения типа: 
«компьютер-компьютер», 
«коммутатор-коммутатор» 
используется 
перекрестный кабель 
Что означает сообщение 
DHCPDISCOVER? 
нахождение доступных DHCP
серверов  
Нахождение доступных 
DHCP-серверов 
соответствует сообщению: 
DHCPDISCOVER 
Чему равна длина MAC 
адреса: 48 бит 
Предложение DHCP 
соответствует сообщению: DHCPOFFER 
Запрос DHCP соответствует 
сообщению: DHCPREQUEST 
Подтверждение DHCP 
соответствует сообщению: DHCPACT 
Что означает сообщение 
DHCPOFFER? предложение DHCP 
Что означает сообщение 
DHCPREQUEST? запрос DHCP 
Что означает сообщение 
DHCPACT? подтверждение DHCP 
Передача системе 
идентифицирующего 
признака пользователя 
называется: 
идентификация 
Сравнение 
идентифицирующего 
признака пользователя 
называется: 
аутентификация 
Для соединения типа 
«компьютер-коммутатор», 
«коммутатор- 
маршрутизатор» 
используется 
прямой кабель 
Какой командой открывается 
глобальный контекст 
конфигурирования в 
программе Cisco Packet 
Tracer? 
сonfig terminal 
Какая команда используется 
для проверки связи между 
устройствами? 
ping 
Команда no shutdown в 
программе Cisco Packet Tracer 
позволяет: 
включить интерфейс 
Команда write memory  в 
программе Cisco Packet Tracer 
позволяет: 
сохранить конфигурацию 
Какая команда устанавливает 
расширенный доступ к 
конфигурации? 
enable 
Графический 
пользовательский интерфейс - 
GUI 
Найдите типовую угрозу 
безопасности информации 
при использовании 
глобальных компьютерных 
сетей 
все перечисленные 
Подмена субъекта или 
объекта сети называется: маскарад 
Внедрение ложного объекта 
сети называется: человек посередине 
Какая причина облегчает 
нарушителю реализацию 
угроз безопасности 
информации в 
распределенных 
компьютерных системах: 
все перечисленные причины 
Что означает понятие 
конвергентных сетей? 
объединение нескольких услуг в 
рамках одной услуги 
Интерфейс командной 
строки, в котором 
инструкции компьютеру 
даются только путём ввода с 
клавиатуры текстовых строк 
(команд): 
CLI 
Средство для создания, 
сохранения и открытия 
средств администрирования 
которые управляют 
оборудованием, 
программными и сетевыми 
компонентами операционной 
системы Windows: 
MMC 
На каком уровне модели OSI 
действуют повторители и 
усилители? 
на физическом уровне 
На каком уровне модели 
действуют  мосты и  
коммутаторы? 
на канальном уровне 
UTP  кабель - это  кабель на основе 
неэкранированной медной пары 
STP кабель - это кабель на основе 
экранированной медной пары 
Для подключения к толстому 
коаксиальному кабелю 
применяют специальное 
устройство –  
трансивер 
Для подключения тонкого 
коаксиального кабеля 
используются: 
BNC-коннекторы 
К телекоммуникационным 
сетям относятся: все перечисленные сети 
 Что такое гетерогенная 
компьютерная сеть? все перечисленные сети 
Что такое гетерогенная 
сетевая архитектура? все перечисленные архитектуры 
Найдите неверный ответ: в 
чем плюсы статической 
маршрутизации? 
хорошее масштабирование, 
динамическое балансирование 
нагрузки 
Для чего служит метрика? 
каждый протокол 
маршрутизации использует свою 
систему оценки маршрутов 
(метрику) 
Как посмотреть, какие 
маршруты получены через 
соответствующий протокол? 
выполнить команду show ip route 
Укажите на ошибку в 
свойствах протокола 
динамической 
маршрутизации EIGRP: 
протокол EIGRP можно 
использовать не только на 
оборудовании компании Cisco, 
но и на любом другом 
В чем заключается 
маршрутизация пакетов в 
сети? 
маршрутизация - процесс 
определения в сети наилучшего 
(оптимального) пути, по 
которому пакет может 
достигнуть адресата 
Перечислите основные 
функции сетевой 
операционной системы: 
все названные функции 
Траффик наиболее 
критический к задержкам, это голосовой в реальном режиме 
Укажите неверную функцию 
сетевой ОС: 
подсчет числа компьютеров в 
сети 
Какая функция сетевой ОС 
заключается в обеспечении 
доступа к данным: 
управление каталогами и 
файлами 
Какая функция сетевой ОС 
включает обслуживание 
запросов на предоставление 
ресурсов, доступных по сети? 
управление ресурсами 
Какая функция сетевой ОС 
обеспечивает адресацию, 
буферизацию выбор 
направления для движения 
данных в разветвленной сети: 
коммуникационные функции  
Что значит отображение в 
сетевых операционных 
системах: 
наличие двух копий данных, на 
разных дисках, подключенных к 
одному контроллеру 
Что значит дублирование в 
сетевых операционных 
системах: 
наличие двух копий данных, на 
разных дисках, подключенных к 
разным контроллерам 
Менеджер в сетевой ОС – это 
программа: 
вырабатывающая сетевые 
команды 
Найдите неправильно 
указанную часть сетевой 
операционной системы 
отдельного компьютера: 
средства исправления сетевых 
ошибок 
Как называется сетевое 
программное обеспечение, 
принимающее запросы 
ввода/вывода для удаленных 
файлов? 
редиректор 
Как называется часть 
программного обеспечения, 
управляющая присвоением 
букв накопителя сетевым 
ресурсам? 
распределитель 
Сети с выделенными 
серверами называют: двухранговыми сетями 
Компьютер, работающий в 
сети, может выполнять 
функции: 
все перечисленные функции 
Хост – это: все перечисленные устройства 
Выберите неверное 
утверждение: 
 ограничение в числе хопов не 
дает применять RIP в небольших 
сетях 
При помощи какой команды 
в программе Cisco Packet 
Tracer можно проверить, что 
маршрутизатор видит все 
присоединённые к нему сети? 
show ip route 
Сетевое устройство, 
служащее для объединения 
отдельных участков единой 
компьютерной сети и не 
преобразующее информацию 
называется: 
HAB 
Сетевое устройство, 
служащее для определения 
маршрута, по которому 
наиболее целесообразно 
передавать пакеты 
информации, называется: 
ROUTER 
Сетевые устройства, 
служащие для объединения в 
единую сеть нескольких 
компьютерных сетей 
различных типов, а также для 
снижения нагрузки в сети 
называют: 
BRIDGE 
Сетевые устройства, 
служащие для объединения 
отдельных сетей с 
различными протоколами 
обмена называют: 
GATEWAY 
Средой передачи является: все перечисленные линии и 
каналы 
Какое преимущество имеют 
современные компьютерные 
сети? 
все перечисленные 
преимущества 
Какой протокол определяет 
форму передачи данных в 
современных компьютерных 
сетях и «нарезает» данные на 
пакеты? 
TCP 
Какой протокол определяет 
направление передачи 
данных по сетевому адресу, 
имеющемуся в каждом 
пакете? 
IP 
Какой протокол называют 
адресным протоколом? IP 
Какой протокол обеспечивает 
идентификацию 
персонального компьютера с 
уникальным сетевым адресом 
и именем? 
DNS 
В чем отличие протоколов 
RIP и OSPF? Найдите ошибку 
в ответах 
конфигурировать протокол RIP 
сложнее, чем OSPF 
Укажите неверное 
утверждение: 
LSA сообщения о состоянии 
каналов отправляются 
протоколом OSPF один раз в 10 
минут 
Кто участвует в решении 
вопросов безопасности сети: 
списки управления доступом 
(ACL) 
Это кабель, в котором 
изолированная пара 
проводников скручена с 
небольшим числом витков на 
единицу длины - 
UTP 
Стандартизацией технологий 
локальных сетей занимается-  IEEE  
Gigabit Ethernet –  
гигабитный Ethernet – локальная 
сеть с пропускной способностью 
1000 Мбит/с 
Какой метод доступа к среде 
передачи используют Fast 
Ethernet и Gigabit Ethernet? 
метод CSMA/CD 
10Base-5, 10Base-2, 10Base
T……. что обозначает число 
10 в вышеуказанных 
названиях: 
битовую скорость передачи 
данных – 10 Мбит/с 
Какой протокол является 
протоколом передачи 
гипертекста? 
HTTP 
Какой протокол обслуживает 
службу WWW (WORD WIDE 
WEB – Всемирная паутина)? 
HTTP 
Какой протокол является 
протоколом передачи 
файлов? 
FTP 
Какой протокол является 
протоколом передачи почты? SMTP 
Назовите неверно указанный 
компонент службы WWW 
(Всемирной паутины): 
WEB-форум 
Назовите особенность 
технологии WWW: все перечисленные особенности 
Для работы службы 
телеконференций USENET 
используется протокол: 
NNTP 
Какое из следующих 
устройств, принимая решение 
о дальнейшем перемещении 
пакета, выходит из 
информации о доступности 
канала и степенях его 
загрузки : 
маршрутизатор 
10Base-5, 10Base-2, 10Base
T……. что обозначает слово 
Base  в вышеуказанных 
метод передачи на одной 
базовой частоте 10 МГц 
названиях? 
Технология Ethernet получила 
свое название благодаря 
своему создателю –  
Роберту Меткалфу 
Продолжите выражение: 
протокол обратного 
преобразования RARP — 
Reverse Address Resolution 
Protocol - 
находит логический адрес (IP
адрес) для компьютера по его 
физическому адресу 
Протокол ARP – Address 
Resolution Protocol:  протокол нахождения адреса 
Какие виды режима 
адресации поддерживает 
протокол IPv4? 
одноадресный, 
широковещательный, 
многоадресный 
Для передачи файлов по сети 
используется протокол…  FTP 
Задан адрес электронной 
почты в сети Интернет: 
fortuna@list.ru. Каково имя 
почтового сервера? 
list.ru 
Выберите корректный IP
адрес компьютера в сети 108.214.198.112 
Определите номер 
компьютера в сети по IP 
215.128.255.106 
106 
Как называется часть 
электронной логической 
схемы, которая реализует 
элементарную логическую 
функцию? 
логический элемент компьютера 
Под термином «интерфейс» 
понимается  - 
внешний вид программной 
среды, служащий для 
обеспечения диалога с 
пользователем 
Протокол TCP/IP является  базовым транспортным сетевым 
протоколом 
Совокупность характеристик 
и параметров, определяющих 
функционально-логическую и  
структурную организацию 
систем – это 
архитектура вычислительной 
системы 
В стеке протоколов TCP/IP  
уровень II …. 
является основным и работает на 
базе протокола управления 
передачей TCP 
Cетевое устройство, 
соединяющее между собой 
сегменты локальной сети: 
мост 
Продолжите выражение: 
протокол коммуникации — 
это  
согласованный набор 
конкретных правил обмена 
информацией между разными 
устройствами передачи данных 
Какие виды узлов сети 
бывают: 
оконечный узел, 
промежуточный узел, смежный 
узел 
На каком уровне эталонной 
модели OSI функционируют 
маршрутизаторы? 
на сетевом уровне 
Архитектура сети — это 
реализованная структура сети 
передачи данных, определяющая 
её топологию, состав устройств 
и правила их взаимодействия в 
сети 
Сетевая архитектура 
высокоскоростной передачи 
данных по оптоволоконным 
линиям: 
FDDI 
При помощи каких 
компонент  сетевые процессы 
могут идентифицировать 
друг друга? 
IP-адрес, протокол (TCP/UDP), 
порт 
UDP –  это 
транспортный протокол, 
передающий сообщения
датаграммы без необходимости 
установки соединения в IP-сети 
TCP –  это 
транспортный протокол 
передачи данных в сетях TCP/IP, 
предварительно 
устанавливающий соединение с 
сетью 
Базовая Система Ввода
Вывода (BIOS) 
предназначена для: 
самодиагностики и 
самотестирования материнской 
платы и устройств 
подключенных к ней 
Что такое быстродействие 
процессора? 
число элементарных операций, 
выполняемых процессором в 
единицу времени 
Основной характеристикой 
компьютерного блока 
питания является: 
мощность 
Время доступа к жёсткому 
диску измеряется в: наносекундах 
Тактовая частота 
указывает … 
сколько элементарных операций 
(тактов) микропроцессор 
выполняет за одну секунду 
Скорость работы компьютера 
зависит от … 
тактовой частоты обработки 
информации в процессоре 
Характеристиками 
оперативной памяти 
являются 
объем, время доступа  
Группа компьютеров, 
объединённых 
высокоскоростными 
каналами связи, 
представляющая с точки 
зрения пользователя единый 
аппаратный ресурс 
называется 
кластером 
Какой из перечисленных 
видов памяти имеет самый 
большой объем? 
внешняя память 
Сервер на котором хранятся 
файлы общего доступа 
называется 
файл-сервер 
Что такое прерывание? 
это временный останов 
выполнения одной программы в 
целях оперативного выполнения 
другой, в данный момент более 
важной 
Правила, по которым 
осуществляется обмен 
информации о путях 
передачи пакетов между 
маршрутизаторами - это 
протоколы маршрутизации 
Утилита ping позволяет:  проверить наличие соединения 
Найдите верное утверждение:  
команда ping все ответы верны 
О переходе в 
привилегированный режим 
будет свидетельствовать 
появление в командной 
строке приглашения в виде 
знака -  
# 
Режим глобального 
конфигурирования — 
реализует мощные 
однострочные команды, которые 
решают задачи 
конфигурирования 
Обобщенная геометрическая 
характеристика 
компьютерной сети – это: 
топология сети 
Протокол компьютерной сети - совокупность: 
правил, регламентирующих 
прием-передачу, активацию 
данных в сети 
Соединение нескольких сетей 
дает: межсетевое объединение 
Поток сетевых сообщений 
определяется: трафиком 
При вводе какого знака в 
командной строке любого 
режима имени команды  на 
экран выводятся 
комментарии к команде? 
? 
Пароль доступа позволяет 
контролировать доступ в 
привилегированный  режим. 
Как правильно установить в 
качестве пароля - cisco? 
Router1(config)#enable password 
cisco 
Какая из команд выведет 
детальную информацию о 
каждом интерфейсе (для 
роутера):   
Router1 show interfaces 
Вид маршрутизации, при 
котором таблица 
маршрутизации заполняется 
и обновляется автоматически 
при помощи одного или 
нескольких протоколов 
маршрутизации - 
динамическая маршрутизация 
Вид маршрутизации, при 
котором таблица 
маршрутизации заполняется 
вручную администратором 
сети - 
статическая маршрутизация 
Маршрутизаторы 
обмениваются друг с другом 
информацией о маршрутах с 
помощью служебных пакетов 
по протоколу - 
UDP 
Протокол с отслеживанием 
состояния каналов - OSPF 
Cisco ASA - 
аппаратный межсетевой экран с 
инспектированием сессий с 
сохранением состояния 
Что используется по 
умолчанию в команде 
Protocol:  
ip 
Какую клавишу следует 
удерживать для того, чтобы 
скопировать ПК несколько 
раз? 
Ctrl  
Для чего служит параметр 
“n” в команде ping –n  
параметр «–n» позволяет задать 
количество передаваемых эхо
запросов 
Какая кнопка позволяет 
отображать моделирование 
всего ping-процесса 
пошагово? 
Capture/Forward 
По виду командной строки 
Router(config-if) определите в 
каком режиме находится 
роутер: 
настройка интерфейсов  
По виду командной строки 
Router определите в каком 
режиме находится роутер: 
 пользовательский  
По виду командной строки 
Router#  определите в каком 
режиме находится роутер: 
привилегированный  
По виду командной строки 
Router(config)# определите в 
каком режиме находится 
роутер: 
глобальная конфигурация  
Что имитирует вкладка CLI? 
имитирует прямое кабельное 
(консольное) подключение к 
сетевому устройству  
Для чего служит транковый 
порт? 
для настройки связи 
коммутаторов, то есть, для 
создания магистрали обмена 
между коммутаторами в VLAN   
Найдите неверные ответ: что 
из себя представляет 
транковый порт? 
транковый порт — это канал для 
соединения ПК и сервера  
Какая из приведенных 
команд зажигает лапочку 
порта? 
no sh 
Для чего предназначена 
служба FIREWALL? 
Firewall выполняет функцию 
защитного барьера между 
компьютером и Интернетом и 
позволяет контролировать весь 
входящий и исходящий трафик   
  
  
  
Савол Тўғри жавоб 
Укажите вариант, где 
перечислены сетевые 
операционные системы? 
Novell Netware, UNIX, Windows 
NT 
Какие уровни модели OSI 
являются сетезависимыми? транспортный и сеансовый 
Какие из характеристик 
являются характеристиками, 
как линии связи, так и 
способа передачи данных? 
пропускная способность и 
достоверность 
На какие виды 
подразделяется кабель на 
основе витых пар? 
зкранированная и 
неэкранированная 
На какие виды 
подразделяется 
оптоволоконный кабель? 
одномодовый и многомодовый 
На какие виды 
подразделяется коаксиальный 
кабель? 
тонкий и толстый 
Способ соединения 
компьютеров сетевыми 
кабелями называется -  
топологией сети 
Укажите правильный вариант 
ответа, где правильно (сверху 
вниз) перечислены уровни 
модели OSI: 
прикладной, представительский, 
сеансовый, транспортный, 
сетевой, канальный,физический 
Какой протокол отвечает за 
адресацию в сети и доставку 
пакетов между 
компьютерами сети, без 
установления соединения и 
гарантий доставки пакета? 
IP 
Эта программа (устройство) 
позволяет выявить в сети 
вредоносное и 
несанкционированное 
программное обеспечение - 
сниффер 
Из скольких, и каких уровней 
адреса состоит каждый 
компьютер в сетях TCP/IP? 
3 уровней: физический (MAC
адрес), сетевой (IP-адрес) и 
символьный (DNS-имя) 
Сколько байтов имеет формат 
физического МАС – адреса 
для всех существующих 
технологий локальных сетей? 
6 
Сколько байтов имеет формат 
IP – адреса (сетевого адреса)? 4 
Что означают старшие 3 
байта МАС – адреса? 
идентификатор фирмы 
производителя 
Что означают младшие 3 
байта МАС – адреса? уникальный номер устройства 
Из каких двух частей состоит 
IP-адрес? номера сети и номера узла 
К частям какого уровня 
адреса сети TCP/IP относятся: 
имя машины, имя 
организации, имя домена? 
символьный (DNS-имя) 
На какие две модели можно 
разделить модель OSI: 
горизонтальную модель на базе 
протоколов и вертикальную 
модель на основе услуг 
Какой организацией была 
разработана базовая модель 
связи открытых систем OSI? 
ISO (International Standardization 
Organization) 
Это спецификации, которые 
определяют стандарты для 
физических компонентов 
сети - 
комитеты IEEE 802.xx 
Это единица информации, 
передаваемая между 
станциями сети - 
пакет (packet) 
Какой кабель, в котором 
изолированная пара 
проводников скручена с 
небольшим числом витков на 
единицу длины? 
неэкранированная витая пара 
(UTP, unshielded twisted pair) 
Какой кабель имеет толщину 
12 мм и бывает двух 
разновидностей: гибкий и 
жесткий. Он имеет большую 
степень 
помехозащищенности, 
большую механическую 
прочность, а также позволяет 
подключать новый 
компьютер к кабелю, не 
останавливая работу сети - 
толстый коаксиальный кабель 
(RG-8 и RG-11) 
В этом кабеле используются 
более широкие внутренние 
сердечники, которые легче 
изготовить технологически. В 
кабелях во внутреннем 
проводнике одновременно 
существует несколько 
световых лучей, 
отражающихся от внешнего 
проводника под разными 
углами. В качестве 
источников излучения в 
кабелях применяются 
светодиоды - 
многомодовый оптоволоконный 
кабель (Multi Mode Fiber, MMF) 
Укажите вариант, где 
перечислен полный перечень 
основных видов топологий: 
общая шина (Bus); кольцо 
(Ring); звезда (Star); древовидная 
(Tree); ячеистая (Mesh) 
На чем строились системы 
пакетной обработки в 
прошлом веке 
мэйнфрейм 
Выберите неверный ответ:  в 
многотерминальных системах 
разделения времени - 
все функции стали 
распределенными 
Какие из перечисленных 
сетей хронологически 
появились первыми? 
глобальные вычислительные 
сети 
Многотерминальные 
системы, работающие в 
режиме разделения времени 
стали первым шагом на пути 
создания … 
локальных вычислительных 
сетей 
В каких сетях из 
перечисленных были впервые 
предложены и отработаны 
основные идеи и концепции 
современных 
вычислительных сетей? 
глобальные сети 
Что из перечисленного стало 
реальным конкурентом 
мэйнфреймов? 
мини-ЭВМ 
В каком году появилась 
первая сеть ARPANET? 1969 
Что из перечисленного 
заменило в сетях мини-ЭВМ 
и мэйнфреймы? 
персональные компьютеры 
Что такое компьютерная 
сеть? 
система компьютеров связанная 
каналами передачи информации 
Что из перечисленного 
является компонентом 
компьютерной сети? 
все ответы верны 
Выделенный сервер – это 
компьютер, служащий только 
для обслуживания клиентских 
машин 
Сервер – это 
компьютер или программа, 
предоставляющая некоторые 
услуги 
Клиент - это компьютер или программа, 
запрашивающая услуги 
Найдите правильное 
определение: протокол 
определяет 
все ответы верны 
Как классифицируются 
компьютерные сети? все ответы верны 
По протяженности 
компьютерные сети делят на все ответы верны 
Технология Ethernet 
определяется стандартом 
ІЕЕЕ: 
802.3 
Технология Wi-Fi 
определяется стандартом 
ІЕЕЕ: 
 802.11 
Компьютеры, входящие в 
сеть,  могут совместно 
использовать: 
все ответы верны 
Протокол – это стандарт передачи данных через 
компьютерную сеть 
Что из перечисленного 
принимает и отправляет 
трафик пользователя: 
узел 
Что из перчисленного 
осуществляет связь между 
другими устройствами: 
сетевые устройства 
Что из перечисленного 
обеспечивает соединение 
узлов и сетевых устройств? 
сетевая среда 
Топология сети, в которой 
каждый узел более высокого 
уровня связан с узлами более 
низкого уровня: 
дерево 
В активных деревьях в 
качестве узлов используются - 
компьютеры 
В пассивных деревьях в 
качестве узлов используются - 
 коммутаторы 
Топология компьютерной 
сети, в которой все 
компьютеры сети 
присоединены к центальному 
узлу, образуя физический 
сегмент сети: 
звезда 
Топология, в которой данные 
могут передаваться лишь в 
одном направлении, от 
одного компьютера к 
другому – соседнему, 
называется: 
кольцо 
Топология, при которой к 
общему кабелю подключены 
все компьютеры - 
 общая шина 
Топология, в которой каждый 
компьютер соединен линиями 
связи только с двумя 
другими: от одного он 
получает информацию, а 
другому только передает - 
кольцо 
Топология, в которой узлы 
образуют многомерную 
решетку, называется 
тор 
Это тип сетевой топологии, в 
которой рабочие станции 
расположены вдоль одного 
участка кабеля, называемого 
магистралью (сегментом) - 
общая шина (Bus) 
Это топология ЛВС, в 
которой все рабочие станции 
присоединены к 
центральному узлу, который 
устанавливает, поддерживает 
и разрывает связи между 
рабочими станциями: 
звезда (Star) 
Это топология ЛВС, в 
которой каждая станция 
соединена с двумя другими 
станциями, образуя 
кругооборот: 
кольцо (Ring) 
Это топология, в которой 
граф линий связи образует 
прямоугольную сетку 
(обычно двух- или трех
мерную): 
ячеистая (Mesh) 
Компьютер, к которому 
осуществляют доступ 
пользователи, для того чтобы 
использовать программы, 
данные или периферийные 
устройства называется -  
сервером 
Какой вид сервера управляет 
электронными сообщениями? Mailserver (почтовый сервер) 
Совместное использование 
принтера, графопостроителя 
или способность цифровой 
серверной печати относятся к 
базовой функциональности 
какого сервера? 
Printserver (сервер печати) 
Комплекс мероприятий, 
проводимых с целью 
предотвращения утечки, 
хищения, утраты, 
несанкционированного 
уничтожения, искажения, 
модификации (подделки), 
несанкционированного 
копирования, блокирования 
информации называется - 
защитой информации 
 … - это объект сети, 
генерирующий данные или 
потребляющий данные сети. 
абонент сети 
… - канал связи 
осуществляемый 
электрическими, радио или 
другими сигналами. 
физическая среда передачи 
В модели OSI первым 
уровнем является: физический 
В каком году был утвержден 
стандарт модели OSI? 1984 
Сколько уровней имее 
модель OSI? 7 
Какой уровень в модели OSI 
описывает принципы 
передачи сигналов, скорость 
передачи, спецификации 
каналов связи? 
физический 
Какой уровень в модели OSI 
проверяет доступность среды 
передачи, обнаруживает и 
исправляет ошибки, 
возникающие в процессе 
передачи? 
канальный 
Какой уровень в модели OSI 
обеспечивает соединение 
сетей? 
сетевой 
Какой уровень в модели OSI 
решает задачу передачи 
сообщений в составной сети с 
помощью подтверждения 
доставки и повторной 
отправки пакетов? 
транспортный 
Какой уровень в модели OSI 
позволяет запоминать 
информацию о текущем 
состоянии сеанса связи? 
сеансовый 
Какой уровень в модели OSI 
обеспечивает преобразование 
передаваемой информации из 
одной кодировки в другую? 
уровень представления 
Какой уровень в модели OSI 
реализует интерфейс между 
остальными уровнями модели 
и пользовательскими 
приложениями? 
прикладной уровень 
На каком уровне модели  OSI 
передаются биты? физический 
На каком уровне модели  OSI 
передаются кадры? канальный 
На каком уровне модели  OSI 
передаются пакеты? сетевой 
На каком уровне модели  OSI 
передаются блоки? транспортный 
На каком уровне модели  OSI 
передаются только данные? сеансовый 
На каком уровне модели  OSI 
передаются только данные? представления 
На каком уровне модели  OSI 
передаются только данные? прикладной 
Модем - это устройство для передачи информации по 
телефонным каналам связи 
Сколько уровней имеет стек 
протоколов TCP/IP? 4 
Электронная почта позволяет 
передавать: 
сообщения и приложенные к 
нему файлы 
Сервер - это 
мощный компьютер, к которому 
подключаются остальные 
компьютеры 
По способу соединения 
элементов сети 
классифицируются на: 
шина, кольцо, звезда 
По способу управления сети 
классифицируются на: 
централизованные и 
децентрализованные 
Как называется компьютер, 
независимо подключенный к 
сети Интернет? 
host компьютер  
Маршрут – это … процесс определения маршрута 
данных в сетях связи 
… - компьютер или 
программа, которая 
обслуживает другие 
компьютеры или программы. 
сервер 
Как называется узловой 
компьютер в сети? хост  
Сетевой адаптер - это: 
специальное аппаратное 
средство для эффективного 
взаимодействия персональных 
компьютеров сети 
Для соединения компьютеров 
в сетях используются кабели 
различных типов. По какому 
кабелю передаётся 
информация, закодированная 
в пучке света? 
 оптиковолоконный 
Какому уровню модели OSI 
принадлежит протокол IP?  сетевой 
Какому уровню модели OSI 
принадлежит протокол 
ICMP?  
сетевой 
Какому уровню модели OSI 
принадлежит протокол RIP?  сетевой 
Какому уровню модели OSI 
принадлежит протокол 
OSPF?  
сетевой 
Какому уровню модели OSI 
принадлежит протокол ARP?  сетевой 
Какому уровню  в модели 
OSI принадлежит протокол 
TCP?  
4 
Какому уровню  в модели 
OSI принадлежит протокол 
UDP?    
4 
К какому уровню в модели 
TCP/IP принадлежит 
протокол TCP? 
3 
К какому уровню в модели 
TCP/IP принадлежит 
протокол UDP? 
3 
Какой уровень в модели 
TCP/IP является самым 
нижним? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP является самым 
верхним? 
прикладной 
Какой уровень в модели 
TCP/IP соответствует 
физическому и канальному 
уровням модели OSI? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP занимается передачей 
дейтаграмм с использованием 
различных сетей? 
межсетевой уровень 
В качестве основного 
протокола межсетевого 
уровня в стеке протоколов 
TCP/IP используется 
протокол: 
IP 
На каком уровне стека 
протоколов TCP/IP работает 
протокол RIP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол OSPF? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол IP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол ICMP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол ARP? 
межсетевой уровень 
На каком уровне стека 
протоколов TCP/IP работает 
протокол SNMP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол FTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол Telnet? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол SMTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
протокол TFTP? 
прикладной 
На каком уровне стека 
протоколов TCP/IP работает 
Ethernet? 
уровень доступа к среде 
передачи 
На каком уровне стека 
протоколов TCP/IP работает 
Token Ring? 
уровень доступа к среде 
передачи 
На каком уровне стека 
протоколов TCP/IP работает 
FDDI? 
уровень доступа к среде 
передачи 
Какой уровень в модели 
TCP/IP обеспечивает 
доставку данных между 
двумя прикладными 
процессами? 
транспортный 
На каком уровне стека 
протоколов TCP/IP работает 
протокол TCP? 
транспортный 
На каком уровне стека 
протоколов TCP/IP работает 
протокол UDP? 
транспортный 
Протоколом для передачи 
файлов является: FTP 
Основным протоколом при 
пользовании услуг WWW 
является: 
HTTP 
Компьютер, подключенный к 
сети Internet, обязательно 
имеет - 
IP-адрес 
Какой протокол контроля 
передачи используется тогда, 
когда требуется надежная 
 TCP 
доставка сообщений? 
Какой адрес имеет 
компьютер, постоянно 
подключенный к Интернету? 
IP 
… - устаревший сетевой 
протокол канального уровня 
эталонной сетевой модели 
OSI для доступа к сетям стека 
TCP/IP через 
низкоскоростные линии связи 
путём простой инкапсуляции 
IP-пакетов. 
SLIP 
Какой протокол используется 
в настоящее время вместо 
протокола SLIP? 
PPP 
… – это набор правил, в 
соответствии с которым 
компьютеры обмениваются 
информацией. 
протокол 
Службу, какого ресурса 
использует компьютер
клиент? 
сервера 
Локальная сеть – это … 
небольшая компьютерная сеть в 
пределах одного помещения или 
предприятия 
LAN — это: 
сети компьютеров, размещенные 
на небольшой территории и 
использующие для связи 
высококачественные линии 
связи 
Какой кабель в основном 
используется для соединения 
компьютеров в локальной 
сети? 
витая пара 
Максимальная скорость 
передачи информации в 
компьютерной локальной 
сети (на основе кабеля витая 
пара) может достигать: 
100 Мбит/с 
Понятие, которое определяет 
обмен в сети, поток 
информации - 
траффик 
Комплекс аппаратных и 
программных средств, 
позволяющих компьютерам 
обмениваться данными - это: 
компьютерная сеть 
Протокол – это: специальное техническое 
соглашения для работы в сети 
Провайдер – это: 
владелец узла сети, с которым 
заключается договор на 
подключение к его узлу 
Коммуникационный 
протокол, описывающий 
формат пакета данных 
называется: 
IP 
Сетевое устройство, 
предназначенное для 
преобразования сферы 
одного вида протокола в 
другую сферу - 
шлюз 
Proxy – это … система для подключения  
компьютера к Интернету  
Выберите правильный 
вариант, где перечислены 
стандартные стеки 
коммуникационных  
протоколов: 
TCP/IP, IPX/SPX, NetBIOS/SMB, 
DECnet, SNA, OSI 
Где и когда был разработан 
проект компьютерной сети 
ARPANET? 
1968 год, США  
Какие протоколы считаются 
распространенными в стеке 
OSI?  
прикладные протоколы 
В каком году был принят 
открытый стандарт 
локальной сети Ethernet 
фирмами Xerox, Intel и Dec? 
1980 году 
Маршрутизация это… 
это процесс передачи данных с 
одного ПК на другой ПК, когда 
эти ПК находятся в разных 
сетях; 
В компьютерной сети 
Интернет транспортный 
протокол ТСР обеспечивает: 
способ передачи информации по 
заданному адресу 
Сетевой шлюз это: 
 аппаратный маршрутизатор или 
программное обеспечение для 
сопряжения компьютерных 
сетей, использующих разные 
протоколы 
Коммутация – это: 
 процесс соединения абонентов 
коммуникационной сети через 
транзитные узлы 
Информация в 
компьютерных сетях 
передается по каналам связи 
в виде отдельных: 
пакетов 
Коммутация пакетов это: 
техника коммутации абонентов, 
которая была специально 
разработана для эффективной 
передачи компьютерного 
трафика 
Какое из устройств служит 
для соединения между собой 
нескольких различных узлов 
компьютерной сети и обмена 
данными между ними, при 
этом имеет один  сетевой 
интерфейс: 
коммутатор 
Концентратор – это устройство для организации 
работы локальной сети 
Обмен информацией между 
компьютерными сетями, в 
которых действуют разные 
сетевые протоколы, 
осуществляется с 
использованием: 
шлюзов 
Свитч - это коммутатор 
Маршрутизатор – это роутер 
 Скорость передачи данных в 
сети, которую могут 
обеспечить коммутаторы в 
зависимости от модели: 
100 Мбит/сек 
Скорость передачи данных в 
сети, которую может 
обеспечить Fast Ethernet: 
100 Мбит/сек 
Скорость передачи данных в 
сети, которую может 
обеспечить Gigabit Ethernet: 
1000 Мбит/сек 
Для подключения к 
маршрутизаторам, 
коммутаторам, сетевым 
картам на концах витой пары 
используются: 
все перечисленные коннекторы 
 … - это совокупность 
объектов, образуемых 
устройствами передачи и 
обработки данных 
сеть 
…-  целесообразное 
преобразование формы 
подтвержденных данных их 
передача, хранение и 
обработка.  
кодирование  
Какой уровень модели OSI 
предназначен для сопряжения 
с физическими средствами 
соединения? 
физический 
Какой уровень модели OSI 
обеспечивает создание, 
передачу и прием кадров 
данных? 
канальный 
Функции сетевого уровня 
модели OSI -  
устанавливает связь в 
вычислительной сети между 
двумя системами и обеспечивает 
прокладку виртуальных каналов 
между ними 
Какой уровень модели OSI 
определяет адресацию 
физических устройств 
(систем, их частей) в сети? 
транспортный 
Какой уровень модели OSI 
обеспечивает управление 
диалогом для того, чтобы 
фиксировать, какая из сторон 
является активной в 
настоящий момент, а также 
предоставляет средства 
синхронизации? 
сеансовый 
Какой уровень модели OSI 
обеспечивает прикладным 
процессам средства доступа к 
области взаимодействия? 
представительский 
Какие функции выполняет 
прикладной уровень?  
обеспечивает удобный 
интерфейс для пользователя 
…- протокол организации 
управления сети. SNMP 
Система уплотнения 
оптического кабеля имеет 
название - 
DWDM 
Сети, которые охватывают 
значительную 
географическую область, 
страну, континент: 
WAN 
Что представляют из себя 
линии связи: все перечисленные 
Какие сети имеют как 
принадлежность, так и 
управление ко многим 
различным организациям: 
WAN 
Муниципальные сети 
объединяют компьютеры в 
пределах - 
города 
Какие из приведенных 
технологий относятся к 
технологиям глобальной 
сети? 
ATM, TCP/IP 
Спецификации, каких 
комитетов института IEEE 
появились в 1980 году? 
802
Какой фирмой и в каком году 
построена экспериментальная 
сеть Ethernet Network?  
Xerox, 1975 год 
Какой подуровень 
обеспечивает обслуживание 
сетевого уровня и связан с 
передачей и приемом 
пользовательских 
сообщений? 
LLC 
Укажите диаметр 
коаксиального кабеля 10Base
5: 
0,5 дюйм 
Система кабельного 
телевидения относится к 
сетям: 
MAN 
Стандарт IEEE 802.16 – 
WiMax относится к сетям  MAN 
Потенциально достижимая 
скорость волоконно
оптических линий связи 
составляет: 
10 Гбит/сек 
Локальные сети объединяют 
компьютеры  пределах: организации 
В каких из перечисленных 
видов сетей маршрутизаторы 
соединяют различные виды 
сетевых технологий? 
WAN 
Как называется оператор 
подсети, соединяющий с 
другими сетями и 
Интернетом? 
провайдер 
Укажите максимальную 
пропускную способность 
коаксиального кабеля 10Base
5: 
500 м 
Укажите диаметр 
коаксиального кабеля 10Base
2:  
0,25 дюйм 
Укажите максимальную 
пропускную способность 
коаксиального кабеля 10Base
2: 
185 м 
Укажите максимальную 
пропускную способность 
оптоволоконного кабеля 
10Base-FB: 
2000 м 
Каким институтом, и в каком 
году была предложена 
технология FDDI? 
институт ANSI, 1986 г. 
Какое поколение мобильных 
сетей осуществляло только 
аналоговую передачу звука? 
1 
Какое поколение мобильных 
сетей было цифровым и 
передавало только голос? 
2 
Какое поколение мобильных 
сетей было цифровым и 
передавало речь и данные? 
3 
Какое разделение каналов 
применяется в 3G? кодовое 
Какое устройство выполняет 
функции физического и 
канального уровня? 
сетевой адаптер 
Укажите максимальное 
расстояние технологии 
Bluetooth: 
 100 м 
Укажите максимальную 
скорость технологии 
Bluetooth: 
721 Мбит/с 
… - это система протоколов 
беспроводной связи. WAP 
Максимальное число 
подключаемых компьютеров 
технологии Wi-Fi: 
50 
Как называются компьютеры 
подключенные к локальной 
сети?  
станциями 
Одним из важнейших 
трендов развития отрасли 
мобильной связи является 
такое понятие, как «Интернет 
вещей». Что это? 
взаимодействие типа 
«устройство – устройство» (без 
участия человека) 
Как расшифровывается WiFi? Wireless Fidelity 
К какому поколению 
мобильной связи относится 
GSM? 
2G 
Скорость передачи данных в 
локальной сети на основе 
коаксиального кабеля не 
превышает: 
10 Мбит/сек 
Как расшифровывается LTE?  Long Term Evolution 
Какой канал передачи 
информации, как правило, 
используют для соединения 
двух серверов? 
оптоволокно 
Какой тип данных передается 
на физическом уровне? биты 
Что означает «G» в 
аббревиатурах: 1G, 2G, 3G, 
4G? 
Generation 
Какой из способов 
подключения к Интернету 
обеспечивает наибольшие 
возможности для доступа к 
информационным ресурсам? 
постоянное соединение по 
оптоволоконному каналу 
 IP адрес нужен для: для всех перечисленных 
действий 
Данные, передаваемые с 
использованием протокола 
IP, помещаются в сообщение, 
называемое 
пакетом 
Глобальная компьютерная 
сеть - это: 
 совокупность локальных сетей и 
компьютеров, расположенных на 
больших расстояниях и 
соединенных с помощью 
каналов связи в единую систему 
Гиперссылки на Web
странице могут обеспечивать 
переход: 
на любую Web-страницу любого 
Web-сервера 
Что не содержит заголовка 
пакета IPv6: данные контрольной суммы 
Адрес IPv4 содержит 4 байта 
Адрес IPv6 содержит 16 байт 
Максимальное значение 
октета IP адреса в двоичной 
системе счисления: 
11111111 
Максимальное значение 
октета IP адреса в десятичной 
системе счисления: 
255 
Структура IP адреса 
представляет собой: 
двухуровневую иерархическую 
модель 
Причина создания IPv6: нехватка адресного пространства 
Индивидуальная адресация 
называется: unicast 
Групповая адресация 
называется: multicast 
Широковещательная 
адресация называется: broadcast 
Выберите адресное 
пространство частных IPv4 
адресов класса А: 
10.0.0.0 – 10.255.255.255 
Выберите адресное 
пространство частных IPv4 
адресов класса В: 
172.16.0.0 – 172.31.255.255 
Выберите адресное 
пространство частных IPv4 
адресов класса С: 
192.168.0.0 – 192.168.255.255 
Домен-это... 
часть адреса, определяющая 
адрес компьютера пользователя 
в сети 
Какой из перечисленных 
протоколов не является 
дистанционно-векторным? 
OSPF 
Протокол RIP является 
протоколом дистанционно-векторным 
Протокол OSPF является 
протоколом состояния каналов связи 
На каком уровне модели OSI 
используются MAC-адреса? канальном 
На каком уровне модели OSI 
передаются датаграммы? транспортный 
Какой из перечисленных 
MAC-адресов является 
индивидуальным? 
30-9С-23-15-Е8-8С 
Какой из перечисленных 
MAC-адресов является 
групповым? 
01-80-С2-00-00-08 
Какой из перечисленных 
MAC-адресов является 
широковещательным? 
 FF-FF-FF-FF-FF-FF 
Признаком группового MAC
адреса является равенство 
первого бита старшего байта 
1 
Централизованно MAC-адрес 
назначается  производителем 
Локально MAC-адрес 
назначается администратором сети 
Если MAC-адрес назначен 
централизованно, то 
индикатор способа 
назначения (второй бит 
старшего байта) равен 
0 
 Если MAC-адрес назначен 
локально, то индикатор 
способа назначения (второй 
бит старшего байта) равен 
1 
Сетевым узлом является:  
любое устройство, которое 
принимает и затем передает что
то через сеть, но вместо этого 
может просто получать и 
хранить данные, передавать 
информацию в другом месте или 
создавать и отправлять данные 
Пропускная способность — 
это 
метрическая характеристика, 
показывающая соотношение 
предельного количества 
проходящих единиц в единицу 
времени через канал, систему, 
узел 
Какая организация 
стандартов создала 
эталонную модель 
взаимодействия открытых 
систем? 
ISO  
Какая максимальная скорость 
передачи данных в сети Fast 
Ethernet? 
100 Мбит/с 
Какой формулой 
определяется максимальная  
пропускная способность 
каналов связи? 
Формула Шеннона 
В каком году началась 
разработка нового поколения 
мобильной связи 5G? 
2015 
Что из перечисленного 
является технологией 
пассивных оптических сетей? 
PON 
Найдите преимущества 
технологии PON: 
вес перечисленные 
преимущества 
Какая из перечисленных 
технологий является 
асимметричной? 
ADSL 
Какая из перечисленных 
технологий является 
симметричной? 
SDSL 
Какая из перечисленных 
технологий является 
однонаправленной? 
UDSL 
Какой тип кабеля из 
перечисленных используется  
в кабельных сетях: 
все перечисленные типы 
Какие требования 
предъявляются к 
транспортным сетям? 
все перечисленные требования 
На основе каких технологий 
строится современная 
транспортная сеть: 
на основе всех перечисленных 
технологий 
В основе какого стандарта 
лежит технология 
множественного доступа с 
кодовым разделением 
каналов: 
на основе всех перечисленных 
стандартов 
В чем назначение программы 
Cisco Packet Tracer? эмуляция модели OSI  
Что такое Cisco и каковы ее 
задачи? 
 компания Cisco является 
разработчиком и 
производителем сетевого 
оборудования   
Какая из перечисленных 
программ не является 
эмулятором сетевой среды? 
 LAN Calculator  
Какие устройства служат для 
поиска оптимального 
маршрута передачи данных 
на основании алгоритмов 
маршрутизации? 
маршрутизаторы   
Какую линию связи следует 
выбрать для связи между 
кабельным модемом и 
облаком? 
коаксиальный кабель   
Какой тип кабеля следует 
использовать при соединении 
роутеров между собой? 
 медный кроссовер   
Какой тип шифрования 
предоставляет наиболее 
высокую защиту 
беспроводной сети? 
 WPA2 
Когда была запущена первая 
сеть UMTS: 2001 
К какому поколению 
мобильной связи относится 
стандарт UMTS: 
3 
К какому поколению 
мобильной связи относится 
стандарт LTE: 
4 
К какому поколению 
мобильной связи относится 
стандарт WiMAX: 
4 
К какому классу стандартов 
относится стандарт WiMAX: MAN 
Какая из перечисленных 
технологий работает в 
состоянии, когда разные 
части сети почти, но не 
совсем синхронизированы: 
PDH 
В чем отличие режима 
реального времени от режима 
симуляции сети в программе 
Cisco Packet Tracer? 
в режиме симуляции можно 
имитировать сетевые события 
В чем главное назначение 
протокола ICMP? 
ICMP используется для передачи 
сообщений об ошибках и других 
исключительных ситуациях, 
возникших при передаче данных 
В чем назначение команды 
Ping? 
это команда для проверки 
соединений в сетях на основе 
TCP/IP 
В каком режиме пользователь 
в программе Cisco Packet 
Tracer может посмотреть 
структуру пакета? 
в режиме симуляции 
В каком из утверждений, 
верно описан принцип 
работы хаба? 
хаб повторяет пакет на всех 
портах надеясь, что на одном из 
них есть получатель 
информации 
В технологии PDH в качестве 
входного используется 
сигнал основного цифрового 
канала, а на выходе 
формируется поток данных 
со скоростями: 
n * 64 кбит/с 
Где широко используется 
синхронная оптическая сеть 
SONET? 
в США 
Найдите отличительную 
особенность технологии 
DWDM: 
всё перечисленное 
Какая система счисления 
используется в MAC-адресах: шестнадцатеричная (16) 
Найдите неверное 
утверждение: 
режим моделирования 
(симуляции) позволяет 
просматривать и изменять 
записи в кэш ARP 
Как называется топология, в 
которой все компьютеры сети 
присоединены к 
центральному узлу, образуя 
физический сегмент сети: 
звезда 
Что не может выступать в 
роли центрального узла 
звезды? 
роутер 
Какое устройство подает 
пакет на все порты? концентратор 
В какой топологии выход из 
строя одной рабочей станции 
не отражается на работе всей 
сети в целом? 
звезда 
Основной принцип 
технологии «клиент-сервер»: все перечисленные принципы 
Для работы технологии 
DWDM необходим: все перечисленные устройства 
Назовите компонент сетевого 
приложения: все перечисленные компоненты 
Сеть, в которой каждый 
компьютер может быть 
администратором и 
пользователем одновременно, 
называется: 
одноранговой сетью 
Назовите преимущество 
одноранговых сетей: 
все перечисленные 
преимущества 
Какой из перечисленных 
недостатков присущ для 
одноранговых сетей: 
все перечисленные недостатки 
Сколько компьютеров может 
быть в одноранговой сети?  11 
Управление доступом на 
уровне ресурсов существует: в одноранговых сетях 
Управление на уровне 
пользователей существует в архитектуре клиент/сервер 
Какой вид сервера 
используется в локальных 
сетях? 
все перечисленные виды 
серверов 
Какой вид сервера 
используется в глобальных 
сетях? 
все перечисленные виды 
серверов 
На каком уровне модели OSI 
работает хаб, который 
отправляет 
широковещательный запрос? 
 1-й уровень OSI 
Что такое PDU? 
обобщённое название фрагмента 
данных на разных уровнях 
модели OSI: 
С какой целью (для чего) 
была разработана модель 
OSI? 
 модель OSI моделирует работу 
любой (локальной и глобальной) 
сети 
Каким инструментом можно 
создавать надписи на схеме 
сети в программе Cisco Packet 
Tracer? 
Place Note 
На каком уровне модели OSI 
работает Switch? 2-й уровень OSI 
Какой протокол используется 
для получения IP адреса по 
имени определенного хоста? 
DNS 
Для чего используется DNS 
протокол? 
для всех перечисленных 
действий 
В каком году был разработан 
протокол DNS? 1983 
Какая из перечисленных 
функций характеризует 
протокол DNS? 
все перечисленные функции 
Для доступа к Web-серверу 
необходимо знать: IP адрес 
Что из перечисленного 
является функцией протокола 
DNS: 
все перечисленные функции 
Какой порт использует 
протокол DNS? 53 
Сколько символов 
используют домены стран 
(верхний уровень)? 
2 
Какой домен верхнего уровня 
в Internet имеет Россия: ru 
Какой протокол совершает 
обмен управляющими 
сообщениями: 
ICMP 
Какой из перечисленных 
протоколах является 
протоколом сообщения об 
ошибках: 
ICMP 
Какой из перечисленных 
протоколов является простым 
протоколом сетевого 
управления, стандартным 
Интернет-протоколом для 
управления устройствами в IP 
сетях на основе архитектур 
TCP/UDP: 
SNMP 
Какой из перечисленных 
компонентов есть в сети, 
использующей протокол 
SNMP для управления: 
все перечисленные компоненты 
На каком уровне модели OSI 
работает Router?  3-й уровень OSI 
В каких единицах измеряется 
скорость порта FastEthernet? Мбит/сек 
Какая вкладкав программе 
Cisco Packet Tracer служит 
для отображения внешнего 
вида коммутатора модели 
2960? 
Physical 
Какой принцип заложен при 
исследовании качества 
передачи трафика по сети 
(при исследование 
пропускной способности 
ЛВС)? 
увеличение размера пакета и 
отправка запросов с коротким 
интервалом времени, не ожидая 
ответа от удаленного узла, для 
того, чтобы создать небольшую 
нагрузку на сеть 
Наличие этого параметра не 
позволяет пакету бесконечно 
ходить по сети: 
 TTL 
Какую команду распознаёт 
IOS при наборе символов 
“en”? 
enable 
Для чего предназначены 
access порты? для подключения пользователей 
Рассмотрите перечисленые 
основные режимы 
конфигурации при настройке 
коммутатора. В каком ответе 
ошибка? 
 административный 
Что такое CLI в программе 
Cisco Packet Tracer, как и 
зачем используется? 
CLI – командная строка, 
используется для 
программирования устройств 
Cisco 
Как называется сеть, 
использующая в своем 
составе множество датчиков: 
сенсорная сеть 
Назовите основную 
особенность беспроводной 
сенсорной сети: 
все перечисленные особенности 
Какие преимущества имеет 
технология сенсорных сетей 
перед другими 
беспроводными и 
проводными системами: 
 все перечисленные 
преимущества 
Каждый узел сенсорной сети 
содержит: всё перечисленное 
Сенсорные сети строятся на 
технологии: ZigBee 
Какой уровень не связан с 
топологией? транспортный 
Какой из блоков данных по 
объему больше: сегмент 
К какому протоколу 
относятся  пакеты данных? IP 
Найдите неверный ответ: Для 
чего создаются виртуальные 
локальные сети (VLAN)? 
для объединения сетей 
различных топологий 
Что определяет команда 
Router1(config)#enable 
password parol? 
 пароль на привилегированный 
режим 
Какие алгоритмы 
используются для 
формирования таблиц 
маршрутизации? 
все перечисленные алгоритмы 
В каком типе алгоритма 
администратор сети сам 
решает, на какие 
маршрутизаторы передать 
пакеты и заносит 
соответствующие записи в 
таблицу маршрутизации 
вручную: 
фиксированной (статической) 
маршрутизации 
В каком типе алгоритма 
таблица маршрутизации или 
не используется или строится 
без участия протокола 
маршрутизации? 
простой маршрутизации 
В каком типе алгоритма 
обеспечивается 
автоматическое обновление 
таблиц маршрутизации после 
изменения конфигурации 
сети? 
адаптивной (динамической) 
маршрутизации 
Какие действия следует 
выполнить для того, чтобы 
проверить работоспособность 
Cisco HTML сервера? 
открываем клиентскую машину 
и на вкладке Desktop запускаем 
приложение Web Browser. После 
чего набираем IP адрес нашего 
WEB-сервера и нажимаем на 
кнопку GO 
Перед вами четыре октета: 
255.0.0.0. Что это может 
быть? 
 маска подсети 
Какие параметры сервер 
DHCP не предоставляет 
клиентам? 
 MAC адрес 
Какой протокол следит за 
тем, чтобы в сети не было 
повторения IP адресов? 
 ARP 
Для чего предназначена 
команда show ip route? 
для проверки таблицы 
маршрутизации роутера 
Траффик наиболее 
критический к задержкам, это - 
голосовой в реальном режиме 
Выберите основной принцип 
сетевой безопасности все перечисленные принципы 
Какое устройство, 
подключенное к компьютеру, 
обеспечивает 
информационную 
безопасность пользователя и 
дает разрешение для его 
работы? 
все перечисленные устройства 
Как обеспечивается защита 
от несанкционированного 
доступа? 
всеми перечисленными 
способами 
Как называется изменение 
MAC-адреса на программном 
уровне: 
MAC-spoofing 
Что значит CSMA/CD? 
множественный доступ с 
прослушиванием несущей и 
обнаружением коллизий  
Что значит CSMA/CA? 
множественный доступ с 
прослушиванием несущей и 
избежанием коллизий 
Коллизия  иначе это - столкновение 
К какому виду физической 
среды передачи данных 
относятся радиоканалы, 
лазерные и инфракрасные 
каналы? 
к беспроводному 
Для соединения типа: 
«компьютер-компьютер», 
«коммутатор-коммутатор» 
используется 
перекрестный кабель 
Что означает сообщение 
DHCPDISCOVER? 
нахождение доступных DHCP
серверов  
Нахождение доступных 
DHCP-серверов 
соответствует сообщению: 
DHCPDISCOVER 
Чему равна длина MAC 
адреса: 48 бит 
Предложение DHCP 
соответствует сообщению: DHCPOFFER 
Запрос DHCP соответствует 
сообщению: DHCPREQUEST 
Подтверждение DHCP 
соответствует сообщению: DHCPACT 
Что означает сообщение 
DHCPOFFER? предложение DHCP 
Что означает сообщение 
DHCPREQUEST? запрос DHCP 
Что означает сообщение 
DHCPACT? подтверждение DHCP 
Передача системе 
идентифицирующего 
признака пользователя 
называется: 
идентификация 
Сравнение 
идентифицирующего 
признака пользователя 
называется: 
аутентификация 
Для соединения типа 
«компьютер-коммутатор», 
«коммутатор- 
маршрутизатор» 
используется 
прямой кабель 
Какой командой открывается 
глобальный контекст 
конфигурирования в 
программе Cisco Packet 
Tracer? 
сonfig terminal 
Какая команда используется 
для проверки связи между 
устройствами? 
ping 
Команда no shutdown в 
программе Cisco Packet Tracer 
позволяет: 
включить интерфейс 
Команда write memory  в 
программе Cisco Packet Tracer 
позволяет: 
сохранить конфигурацию 
Какая команда устанавливает 
расширенный доступ к 
конфигурации? 
enable 
Графический 
пользовательский интерфейс - 
GUI 
Найдите типовую угрозу 
безопасности информации 
при использовании 
глобальных компьютерных 
сетей 
все перечисленные 
Подмена субъекта или 
объекта сети называется: маскарад 
Внедрение ложного объекта 
сети называется: человек посередине 
Какая причина облегчает 
нарушителю реализацию 
угроз безопасности 
информации в 
распределенных 
компьютерных системах: 
все перечисленные причины 
Что означает понятие 
конвергентных сетей? 
объединение нескольких услуг в 
рамках одной услуги 
Интерфейс командной 
строки, в котором 
инструкции компьютеру 
даются только путём ввода с 
клавиатуры текстовых строк 
(команд): 
CLI 
Средство для создания, 
сохранения и открытия 
средств администрирования 
которые управляют 
оборудованием, 
программными и сетевыми 
компонентами операционной 
системы Windows: 
MMC 
На каком уровне модели OSI 
действуют повторители и 
усилители? 
на физическом уровне 
На каком уровне модели 
действуют  мосты и  
коммутаторы? 
на канальном уровне 
UTP  кабель - это  кабель на основе 
неэкранированной медной пары 
STP кабель - это кабель на основе 
экранированной медной пары 
Для подключения к толстому 
коаксиальному кабелю 
применяют специальное 
устройство –  
трансивер 
Для подключения тонкого 
коаксиального кабеля 
используются: 
BNC-коннекторы 
К телекоммуникационным 
сетям относятся: все перечисленные сети 
 Что такое гетерогенная 
компьютерная сеть? все перечисленные сети 
Что такое гетерогенная 
сетевая архитектура? все перечисленные архитектуры 
Найдите неверный ответ: в 
чем плюсы статической 
маршрутизации? 
хорошее масштабирование, 
динамическое балансирование 
нагрузки 
Для чего служит метрика? 
каждый протокол 
маршрутизации использует свою 
систему оценки маршрутов 
(метрику) 
Как посмотреть, какие 
маршруты получены через 
соответствующий протокол? 
выполнить команду show ip route 
Укажите на ошибку в 
свойствах протокола 
динамической 
маршрутизации EIGRP: 
протокол EIGRP можно 
использовать не только на 
оборудовании компании Cisco, 
но и на любом другом 
В чем заключается 
маршрутизация пакетов в 
сети? 
маршрутизация - процесс 
определения в сети наилучшего 
(оптимального) пути, по 
которому пакет может 
достигнуть адресата 
Перечислите основные 
функции сетевой 
операционной системы: 
все названные функции 
Траффик наиболее 
критический к задержкам, это голосовой в реальном режиме 
Укажите неверную функцию 
сетевой ОС: 
подсчет числа компьютеров в 
сети 
Какая функция сетевой ОС 
заключается в обеспечении 
доступа к данным: 
управление каталогами и 
файлами 
Какая функция сетевой ОС 
включает обслуживание 
запросов на предоставление 
ресурсов, доступных по сети? 
управление ресурсами 
Какая функция сетевой ОС 
обеспечивает адресацию, 
буферизацию выбор 
направления для движения 
данных в разветвленной сети: 
коммуникационные функции  
Что значит отображение в 
сетевых операционных 
системах: 
наличие двух копий данных, на 
разных дисках, подключенных к 
одному контроллеру 
Что значит дублирование в 
сетевых операционных 
системах: 
наличие двух копий данных, на 
разных дисках, подключенных к 
разным контроллерам 
Менеджер в сетевой ОС – это 
программа: 
вырабатывающая сетевые 
команды 
Найдите неправильно 
указанную часть сетевой 
операционной системы 
отдельного компьютера: 
средства исправления сетевых 
ошибок 
Как называется сетевое 
программное обеспечение, 
принимающее запросы 
ввода/вывода для удаленных 
файлов? 
редиректор 
Как называется часть 
программного обеспечения, 
управляющая присвоением 
букв накопителя сетевым 
ресурсам? 
распределитель 
Сети с выделенными 
серверами называют: двухранговыми сетями 
Компьютер, работающий в 
сети, может выполнять 
функции: 
все перечисленные функции 
Хост – это: все перечисленные устройства 
Выберите неверное 
утверждение: 
 ограничение в числе хопов не 
дает применять RIP в небольших 
сетях 
При помощи какой команды 
в программе Cisco Packet 
Tracer можно проверить, что 
маршрутизатор видит все 
присоединённые к нему сети? 
show ip route 
Сетевое устройство, 
служащее для объединения 
отдельных участков единой 
компьютерной сети и не 
преобразующее информацию 
называется: 
HAB 
Сетевое устройство, 
служащее для определения 
маршрута, по которому 
наиболее целесообразно 
передавать пакеты 
информации, называется: 
ROUTER 
Сетевые устройства, 
служащие для объединения в 
единую сеть нескольких 
компьютерных сетей 
различных типов, а также для 
снижения нагрузки в сети 
называют: 
BRIDGE 
Сетевые устройства, 
служащие для объединения 
отдельных сетей с 
различными протоколами 
обмена называют: 
GATEWAY 
Средой передачи является: все перечисленные линии и 
каналы 
Какое преимущество имеют 
современные компьютерные 
сети? 
все перечисленные 
преимущества 
Какой протокол определяет 
форму передачи данных в 
современных компьютерных 
сетях и «нарезает» данные на 
пакеты? 
TCP 
Какой протокол определяет 
направление передачи 
данных по сетевому адресу, 
имеющемуся в каждом 
пакете? 
IP 
Какой протокол называют 
адресным протоколом? IP 
Какой протокол обеспечивает 
идентификацию 
персонального компьютера с 
уникальным сетевым адресом 
и именем? 
DNS 
В чем отличие протоколов 
RIP и OSPF? Найдите ошибку 
в ответах 
конфигурировать протокол RIP 
сложнее, чем OSPF 
Укажите неверное 
утверждение: 
LSA сообщения о состоянии 
каналов отправляются 
протоколом OSPF один раз в 10 
минут 
Кто участвует в решении 
вопросов безопасности сети: 
списки управления доступом 
(ACL) 
Это кабель, в котором 
изолированная пара 
проводников скручена с 
небольшим числом витков на 
единицу длины - 
UTP 
Стандартизацией технологий 
локальных сетей занимается-  IEEE  
Gigabit Ethernet –  
гигабитный Ethernet – локальная 
сеть с пропускной способностью 
1000 Мбит/с 
Какой метод доступа к среде 
передачи используют Fast 
Ethernet и Gigabit Ethernet? 
метод CSMA/CD 
10Base-5, 10Base-2, 10Base
T……. что обозначает число 
10 в вышеуказанных 
названиях: 
битовую скорость передачи 
данных – 10 Мбит/с 
Какой протокол является 
протоколом передачи 
гипертекста? 
HTTP 
Какой протокол обслуживает 
службу WWW (WORD WIDE 
WEB – Всемирная паутина)? 
HTTP 
Какой протокол является 
протоколом передачи 
файлов? 
FTP 
Какой протокол является 
протоколом передачи почты? SMTP 
Назовите неверно указанный 
компонент службы WWW 
(Всемирной паутины): 
WEB-форум 
Назовите особенность 
технологии WWW: все перечисленные особенности 
Для работы службы 
телеконференций USENET 
используется протокол: 
NNTP 
Какое из следующих 
устройств, принимая решение 
о дальнейшем перемещении 
пакета, выходит из 
информации о доступности 
канала и степенях его 
загрузки : 
маршрутизатор 
10Base-5, 10Base-2, 10Base
T……. что обозначает слово 
Base  в вышеуказанных 
названиях? 
метод передачи на одной 
базовой частоте 10 МГц 
Технология Ethernet получила 
свое название благодаря 
своему создателю –  
Роберту Меткалфу 
Продолжите выражение: 
протокол обратного 
преобразования RARP — 
Reverse Address Resolution 
Protocol - 
находит логический адрес (IP
адрес) для компьютера по его 
физическому адресу 
Протокол ARP – Address 
Resolution Protocol:  протокол нахождения адреса 
Какие виды режима 
адресации поддерживает 
протокол IPv4? 
одноадресный, 
широковещательный, 
многоадресный 
Для передачи файлов по сети 
используется протокол…  FTP 
Задан адрес электронной 
почты в сети Интернет: 
fortuna@list.ru. Каково имя 
почтового сервера? 
list.ru 
Выберите корректный IP
адрес компьютера в сети 108.214.198.112 
Определите номер 
компьютера в сети по IP 
215.128.255.106 
106 
Как называется часть 
электронной логической 
схемы, которая реализует 
элементарную логическую 
функцию? 
логический элемент компьютера
Под термином «интерфейс» 
понимается  - 
внешний вид программной 
среды, служащий для 
обеспечения диалога с 
пользователем 
Протокол TCP/IP является  базовым транспортным сетевым 
протоколом 
Совокупность характеристик 
и параметров, определяющих 
функционально-логическую и  
структурную организацию 
систем – это 
архитектура вычислительной 
системы 
В стеке протоколов TCP/IP  
уровень II …. 
является основным и работает на 
базе протокола управления 
передачей TCP 
Cетевое устройство, 
соединяющее между собой 
сегменты локальной сети: 
мост 
Продолжите выражение: 
протокол коммуникации — 
это  
согласованный набор 
конкретных правил обмена 
информацией между разными 
устройствами передачи данных 
Какие виды узлов сети 
бывают: 
оконечный узел, 
промежуточный узел, смежный 
узел 
На каком уровне эталонной 
модели OSI функционируют 
маршрутизаторы? 
на сетевом уровне 
Архитектура сети — это 
реализованная структура сети 
передачи данных, определяющая 
её топологию, состав устройств 
и правила их взаимодействия в 
сети 
Сетевая архитектура 
высокоскоростной передачи 
данных по оптоволоконным 
линиям: 
FDDI 
При помощи каких 
компонент  сетевые процессы 
могут идентифицировать 
друг друга? 
IP-адрес, протокол (TCP/UDP), 
порт 
UDP –  это 
транспортный протокол, 
передающий сообщения
датаграммы без необходимости 
установки соединения в IP-сети 
TCP –  это 
транспортный протокол 
передачи данных в сетях TCP/IP, 
предварительно 
устанавливающий соединение с 
сетью 
Базовая Система Ввода
Вывода (BIOS) 
предназначена для: 
самодиагностики и 
самотестирования материнской 
платы и устройств 
подключенных к ней 
Что такое быстродействие 
процессора? 
число элементарных операций, 
выполняемых процессором в 
единицу времени 
Основной характеристикой 
компьютерного блока 
питания является: 
мощность 
Время доступа к жёсткому 
диску измеряется в: наносекундах 
Тактовая частота 
указывает … 
сколько элементарных операций 
(тактов) микропроцессор 
выполняет за одну секунду 
Скорость работы компьютера 
зависит от … 
тактовой частоты обработки 
информации в процессоре 
Характеристиками 
оперативной памяти 
являются 
объем, время доступа  
Группа компьютеров, 
объединённых 
высокоскоростными 
каналами связи, 
представляющая с точки 
зрения пользователя единый 
аппаратный ресурс 
называется 
кластером 
Какой из перечисленных 
видов памяти имеет самый 
большой объем? 
внешняя память 
Сервер на котором хранятся 
файлы общего доступа 
называется 
файл-сервер 
Что такое прерывание? 
это временный останов 
выполнения одной программы в 
целях оперативного выполнения 
другой, в данный момент более 
важной 
Правила, по которым 
осуществляется обмен 
информации о путях 
передачи пакетов между 
маршрутизаторами - это 
протоколы маршрутизации 
Утилита ping позволяет:  проверить наличие соединения 
Найдите верное утверждение:  
команда ping все ответы верны 
О переходе в 
привилегированный режим 
будет свидетельствовать 
появление в командной 
строке приглашения в виде 
знака -  
# 
Режим глобального 
конфигурирования — 
реализует мощные 
однострочные команды, которые 
решают задачи 
конфигурирования 
Обобщенная геометрическая 
характеристика 
компьютерной сети – это: 
топология сети 
Протокол компьютерной сети - совокупность: 
правил, регламентирующих 
прием-передачу, активацию 
данных в сети 
Соединение нескольких сетей 
дает: межсетевое объединение 
Поток сетевых сообщений 
определяется: трафиком 
При вводе какого знака в 
командной строке любого 
режима имени команды  на 
экран выводятся 
комментарии к команде? 
? 
Пароль доступа позволяет 
контролировать доступ в 
привилегированный  режим. 
Как правильно установить в 
качестве пароля - cisco? 
Router1(config)#enable password 
cisco 
Какая из команд выведет 
детальную информацию о 
каждом интерфейсе (для 
роутера):   
Router1 show interfaces 
Вид маршрутизации, при 
котором таблица 
маршрутизации заполняется 
и обновляется автоматически 
при помощи одного или 
нескольких протоколов 
маршрутизации - 
динамическая маршрутизация 
Вид маршрутизации, при 
котором таблица 
маршрутизации заполняется 
вручную администратором 
сети - 
статическая маршрутизация 
Маршрутизаторы 
обмениваются друг с другом 
информацией о маршрутах с 
помощью служебных пакетов 
по протоколу - 
UDP 
Протокол с отслеживанием 
состояния каналов - OSPF 
Cisco ASA - 
аппаратный межсетевой экран с 
инспектированием сессий с 
сохранением состояния 
Что используется по 
умолчанию в команде 
Protocol:  
ip 
Какую клавишу следует 
удерживать для того, чтобы 
скопировать ПК несколько 
раз? 
Ctrl  
Для чего служит параметр 
“n” в команде ping –n  
параметр «–n» позволяет задать 
количество передаваемых эхо
запросов 
Какая кнопка позволяет 
отображать моделирование 
всего ping-процесса 
пошагово? 
Capture/Forward 
По виду командной строки 
Router(config-if) определите в 
каком режиме находится 
роутер: 
настройка интерфейсов  
По виду командной строки 
Router определите в каком 
режиме находится роутер: 
 пользовательский  
По виду командной строки 
Router#  определите в каком 
режиме находится роутер: 
привилегированный  
По виду командной строки 
Router(config)# определите в 
каком режиме находится 
роутер: 
глобальная конфигурация  
Что имитирует вкладка CLI? 
имитирует прямое кабельное 
(консольное) подключение к 
сетевому устройству  
Для чего служит транковый 
порт? 
для настройки связи 
коммутаторов, то есть, для 
создания магистрали обмена 
между коммутаторами в VLAN   
Найдите неверные ответ: что 
из себя представляет 
транковый порт? 
транковый порт — это канал для 
соединения ПК и сервера  
Какая из приведенных 
команд зажигает лапочку 
порта? 
no sh 
Для чего предназначена 
служба FIREWALL? 
Firewall выполняет функцию 
защитного барьера между 
компьютером и Интернетом и 
позволяет контролировать весь 
входящий и исходящий трафик   
  
  
  
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
1. Технология Ethernet определяется стандартом ІЕЕЕ: 
 
 802.3 
 
2. Когда был разработан проект компьютерной сети ARPANET? 
 
 1969 год 
 
3. Какое устройство служит для соединения между собой нескольких различных узлов 
компьютерной сети и обмена данными между ними, при этом имеет один сетевой 
интерфейс: 
 
 сетевая карта 
 
4. Какая организация разработала базовую модель связи открытых систем OSI? 
 
 ISO (International Standardization Organization) 
 
5. Год начала разработки нового поколения мобильной связи 5G: 
 
 2015 
 
6. Оператор подсети, соединяющий с другими сетями и Интернетом, называется … 
 
 провайдер 
7. Найдите верный ответ, где правильно (сверху вниз) перечислены уровни модели OSI: 
прикладной, представительский, сеансовый, транспортный, сетевой, канальный, физический 
8. Какому уровню модели OSI относится протокол RIP? 
сетевой 
9. Что используется в активных деревьях в качестве узлов?
коммутаторы 
10. На каком уровне в стеке протоколов TCP/IP работает протокол FTP? 
прикладной 
11. Какая это топология ЛВС, в которой каждая станция соединена с двумя другими станциями, 
образуя кругооборот? 
кольцо (Ring) 
12. Что такое протокол? Это - 
стандарт передачи данных через компьютерную сеть 
13. Спецификации каких комитетов института IEEE появились в 1980 году? 
802 
14. Какая это топология ЛВС, в которой все рабочие станции присоединены к центральному узлу, 
который устанавливает, поддерживает и разрывает связи между рабочими станциями? 
звезда (Star) 
15. Понятие клиента: 
компьютер или программа, запрашивающая услуги 
16. Как производится классификация компьютерных сетей? 
все ответы верны 
17. Какой уровень модели OSI передает пакеты? 
сетевой 
12.01.2025, 18:54 Тесты промежуточный контроль | HEMIS Student axborot tizimi 
https://student.fbtuit.uz/test/result/507408 1/8
 8 
 
 
18. Компания Cisco и ее задачи: 
 
 компания Cisco является разработчиком и производителем сетевого оборудования 
 
19. Понятие сервера: 
 
 компьютер или программа, предоставляющая некоторые услуги 
 
20. Продолжите определение: маршрутизатор – это … 
 
 роутер 
 
 
 
 
 
 
1. На каком уровне в стеке протоколов TCP/IP работает протокол IP? 
 
 межсетевой уровень 
 
2. Данные, передаваемые с использованием протокола IP, помещаются в сообщение, 
которое называется 
 
 пакетом 
 
3. На каком уровне в стеке протоколов TCP/IP работает Ethernet? 
 
 уровень доступа к среде передачи 
 
4. Какое устройство служит для соединения между собой нескольких различных узлов 
компьютерной сети и обмена данными между ними, при этом имеет один сетевой 
интерфейс: 
 
 коммутатор 
 
5. Комитет IEEE 802.6: 
 
 описывает принципы и правила функционирования сетей городского масштаба (MAN) 
12.01.2025, 18:54 Тесты промежуточный контроль | HEMIS Student axborot tizimi 
https://student.fbtuit.uz/test/result/507408 2/8
 8 
 
 
 
6. Для соединения двух серверов, какой канал передачи информации используют? 
 
 кросс кабель 
 
7. Что обеспечивает соединение узлов и сетевых устройств? 
 
 сетевая среда 
 
8. Технология Ethernet определяется стандартом ІЕЕЕ: 
 
 802.3 
 
9. Что такое локальная сеть? 
12.01.2025, 18:54 Тесты промежуточный контроль | HEMIS Student axborot tizimi 
https://student.fbtuit.uz/test/result/507408 3/8
 8 
 
 
 небольшая компьютерная сеть в пределах одного помещения или предприятия 
 
10. Дополните определение: … – это набор правил, в соответствии с которым 
компьютеры обмениваются информацией. 
 
 протокол 
 
11. Муниципальные сети объединяют компьютеры в пределах… 
 
 города 
 
12. Какая потенциально достижимая скорость волоконно-оптических линий связи? 
 
 100 Гбит/сек 
 
13. Как называется коммуникационный протокол, описывающий формат пакета 
данных? 
 
 TCP|IP 
 
14. Какой из уровней модели OSI предназначен для сопряжения с физическими 
средствами соединения? 
 
 физический 
 
15. Что такое протокол? 
 
 специальное техническое соглашения для работы в сети 
 
16. Понятие коммутации пакетов - 
 
 это техника коммутации абонентов, которая была специально разработана для эффективной 
передачи компьютерного трафика 
 
17. Продолжите определение: свитч – это … 
12.01.2025, 18:54 Тесты промежуточный контроль | HEMIS Student axborot tizimi 
https://student.fbtuit.uz/test/result/507408 4/8
 8 
 
 
 
 коммутатор 
12.01.2025, 18:54 Тесты промежуточный контроль | HEMIS Student axborot tizimi 
https://student.fbtuit.uz/test/result/507408 5/8
 8 
 
 
18. Какое разделение каналов применяется в сетях 3G? 
 
 кодовое 
 
19. Выберите из предложенных адресное пространство частных IPv4 
адресов класса С: 
 
 192.168.0.0 – 192.168.255.255 
 
20. Основное назначение ISDN — это: 
 
 передача цифрового сигнала по телефонным линиям 

</p>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
